import { TablesProps } from "@/types";

export const foodTable: TablesProps = {
  slug: "lesson-5",
  type: "food-table",
  title: {
    ru: `ЕДА`,
    mkd: `<span>ХРАНА</span>`,
  },
  content: {
    subtitle: [`Македонский язык`, `Русский язык`],
    words: [
      {
        mkd: "би\u0301бер",
        ru: "перец (приправа)",
      },
      {
        mkd: "благ",
        ru: "сладкий",
      },
      {
        mkd: "ва\u0301ри",
        ru: "варить",
      },
      {
        mkd: "ва\u0301рен",
        ru: "варёный",
      },
      {
        mkd: "вку\u0301сен",
        ru: "вкусный",
      },
      {
        mkd: "го\u0301рчлив",
        ru: "горький",
      },
      {
        mkd: "гра\u0301шок",
        ru: "горошек",
      },
      {
        mkd: "гро\u0301зје",
        ru: "виноград",
      },
      {
        mkd: "до\u0301мат",
        ru: "томат",
      },
      {
        mkd: "жита\u0301рици",
        ru: "злаковые, хлопья из злаков",
      },
      {
        mkd: "за\u0301чини",
        ru: "приправы",
      },
      {
        mkd: "зе\u0301јтин",
        ru: "растительное масло",
      },
      {
        mkd: "зе\u0301лен",
        ru: "зелёный",
      },
      {
        mkd: "зе\u0301лка",
        ru: "капуста",
      },
      {
        mkd: "ја\u0301болко",
        ru: "яблоко",
      },
      {
        mkd: "ја\u0301гнешко",
        ru: "ягнятина",
      },
      {
        mkd: "ја\u0301года",
        ru: "клубника",
      },
      {
        mkd: "ја\u0301јце",
        ru: "яйцо",
      },
      {
        mkd: "јо\u0301гурт",
        ru: "йогурт",
      },
      {
        mkd: "ју\u0301нешко",
        ru: "молодая говядина",
      },
      {
        mkd: "ка\u0301јсија",
        ru: "абрикос",
      },
      {
        mkd: "кашкава\u0301л",
        ru: "сыр",
      },
      {
        mkd: "ки\u0301сел",
        ru: "кислый, квашеный",
      },
      {
        mkd: "ке\u0301чап",
        ru: "кетчуп",
      },
      {
        mkd: "ко\u0301лбас",
        ru: "колбаса",
      },
      //-----
      { mkd: "ко\u0301мпир", ru: "картошка" },
      { mkd: "кра\u0301вји", ru: "коровий" },
      { mkd: "кра\u0301ставица", ru: "огурец" },
      { mkd: "кро\u0301мид", ru: "лук" },
      { mkd: "ла\u0301ден", ru: "холодный" },
      { mkd: "ли\u0301мон", ru: "лимон" },
      { mkd: "лу\u0301беница", ru: "арбуз" },
      { mkd: "лук", ru: "чеснок" },
      { mkd: "лут", ru: "острый" },
      { mkd: "мајо\u0301нез", ru: "майонез" },
      { mkd: "ма\u0301слинки", ru: "маслины, оливки" },
      { mkd: "мед", ru: "мёд" },
      { mkd: "мо\u0301рков", ru: "морковь" },
      { mkd: "ово\u0301шје", ru: "фрукты" },
      { mkd: "о\u0301вчи", ru: "овечий" },
      { mkd: "о\u0301риз", ru: "рис" },
      { mkd: "о\u0301цет", ru: "уксус" },
      { mkd: "па\u0301рче", ru: "кусочек" },
      { mkd: "мо\u0301дар па\u0301тлиџан", ru: "баклажан" },
      { mkd: "пе\u0301чурка", ru: "гриб" },
      { mkd: "пи\u0301лешко", ru: "курятина" },
      { mkd: "пи\u0301перка", ru: "перец (овощ)" },
      { mkd: "пи\u0301та", ru: "пирог" },
      { mkd: "по\u0301ртокал", ru: "апельсин" },
      { mkd: "пра\u0301ска", ru: "персик" },
      { mkd: "пр\u0301жи", ru: "жарить" },
      { mkd: "пр\u0301жен", ru: "жареный" },
      { mkd: "пу\u0301тер", ru: "сливочное масло" },
      { mkd: "ри\u0301ба", ru: "рыба" },
      { mkd: "сала\u0301ма", ru: "колбаса" },
      { mkd: "сва\u0301ри", ru: "сварить" },
      { mkd: "сва\u0301рен", ru: "сваренный" },
      { mkd: "сви\u0301нско", ru: "свинина" },
      { mkd: "сенф", ru: "горчица" },
      { mkd: "сла\u0301долед", ru: "мороженое" },
      { mkd: "сок", ru: "сок, газированный напиток (типа фанты)" },
      { mkd: "сол (ж.р.)", ru: "соль" },
      { mkd: "со\u0301лен", ru: "солёный" },
      { mkd: "сос", ru: "соус" },
      { mkd: "спа\u0301наќ", ru: "шпинат" },
      { mkd: "су\u0301па", ru: "суп" },
      { mkd: "те\u0301лешко", ru: "телятина" },
      { mkd: "тестени\u0301ни", ru: "макароны" },
      { mkd: "цве\u0301кло", ru: "свёкла" },
      { mkd: "цре\u0301ша", ru: "черешня" },
      { mkd: "цр\u0301вен", ru: "красный" },
      { mkd: "цр\u0301н", ru: "чёрный" },
      { mkd: "чо\u0301рба", ru: "густая похлёбка" },
      { mkd: "ше\u0301ќер", ru: "сахар" },
      { mkd: "шу\u0301мско о\u0301вошје", ru: "лесные ягоды" },
      { mkd: "шу\u0301нка", ru: "ветчина" },
    ],
  },
};
