import { TablesProps } from "@/types";

export const foodTable: TablesProps = {
  slug: "lesson-5",
  type: "food-table",
  title: {
    ru: `ЕДА`,
    mkd: `<span>ХРАНА</span>`,
  },
  content: {
    subtitle: [`Македонский язык`, `Русский язык`],
    words: [
      {
        mkd: "би*бер",
        ru: "перец (приправа)",
      },
      {
        mkd: "благ",
        ru: "сладкий",
      },
      {
        mkd: "ва*ри",
        ru: "варить",
      },
      {
        mkd: "ва*рен",
        ru: "варёный",
      },
      {
        mkd: "вку*сен",
        ru: "вкусный",
      },
      {
        mkd: "го*рчлив",
        ru: "горький",
      },
      {
        mkd: "гра*шок",
        ru: "горошек",
      },
      {
        mkd: "гро*зје",
        ru: "виноград",
      },
      {
        mkd: "до*мат",
        ru: "томат",
      },
      {
        mkd: "жита*рици",
        ru: "злаковые, хлопья из злаков",
      },
      {
        mkd: "за*чини",
        ru: "приправы",
      },
      {
        mkd: "зе*јтин",
        ru: "растительное масло",
      },
      {
        mkd: "зе*лен",
        ru: "зелёный",
      },
      {
        mkd: "зе*лка",
        ru: "капуста",
      },
      {
        mkd: "ја*болко",
        ru: "яблоко",
      },
      {
        mkd: "ја*гнешко",
        ru: "ягнятина",
      },
      {
        mkd: "ја*года",
        ru: "клубника",
      },
      {
        mkd: "ја*јце",
        ru: "яйцо",
      },
      {
        mkd: "јо*гурт",
        ru: "йогурт",
      },
      {
        mkd: "ју*нешко",
        ru: "молодая говядина",
      },
      {
        mkd: "ка*јсија",
        ru: "абрикос",
      },
      {
        mkd: "кашкава*л",
        ru: "сыр",
      },
      {
        mkd: "ки*сел",
        ru: "кислый, квашеный",
      },
      {
        mkd: "ке*чап",
        ru: "кетчуп",
      },
      {
        mkd: "ко*лбас",
        ru: "колбаса",
      },
      //-----
      { mkd: "ко*мпир", ru: "картошка" },
      { mkd: "кра*вји", ru: "коровий" },
      { mkd: "кра*ставица", ru: "огурец" },
      { mkd: "кро*мид", ru: "лук" },
      { mkd: "ла*ден", ru: "холодный" },
      { mkd: "ли*мон", ru: "лимон" },
      { mkd: "лу*беница", ru: "арбуз" },
      { mkd: "лук", ru: "чеснок" },
      { mkd: "лут", ru: "острый" },
      { mkd: "мајо*нез", ru: "майонез" },
      { mkd: "ма*слинки", ru: "маслины, оливки" },
      { mkd: "мед", ru: "мёд" },
      { mkd: "мо*рков", ru: "морковь" },
      { mkd: "ово*шје", ru: "фрукты" },
      { mkd: "о*вчи", ru: "овечий" },
      { mkd: "о*риз", ru: "рис" },
      { mkd: "о*цет", ru: "уксус" },
      { mkd: "па*рче", ru: "кусочек" },
      { mkd: "мо*дар па*тлиџан", ru: "баклажан" },
      { mkd: "пе*чурка", ru: "гриб" },
      { mkd: "пи*лешко", ru: "курятина" },
      { mkd: "пи*перка", ru: "перец (овощ)" },
      { mkd: "пи*та", ru: "пирог" },
      { mkd: "по*ртокал", ru: "апельсин" },
      { mkd: "пра*ска", ru: "персик" },
      { mkd: "пр*жи", ru: "жарить" },
      { mkd: "пр*жен", ru: "жареный" },
      { mkd: "пу*тер", ru: "сливочное масло" },
      { mkd: "ри*ба", ru: "рыба" },
      { mkd: "сала*ма", ru: "колбаса" },
      { mkd: "сва*ри", ru: "сварить" },
      { mkd: "сва*рен", ru: "сваренный" },
      { mkd: "сви*нско", ru: "свинина" },
      { mkd: "сенф", ru: "горчица" },
      { mkd: "сла*долед", ru: "мороженое" },
      { mkd: "сок", ru: "сок, газированный напиток (типа фанты)" },
      { mkd: "сол (ж.р.)", ru: "соль" },
      { mkd: "со*лен", ru: "солёный" },
      { mkd: "сос", ru: "соус" },
      { mkd: "спа*наќ", ru: "шпинат" },
      { mkd: "су*па", ru: "суп" },
      { mkd: "те*лешко", ru: "телятина" },
      { mkd: "тестени*ни", ru: "макароны" },
      { mkd: "цве*кло", ru: "свёкла" },
      { mkd: "цре*ша", ru: "черешня" },
      { mkd: "цр*вен", ru: "красный" },
      { mkd: "цр*н", ru: "чёрный" },
      { mkd: "чо*рба", ru: "густая похлёбка" },
      { mkd: "ше*ќер", ru: "сахар" },
      { mkd: "шу*мско о*вошје", ru: "лесные ягоды" },
      { mkd: "шу*нка", ru: "ветчина" },
    ],
  },
};
