import { TablesProps } from "@/types";

export const nullSubtype: TablesProps = {
  type: `null-subtype`,
  slug: "lesson-10",
  subtitle: `4. Нулевой подтип`,
  text: `В глаголах, оканчивающихся на <span>-уе</span>, <span>-ие</span>, и в некоторых глаголов на <span>-ае</span> гласная <span>е</span>
  исчезает. К ним примыкают глаголы с корнем <span>спи*е</span> «спать», у которых корневая гласная <span>и</span> меняется на
  <span>а</span>. Между гласными <span>у</span> и <span>а</span>, <span>и</span> и <span>а</span> возникает <span>j</span>:
  <span>о*тру«j»-а</span>, <span>и*спи«j»-а</span>`,
  content: {
    subtitle: [" ", "о*труе", "и*спие", "по*знае", "за*спие"],
    rows: [
      {
        person: "јас",
        forms: ["о*тру-в", "и*спи-в", "по*зна-в", "за*спа-в"],
      },
      {
        person: "ти",
        forms: ["о*тру", "и*спи", "по*зна", "за*спа"],
      },
      {
        person: "тој, та*а, то*а",
        forms: ["о*тру", "и*спи", "по*зна", "за*спа"],
      },
      {
        person: "ни*е",
        forms: ["о*тру-вме", "и*спи-вме", "по*зна-вме", "за*спа-вме"],
      },
      {
        person: "ви*е",
        forms: ["о*тру-вте", "и*спи-вте", "по*зна-вте", "за*спа-вте"],
      },
      {
        person: "ти*е",
        forms: ["о*тру«j»-а", "и*спи«j»-а", "по*зна-а", "за*спа-а"],
      },
    ],
  },
};
