import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-16`,
  sections: [
    {
      type: "lecture",
      subtitle: {
        ru: "ДИАЛОГ",
        mkd: "ДИЈАЛОГ",
      },
      content: {
        description: {
          mkd: `<em>На*таша, И*ван, На*ум и Еми*лиjа ше*таат по ко*рзото.</em>`,
          ru: `<em>Наташа, Иван, Наум и Эмилия вышли на променад.</em>`,
        },
        dialogue: [
          {
            speaker: {
              id: `ivan`,
              mkd: `И*ван:`,
              ru: `Иван:`,
            },
            mkd: [
              `А коj наста*пува? И што и*ма во програ*мата?.`,
              `Чи*тав за него*вите на*стапи во Аме*рика. Музи*чките крити*чари мно*гу го фа*леа. Не*ма да jа про*пуштам о*ваа ша*нса! На*ум, 
              Еми*лиjа, са*кате со нас?`,
              `Па, мо*же. Jас са*кам се*каква му*зика, и кла*сична, и рок, и на*родна. Па*тем ре*чено, мно*гу би са*кал да слу*шнам и*зворна 
              маке*донска му*зика.`,
              `Задолжи*телно ќе до*jдеме ту*ку на ве*чера!`,
            ],
            ru: [
              `А кто выступает? И что в программе?`,
              `Я читал о его выступлениях в Америке. Музыкальные критики его очень хвалили. Я не упущу такой шанс! Наум, Эмилия, хотите с нами?`,
              `Ну, можно. Я люблю всякую музыку, и классическую, и рок, и народную. Кстати, я бы очень хотел услышать аутентичную македонскую 
              музыку.`,
              `Мы обязательно придём сюда на ужин!`,
            ],
          },
          {
            speaker: {
              id: `naum`,
              mkd: `На*ум:`,
              ru: `Наум:`,
            },
            mkd: [
              `Не подне*сувам кла*сична му*зика. Слу*шам са*мо рок. А*ко са*кате, ќе ве но*сам на жи*ва сви*рка в пе*ток. Ќе сви*ри нов бенд, 
              Armadillo. Мно*гу се до*бри.`,
              `А*ко са*каш да ви*диш ка*ко оби*чнте лу*ѓе jа доживу*ваат македо*нската му*зика тре*ба да о*диш во о*ваа кафе*ана. Ту*ка се*коjа 
              ве*чер и*ма жи*ва му*зика. Сви*рат ка*вал, га*jда, зу*рла, хармо*ника и та*пан, а го*стите пе*ат и и*граат о*ра.`,
            ],
            ru: [
              `Я не переношу классическую музыку. Я слушаю только рок. Если хотите, я отведу вас на выступление. Будет играть новая группа 
              "Армадилло". Они очен хороши.`,
              `Если ты хочешь увидеть, как обычные люди воспринимают македонскую музыку, ты должен пойти в этот национальный ресторан. Тут 
              каждый вечер есть живая музыка. Играют на кавале, гайде, зурне, аккордеоне и барабане, а гости поют и танцуют оро.`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На*таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Че*каjте. Ту*ка пи*шува де*ка во са*бота ќе и*ма ко*нцерт на кла*сична му*зика во цр*квата Све*та Со*фиjа. И*ван, то*а е у*бава 
              ша*нса да jа ви*диме та*а цр*ква од XI век.`,
              `Позна*тиот маке*донски пиjани*ст Си*мон Тр*пчевски, ќе изве*дува де*ла на Хендл, Мо*царт, Бе*товен, Чаjко*вски.`,
              `Ќе те но*сам на на*стапот на анса*мблот за на*родни и*гри и пе*сни на Маке*дониjа "Та*нец". Дру*гарка ми ве*ти би*лети во пр*виот 
              ред. Ќе ви*диш ка*ко се и*граат македо*нските о*ра и ќе ги слу*шнеш македо*нските пе*сни. Игроо*рците и пеjа*чите настапу*ваат во
              традициона*лни но*сии.`,
            ],
            ru: [
              `Подождите. Тут пишут, что в субботу в церкви святой Софии будет концерт классической музыки. Иван, это хорошая возможность 
              увидеть эту церковь XI века.`,
              `Известный македонский пианист Симон Трпчевски, он исполнит произведения Генделя, Моцарта, Бетховена, Чайковского.`,
              `Я тебя отведу на выступление ансамбля народных танцев и песен Македонии "Танец". Моя подруга обещала билеты в первом ряду. Ты 
              увидишь, как танцуют македонские оро и услышишь македонские песни. Танцоры и певцы одеты в народные костюмы.`,
            ],
          },
          {
            speaker: {
              id: `еmilia`,
              mkd: `Еми*лиjа:`,
              ru: `Эмилия:`,
            },
            mkd: [
              `Jас со задо*волство. Ќе го ви*кнам и брат ми. За*врши му*зичко учи*лиште, сви*ри виоли*на. Слуша*jќи ги него*вите раскажу*вања за 
              ра*злични му*зички де*ла и музи*чари, jас jа за*сакав класи*чната му*зика. Брат ми ги посе*тува си*те ко*нцерти во ра*мките на
              фестива*лот "О*хридско ле*то".`,
            ],
            ru: [
              `С удовольствием. Я позову своего брата. Он закончил музыкальную школу и играет на скрипке. Слушая его рассказы о различных 
              музыкальных произведениях и музыкантах, я полюбила классическую музыку. Мой брат посещает все концерты в рамках фестиваля
              "Охридское лето".`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },
          { speakerId: "еmilia", language: "ru", replyIndex: 0 },
          { speakerId: "еmilia", language: "mkd", replyIndex: 0 },
          { speakerId: "naum", language: "ru", replyIndex: 0 },
          { speakerId: "naum", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },
          { speakerId: "naum", language: "ru", replyIndex: 1 },
          { speakerId: "naum", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
        ],
      },
    },
  ],
};

//  ѐ
