import { TablesProps } from "@/types";

export const example3: TablesProps = {
  slug: "lesson-13",
  type: "example-3",
  subtitle: "БИ-КОНСТРУКЦИЯ",
  content: {
    text: `Би-конструкция состоит из частицы <span>би</span> и л-формы, между ними могут стоять только краткие частицы д.п., в.п. / 
    возвратная частица <span>се</span>.`,
    words: [
      {
        mkd: "Jас не би ре*кол та*ка.",
        ru: "Я бы так не сказал.",
      },
      {
        mkd: "Да*ли ти би му се jа*вила?",
        ru: "Ты бы ему позвонила?",
      },
      {
        mkd: "Ни*е би са*кале да продо*лжиме.",
        ru: "Мы бы хотели продолжить.",
      },
    ],
  },
};
