import { TablesProps } from "@/types";

export const example2: TablesProps = {
  slug: "lesson-13",
  type: "example-2",
  content: {
    text: `Кроме того, такие формы используются, когда говорящий хочет дистанцироваться от сообщаемой информации, поскольку считает её 
    недостоверной, когда сильно удивлён или делает предположение на основе имеющихся данных.`,
    words: [
      {
        mkd: "На*те му ка*жа на профе*сорот де*ка не си му го вра*тил уче*бникот на И*ван.",
        ru: "Нате сказала преподавателю, что ты якобы не вернул учебник Ивану.",
      },
      {
        mkd: "Сум го забора*вила пари*чникот та*му.",
        ru: "Я забыла кошелёк там.",
      },
      {
        mkd: "Ни*е сме го изла*желе?!",
        ru: "Мы его обнанули?!",
      },
    ],
  },
};
