import { TablesProps } from "@/types";

export const example5: TablesProps = {
  slug: "lesson-13",
  type: "example-5",
  subtitle: "ПРИДАТОЧНЫЕ УСТУПИТЕЛЬНЫЕ",
  content: {
    text: `Придаточные предложения со значением уступки вводятся союзами, союзными словами и словосочетаниями <span>и*ако</span> «хотя», 
    <span>ма*кар што</span> «хотя», <span>ма*кар и да</span> «несмотря на то, что/пусть даже», <span>по*краj то*а што</span>
    «несмотря на то, что», <span>при сѐ што</span> «при всём том, что», <span>ду*ри и да</span> «даже если», <span>ко*лку и да</span>
    «сколько бы ни», <span>коj и да</span> «кто бы ни», <span>што и да</span> «что бы ни», <span>ко*га и да</span> «когда бы ни» и т.д.
    Союз <span>и*ако</span> является наиболее частотным из этого ряда.`,
    words: [
      {
        mkd: "И*ако се браќа, не се ли*чат.",
        ru: "Хотя они братья, они не похожи.",
      },
      {
        mkd: "И по*краj то*а што ра*ботеше на*порно, не забо*рави ни*што.",
        ru: "Несмотня на то, что он напряжённо работал, но ничего не заработал.",
      },
      {
        mkd: "Ма*кар што не и*граа до*бро, побе*диjа.",
        ru: "Хотя они не играли хорошо, они победили.",
      },
      {
        mkd: "Ва*жно е да до*jдат ма*кар и да до*цнат.",
        ru: "Важно, чтобы они пришли, пусть даже/хоть бы и с опозданием.",
      },
      {
        mkd: "При сѐ што не*мав ни*какви си*мптоми за*кажав сни*мање на главата.",
        ru: "Хотя у меня не было никаких симптомов, я записался, чтобы сделать снимок головы.",
      },
      {
        mkd: "Ду*ри и да о*стане лу*зна не*ма да ми пре*чи.",
        ru: "Даже если останется шрам, он не будет мне мешать.",
      },
      {
        mkd: "Ко*лку и да зна*еш не зна*еш сѐ.",
        ru: "Сколько бы ты ни знал, ты не знаешь всего.",
      },
      {
        mkd: "Коj и да по*беди ќе соработу*ваме.",
        ru: "Кто бы ни победил, мы будем сотрудничать.",
      },
      {
        mkd: "Што и да се слу*чи не се пре*давам.",
        ru: "Что бы ни случилось, я не сдаюсь.",
      },
      {
        mkd: "На сле*дните и*збори ко*га и да се.",
        ru: "На следующих выборах, когда бы они ни состоялись.",
      },
    ],
  },
};

//     <span></span> «» ѐ
