import { TablesProps } from "@/types";

export const example4: TablesProps = {
  slug: "lesson-13",
  type: "example-4",
  content: {
    text: `Данная конструкция не содержит информации о лице, поэтому при необходимости уточнить, о ком идёт речь, употребляется личное 
    местоимение: <span>ни*е би са*кале</span> «мы бы хотели», <span>ви*е би са*кале</span> «вы бы хотели». При безличном употреблении
    л-форма стоит в форме среднего рода:`,
    words: [
      {
        mkd: "Ко*jа на*града би тре*бало да доби*ете?",
        ru: "Какую награду вы должны были бы получить?",
      },
      {
        mkd: "Не би тре*бало да вр*не.",
        ru: "Дождя не должно было бы быть.",
      },
    ],
  },
};
