import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-13",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "беле*зица",
            pron: "бэлэ*зица",
            ru: "браслет",
          },
          {
            mkd: "би*сер",
            pron: "би*сэр",
            ru: "жемчуг",
          },
          {
            mkd: "блоки*ра",
            pron: "блоки*ра",
            ru: "блокировать, заблокировать",
          },
          {
            mkd: "забе*лежи",
            pron: "забэ*лэжи",
            ru: "заметить, отметить",
          },
          {
            mkd: "забеле*жува",
            pron: "забэлэ*жува",
            ru: "замечать, отмечать",
          },
          {
            mkd: "се за*чуди",
            pron: "сэ_за*чуди",
            ru: "удивляться",
          },
          {
            mkd: "и*згледа",
            pron: "и*зглэда",
            ru: "выглядеть, казаться",
          },
          {
            mkd: "изне*рви*ра",
            pron: "изнэ*рви*ра",
            ru: "вывести из себя",
          },
          {
            mkd: "се изне*рви*ра",
            pron: "сэ_изнэ*рви*ра",
            ru: "изнервничаться, разнервничаться",
          },
          {
            mkd: "кра*де",
            pron: "кра*дэ",
            ru: "красть",
          },
          {
            mkd: "кр*лушка",
            pron: "кр*лушка",
            ru: "чешуйка",
          },
          {
            mkd: "мо*жеби",
            pron: "мо*жэби",
            ru: "может быть",
          },
          {
            mkd: "на*кит",
            pron: "на*кит",
            ru: "украшение, украшения",
          },
          {
            mkd: "не*рви*ра",
            pron: "нэ*рви*ра",
            ru: "выводить из себя, раздражать",
          },
          {
            mkd: "се не*рви*ра",
            pron: "сэ_нэ*рви*ра",
            ru: "нервничать",
          },
          {
            mkd: "па*тен",
            pron: "па*тэн",
            ru: "дорожный, путевой",
          },
          {
            mkd: "пла*шчица",
            pron: "пла*шчица",
            ru: "уклейка",
          },
          {
            mkd: "поли*ција",
            pron: "поли*ция",
            ru: "полиция",
          },
          {
            mkd: "прија*ви",
            pron: "прия*ви",
            ru: "зарегистрировать, подать заявку",
          },
          {
            mkd: "прија*вува",
            pron: "прия*вува",
            ru: "регистрировать, подавать заявку",
          },
          {
            mkd: "под",
            pron: "пот",
            ru: "пол",
          },
          {
            mkd: "се се*ти",
            pron: "сэ_сэ*ти",
            ru: "вспомнить",
          },
          {
            mkd: "се се*ќава",
            pron: "сэ_сэ*кава",
            ru: "вспоминать",
          },
          {
            mkd: "си*гурно",
            pron: "си*гурно",
            ru: "наверняка, точно",
          },
          {
            mkd: "сре*бро",
            pron: "срэ*бро",
            ru: "серебро",
          },
          {
            mkd: "у*краде",
            pron: "у*крадэ",
            ru: "украсть",
          },
          {
            mkd: "у*спева",
            pron: "у*спэва",
            ru: "мочь, успевать",
          },
          {
            mkd: "у*спее",
            pron: "у*спээ",
            ru: "суметь, смочь, преуспеть, успеть",
          },
          {
            mkd: "се чу*ди",
            pron: "сэ_чу*ди",
            ru: "удивляться",
          },
          {
            mkd: "шанк",
            pron: "шанк",
            ru: "барная стойка",
          },
        ],
      },
    },
  ],
};
