import { ParagraphSectionsProps } from "@/types";

export const genderNumberPronominalText: ParagraphSectionsProps = {
  type: "adjectives-gender-number-pronominal",
  slug: "lesson-2",
  content: {
    text: `Подавляющее большинство прилагательных и местоименных прилагательных меняется как прилагательное <span>но*в</span>, при  этом могут
    выдавать беглые гласные <span>«а, е, о»</span>. Обратите внимание, что при выпадении может меняться произношение и соответственно написание:
    <span>ни*зок - ни*зко</span>. У причастий в отличие от прилагательных гласный <span>«е»</span> не выпадает при словоизменении:
    <span>за*морен</span> «утомительный» - <span>за*морна, у*морен</span> «уставший» - <span>умо*рена</span>.

    Порядковые числительные в мужском роде, имеющие нулевое окончание (<span>прв чо*век</span> «первый человек»), при употреблении в качестве
    дат имеют окончание <span>-и</span> (<span>пр*ви март</span> «первое марта»).

    Совпадают форма мужского рода единственного числа и форма множественного числа у прилагательных с суффиксами <span>-ск-/-j-</span> и
    порядковых числительных на <span>«-и»</span>: <span>де*сетти ру*ски па*сош</span> — <span>де*сетти ру*ски па*соши</span>,
    <span>пти́чjи ви́рус</span> — <span>пти́чjи ви́руси</span>.

    В македонском языке притяжательные местоимения <span>не́гов</span> «его», <span>не́јзин</span> «её», <span>ни́вен</span> «их» меняются по
    родам и числам в отличие от русского языка: <span>не́гов брат</span> «его брат», <span>не́гова се́стра</span> «его сестра»,
    <span>не́гово де́те</span> «его ребёнок», <span>не́гови роди́тели</span> «его родители».

    Указательные местоимения <span>о̀вој</span> и <span>тој</span> переводятся на русский язык как «этот», при этом <span>о̀вој</span>
    характеризует предмет, находящийся в непосредственной близости от говорящего, а <span>тој</span> — чуть дальше. <span>О́ној</span>
    переводится как «тот».

    В македонском языке есть неизменяемые прилагательные: <span>та́зе ле́б</span> «свежий хлеб» — <span>та́зе зе́лка</span> «свежая капуста».
    `,
  },
};
