import { TablesProps } from "@/types";

export const example3: TablesProps = {
  slug: "lesson-14",
  type: "example-3",
  content: {
    text: `Кроме того, будущее в прошедшем употребляется для обозначения действия, которое чуть было не произошло, или нереального 
    условия:`,
    words: [
      {
        mkd: "За ма*лку ќе па*днев.",
        ru: "Я чуть было не упал.",
      },
      {
        mkd: "И ни*е ќе до*jдевме да/а*ко зна*евме де*ка ќе би*де то*лку у*баво.",
        ru: "И мы бы пришли, если бы знали, что будет так хорошо.",
      },
      {
        mkd: "Да не го зна*ев не*маше да се со*гласам.",
        ru: "Если бы я его не знал, я бы не согласился..",
      },
    ],
  },
};
