import { TablesProps } from "@/types";

export const example1: TablesProps = {
  slug: "lesson-14",
  type: "example-1",
  title: {
    ru: "ГРАММАТИКА",
    mkd: "ГРАМАТИКА",
  },
  subtitle: "БУДУЩЕЕ В ПРОШЕДШЕМ",
  content: {
    text: `При описании действия, которое произошло или должно было произойти после некоторого момента в прошлом, может использоваться
    будущее в прошедшем.`,
    words: [
      {
        mkd: "Бев да ги по*сетам. Се паку*ваа, ќе о*деа на о*дмор.",
        ru: "Я был у них с визитом. Они собирали чемоданы, должны были поехать в отпуск.",
      },
    ],
  },
};

//     От других глаголов совершенного и несовершенного вида причастие образуется от основы имперфекта (<span>-а-</span>, <span>-е-</span>
//     сохраняются, <span>-и-</span> меняется на <span>-е-</span>): <span>чи*та</span> «читать» — <span>чи*тан</span> «читанный»,
//     <span>пре*ку ден</span> «»
