import { TablesProps } from "@/types";

export const example2: TablesProps = {
  slug: "lesson-14",
  type: "example-2",
  content: {
    text: `Будущее в прошедшем также используется, когда говорящий хочет подчеркнуть повторяемость действия в прошлом, его обычность:`,
    words: [
      {
        mkd: "Се*когаш ко*га пату*ваше, ќе ста*неше ра*но, ќе се спаку*ваше набр*зина и де*нот ќе го поми*наше со родите*лите.",
        ru: "Всегда, когда он путешествовал, он, бывало, встанет рано, соберёт чемодан и проведёт день с родителями.",
      },
    ],
  },
};
