import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-14",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения по образцу.`],
      content: {
        text: "<span>Футболи*стот да*де гол. — Футболи*стот за ма*лку ќе да*деше гол.</span>",

        sentences: [
          {
            mkd: `1. На*шата рако*метна репрезента*циjа о*свои пр*во ме*сто во све*тско пр*венство ___.`,
            answer: [
              `Нашата ракометна репрезентациjа за малку ќе освоеше прво место во светско првенство`,
            ],
          },
          {
            mkd: `2. Суди*jата му пока*жа жолт ка*ртон на о*воj фудбале*р ___.`,
            answer: [
              `Судиjата за малку ќе му покажеше жолт картон на овој фудбалер`,
            ],
          },
          {
            mkd: `3. Кошарка*рите ги прекр*шиjа прави*лата ___.`,
            answer: [`Кошаркарите за малку ќе ги прекршеа правилата`],
          },
          {
            mkd: `4. Им да*де гол на на*шите проти*вници во после*дната ми*нута од натпре*варот ___.`,
            answer: [
              `За малку ќе им дадеше гол на нашите противници во последната минута од натпреварот`,
            ],
          },
          {
            mkd: `5. Италиjа*нците изгу*биjа од Шпа*нците 0:1 ___.`,
            answer: [`Италиjанците за малку ќе изгубеа од Шпанците 0:1`],
          },
          {
            mkd: `6. Герма*нците го побе*диjа сво*jот ри*вал и изле*гоа од гру*пата ___.`,
            answer: [
              `Германците за малку ќе го победеа својот ривал и ќе излезеа од групата`,
            ],
          },
          {
            mkd: `7. Го*стите во пр*во полу*време созда*доа пре*дност од два го*ла ___.`,
            answer: [
              `Гостите во прво полувреме за малку ќе создадеа предност од два гола `,
            ],
          },
          {
            mkd: `8. "Че*лзи" го со*влада "Бра*jтон" со 2:0 ___.`,
            answer: [`"Челзи" за малку ќе го совладаше "Браjтон" со 2:0`],
          },
          {
            mkd: `9. Парти*jата за*врши ре*ми ___.`,
            answer: [`Партиjата за малку ќе завршеше реми`],
          },
          {
            mkd: `10. На*шиот шахи*ст у*спеа да и*звлече ре*ми ___.`,
            answer: [`Нашиот шахист за малку ќе успееше да извлече реми`],
          },
          {
            mkd: `11. Си*мон вле*зе во ма*шката ватерпо*ло репрезента*циjа ___.`,
            answer: [
              `Симон за малку ќе влезеше во машката ватерполо репрезентациjа`,
            ],
          },
          {
            mkd: `12. Селе*кторот до*би о*тказ ___.`,
            answer: [`Селекторот за малку ќе добиеше отказ`],
          },
        ],
      },
    },
  ],
};
