import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-14",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте текст, используя местоимения <span>та*а</span>, <span>ни*е</span>, <span>ти*е</span>.

        (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span> "jас", "та*а", "ни*е", "ти*е"</span>.
        В центре показано текущее местоимение.
        
        Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
        проверить свою работу нажав на кнопку "Проверить мою работу".)

        Вставьте данные слова в подходящее место:
        
        <span>**со, спи*ење, од, нави*ваат, учи*лиште, ка*шлам, то*пка, одго*варам, до**</span>`,
      ],
      answerSet: {
        labels: ["Jас", "Та*а", "Ни*е", "Ти*е"],
      },
      content: {
        sentences: [
          {
            mkd: `Ни*когаш не сум трени*рал спорт. 
            / Та*а ни*когаш не трени*рала спорт.
            / Ни*когаш не сме трени*рале спорт.
            / Ти*е ни*когаш не трени*рале спорт.`,
            answer: [``],
          },
          {
            mkd: `Во ___ и на факулте*т ги мра*зев часо*вите по фи*зичко. 
            / Во ___ и на факулте*т ги мра*зеше часо*вите по фи*зичко.
            / Во ___ и на факулте*т ги мра*зевме часо*вите по фи*зичко.
            / Во ___ и на факулте*т ги мра*зеа часо*вите по фи*зичко.`,
            answer: [`училиште/училиште/училиште/училиште`],
          },
          {
            mkd: `Не ра*збирав зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти. 
            / Не разби*раше зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти.
            / Не разби*равме зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти.
            / Не разби*раа зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти.`,
            answer: [`навиваат/навиваат/навиваат/навиваат`],
          },
          {
            mkd: `Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да 
            се по*тиш на спра*ви за ве*жба*ње.
            / Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да се
            по*тиш на спра*ви за ве*жба*ње.
            / Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да се
            по*тиш на спра*ви за ве*жба*ње.
            / Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да се
            по*тиш на спра*ви за ве*жба*ње.`,
            answer: [`топка/топка/топка/топка`],
          },
          {
            mkd: `Ко*га на*полнив три*есет го*дини по*чнав да и*мам про*блеми ___ здра*вjето. 
            / Ко*га та*а напо*лни три*есет го*дини по*чна да и*ма про*блеми ___ здра*вjето.
            / Ко*га напо*лнивме три*есет го*дини по*чнавме да и*маме про*блеми ___ здра*вjето.
            / Ко*га напо*лниjа три*есет го*дини по*чнаа да и*маат про*блеми ___ здра*вjето.`,
            answer: [`со/со/со/со`],
          },
          {
            mkd: `Те*шко ми бе*ше да се ка*чам пе*шки на трет кат, по*чна да ме бо*ли грб ___ се*дење пред компjутер и посто*jано 
            ка*шлав.
            / Те*шко ѝ бе*ше да се ка*чи пе*шки на трет кат, по*чна да jа бо*ли грб ___ се*дење пред компjутер и посто*jано ка*шлаше.
            / Те*шко ни бе*ше да се ка*чиме пе*шки на трет кат, по*чна да нè бо*ли грб ___ се*дење пред компjутер и посто*jано ка*шлавме.
            / Те*шко им бе*ше да се ка*чат пе*шки на трет кат, по*чна да ги бо*ли грб ___ се*дење пред компjутер и посто*jано ка*шлаа.`,
            answer: [`од/од/од/од`],
          },
          {
            mkd: `И се зде*белив мно*гу. Пр*во ре*шив да ги о*ставам ци*гарите, да се хра*нам здра*во, да пе*шачам пред ___ и да 
            ле*гнувам пред двана*есет.
            / И се зде*бели мно*гу. Пр*во ре*ши да ги о*стави ци*гарите, да се хра*ни здра*во, да пе*шачи пред ___ и да ле*гнува перед
            двана*есет.
            / И се зде*беливме мно*гу. Пр*во ре*шивме да ги о*ставиме ци*гарите, да се хра*ниме здра*во, да пе*шачиме перед ___ и да
            ле*гнуваме пред двана*есет.
            / И се зде*белиjа мно*гу. Пр*во ре*шиjа да ги о*стават ци*гарите, да се хра*нат здра*во, да пе*шачат пред ___ и да
            ле*гнуваат пред двана*есет.`,
            answer: [`спиење/спиење/спиење/спиење`],
          },
          {
            mkd: `За три ме*сеци о*слабев 10 ки*ла, пре*станав да ___ и ми се по*добри со*нот. 
            / За три ме*сеци о*слабе 10 ки*ла, пре*стана да ___ и ѝ се по*добри со*нот.
            / За три ме*сеци о*слабевме 10 ки*ла, пре*станавме да ___ и ни се по*добри со*нот.
            / За три ме*сеци о*слабеа 10 ки*ла, пре*станаа да ___ и им се по*добри со*нот.`,
            answer: [`кашлам/кашла/кашламе/кашлаат`],
          },
          {
            mkd: `По*тоа по*чнав да тр*чам со друга*рите, но мно*гу ме бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажав. 
            / По*тоа по*чна да тр*ча со друга*рите, но мно*гу jа бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажа.
            / По*тоа по*чнавме да тр*чаме со друга*рите, но мно*гу нè бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажавме.
            / По*тоа по*чнаа да тр*чаат со друга*рите, но мно*гу ги бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажаа.`,
            answer: [``],
          },
          {
            mkd: `Про*бав да во*зам велосипе*д. Ми се до*падна. По*чнав да се во*зам со велосипе*д ___ ра*бота. 
            / Про*ба да во*зи велосипе*д. И се до*падна. По*чна да се во*зи со велосипе*д ___ ра*бота.
            / Про*бавме да во*зиме велосипе*д. Ни се до*падна. По*чнавме да се во*зиме со велосипе*д ___ ра*бота.
            / Про*баа да во*зат велосипе*д. Им се до*падна. По*чнаа да се во*зат со велосипе*д ___ ра*бота.`,
            answer: [`до/до/до/до`],
          },
          {
            mkd: `Ко*га ме прашу*ваат ка*ко го за*сакав спо*ртот се*когаш ___ де*ка не го са*кам спо*ртот, ту*ку по не*го се чу*вствувам 
            до*бро.
            / Ко*га jа прашу*ваат ка*ко го за*сака спо*ртот се*когаш ___ де*ка не го са*ка спо*ртот, ту*ку по не*го се чу*вствува
            до*бро.
            / Ко*га нè прашу*ваат ка*ко го за*сакавме спо*ртот се*когаш ___ де*ка не го са*каме спо*ртот, ту*ку по не*го се чу*вствуваме
            до*бро.
            / Ко*га ги прашу*ваат ка*ко го за*сакаа спо*ртот се*когаш ___ де*ка не го са*каат спо*ртот, ту*ку по не*го се чу*вствуваат
            до*бро.`,
            answer: [`одговарам/одговара/одговараме/одговараат`],
          },
        ],
      },
    },
  ],
};
