import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-14",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. За кого ты болеешь? — За наших, конечно! 2. Ты всегда будешь болеть за этого игрока? 3. Ты же не будешь всю жизнь 
        болеть за этого шахматиста? 4. Если ты не будешь так болеть за эту команду, можем вместе посмотреть чемпионат мира по волейболу.
        5. Ты всегда болел за этих пловцов? 6. Ты никогда ни за кого не болел? 7. Мне сказали, что ты всегда болел за этот клуб. Это
        правда? 8. Если бы ты болел за этих баскетболисток, я бы пригласил тебя на матч.`,
        answer: [
          `1. За кого навиваш? — За нашите се **разбира / секако**. 2. Секогаш ќе навиваш за овоj играч. 3. Нема да навиваш цел живот 
        за овоj шахист, нели? 4. Ако не навиваш толку за оваа екипа може заедно да го погледаме Светското првенство во одбоjка. 5. Ти
        секогаш навиваше за овие пливачи? 6. Никогаш за никого не си навивал? 7. Ми **рекоа / кажаа** дека секогаш си навивал за овоj
        клуб. Вистина ли тоа? Мислев дека ти навиваш за друг. 8. Ти да навиваше за овие кошаркарите
        **ќе те поканев на мечот. / jас би те поканил на мечот.**`,
        ],
      },
    },
  ],
};
