import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-14",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Вчера мы с Наташей, Наумом и его девушкой Эмилией смотрели финал чемпионата мира по футболу. Я очень удивился, что 
        футбол так популярен в Македонии. Все его смотрят, и все знают игроков. Македонцы смотрят и Кубок УЕФА, и Лигу чемпионов, но
        больше всего они болеют за сборную Македонии по гандболу и за македонские клубы. Недавно македонский клуб «Вардар» стал
        европейским чемпионом. Все македонцы болели как сумасшедшие. Баскетбол тоже популярен в Македонии. Несколько лет назад македонцы
        завоевали первое место в европейском чемпионате. Вся Македония собралась, чтобы их встретить на главной площади как национальных
        героев. В России популярны разные виды спорта: футбол, баскетбол, волейбол, хоккей, теннис. Я занимался горными лыжами. Если бы
        я не повредил позвоночник в аварии, возможно, я стал бы чемпионом мира. Конечно, я шучу. Моя жена Наташа сейчас ничем не
        занимается, но раньше она ходила на народные танцы. Они танцевали разные македонские танцы и часто ездили за границу. Эмилия
        рассказала, что мама водила её в школу балета, но ей быстро надоело. Потом вратарь чуть было не пропустил гол. Матч закончился
        вничью, поэтому футболисты выполняли пенальти.`,
        answer: [
          `Вчера со Наташа, (со) Наум и (со) неговата девојка Емилија го гледавме финалето на Светското првенство во фудбал. Многу се
        зачудив дека фудбалот е толку популарен во Македонија. Сите го гледаат и ги знаат играчите. Македонците ги гледаат и Купот на
        УЕФА и Лигата на шампионите, но најмногу навиваат за македонската ракометарска репрезентација и за македонските клубови.
        Неодамна македонскиот клуб „Вардар" стана европски првак. Сите Македонци навиваа како луди. Кошарката е исто така популарна во
        Македонија. Пред некоја година Македонците освоија прво место на европско првенство. Цела Македонија се собра да ги пречека на
        главниот плоштад како национални херои. Во Русија се популарни различни спортови: фудбал, кошарка, одбојка, хокеј, тенис. Јас
        тренирав скијање. Да не го повредев рбетот во сообраќајна несреќа сега јас би бил шампион во скијање. Секако се шегувам. Жена ми
        Наташа ништо не тренира, но порано одеше на играорна. Играа различни македонски ора и често патуваа во странство. Емилија
        раскажа дека мајка ѝ ја носела на балетска школа, но дека бргу ѝ здодеало. Потоа голманот за малку ќе примеше гол. Мечот заврши
        нерешено затоа фудбалерите шутираа пенали.`,
        ],
      },
    },
  ],
};
