import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-14",
  sections: [
    {
      type: "exercise-select-option",
      prompt: ["Выберите подходящий вариант."],
      content: {
        sentences: [
          {
            mkd: `1. [[Не*кој/ка*де би*ло]] фр*ли пета*рда.`,
            answer: [`Не*кој`],
          },
          {
            mkd: `2. Мо*же да на*виваш за [[ко*го би*ло/не*каде]].`,
            answer: [`ко*го би*ло`],
          },
          {
            mkd: `3. Не се се*кирај. Мо*же да ѝ пру*жат [[ка*ква-го*де/не*која]] по*мош на тво*јата вну*ка.`,
            answer: [`ка*ква-го*де`],
          },
          {
            mkd: `4. Дого*ворот е по*важен од [[што би*ло/ка*ко-го*де]] дру*го.`,
            answer: [`што би*ло`],
          },
          {
            mkd: `5. О*ваа е*кипа се на*оѓа во на*јдобра фо*рма од [[ко*га/не*како]] и да е.`,
            answer: [`ко*га`],
          },
        ],
      },
    },
  ],
};
