import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-14",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения по образцу.`],
      content: {
        text: `<span>Го*лманот о*дбрани гол. Ни*е не избу*бивме. — Да одбра*неше гол го*лманот не*маше да изгу*биме. Да одбра*неше 
            гол го*лманот ни*е не би изгу*биле.</span>`,
        sentences: [
          {
            mkd: `1. "Ми*лан" jа по*беди "Фиоренти*на" на го*сти. "Ми*лан" до*би два бо*да ___.`,
            answer: [
              `"Милан" да jа победеше "Фиорентина" на гости ќе добиеше два бода. "Милан" да jа победеше "Фиорентина" на гости би 
              добил два бода`,
            ],
          },
          {
            mkd: `2. Ми предло*жиjа да и*грам за "Jуве*нтус". Ве*днаш се со*гласив ___.`,
            answer: [
              `Да ми предложеа да играм за „Јувентус“ веднаш ќе се согласев. Да ми предложеа да играм за „Јувентус“ веднаш би се 
              согласил`,
            ],
          },
          {
            mkd: `3. Марк бе*ше во ло*ша фо*рма. Не му да*доа вто*ра ша*нса. ___.`,
            answer: [
              `Марк да беше во лоша форма немаше да му дадат втора шанса. Марк да беше во лоша форма не би му дале втора шанса`,
            ],
          },
          {
            mkd: `4. Го зна*евме резулта*тот на ме*чот. Оти*довме во обложува*лница. ___.`,
            answer: [
              `Да го знаевме резултатот на мечот ќе отидевме во обложувалница. Да го знаевме резултатот на мечот би отишле во 
              обложувалница`,
            ],
          },
          {
            mkd: `5. Суди*jата не го забе*лежа прекр*шокот над на*шиот на*паѓач. Не*маше пе*нал. ___.`,
            answer: [
              `Судијата да не го забележеше прекршокот над нашиот напаѓач ќе немаше пенал. Судијата да не го забележеше прекршокот над 
              нашиот напаѓач би немало пенал`,
            ],
          },
          {
            mkd: `6. Та*тко ми нави*ваше за "Рабо*тнички". И ни*е нави*ваме за не*го ___.`,
            answer: [
              `Татко ми да навиваше за „Работнички“ и ние ќе навивавме за него. Татко ми да навиваше за „Работнички“ и ние би навивале 
              за него`,
            ],
          },
          {
            mkd: `7. Спорти*ст от ско*кна е*ден сантиме*тар пода*леку. По*беди. ___.`,
            answer: [
              `Спортистот да скокнеше еден сантиметар подалеку ќе победеше. Спортистот да скокнеше еден сантиметар подалеку би победил`,
            ],
          },
          {
            mkd: `8. Зна*ев да се ли*згам. О*тидов со те*бе на лизга*лиште ___.`,
            answer: [
              `Да знаев да се лизгам ќе отидев со тебе на лизгалиште. Да знаев да се лизгам би отишол/ отишла со тебе на лизгалиште`,
            ],
          },
          {
            mkd: `9. Во учили*штето и*маше стадио*н. И*гравме та*му ___.`,
            answer: [
              `Во училиштето да имаше стадион ќе игравме таму. Во училиштето да имаше стадион ние би играле таму`,
            ],
          },
          {
            mkd: `10. И*мав ро*лери. Се во*зев це*ло вре*ме ___.`,
            answer: [
              `Да имав ролери ќе се возев цело време. Да имав ролери би се возел/а цело време`,
            ],
          },
          {
            mkd: `11. Тре*баше да ку*пиш ка*цига. Jа ку*пи ___?`,
            answer: [
              `Да требаше да купиш кацига ќе ја купеше? Да требаше да купиш кацига би ја **купил / купила**`,
            ],
          },
          {
            mkd: `12. До*пинг тест бе*ше позити*вен. Спорти*стите до*биjа дожи*вотна за*брана за на*стап на Оли*мписки и*гри ___.`,
            answer: [
              `Допинг тест да беше позитивен спортистите ќе добиеја доживотна забрана за настап на Олимписки игри. Допинг тест да беше 
              позитивен спортистите би добиле доживотна забрана за настап на Олимписки игри`,
            ],
          },
        ],
      },
    },
  ],
};
