import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-14",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Составьте предложения из данных слов, используя конструкцию <span>за ма*лку ќе</span>.`,
      ],

      content: {
        text: "<span>сум, ка*знет, цел, еки*па — За ма*лку ќе бе*ше ка*знета це*лата еки*па.</span>",
        sentences: [
          {
            mkd: `1) капите*н, да*де, кош — ___.`,
            answer: [`Капитенот за малку ќе дадеше кош`],
          },
          {
            mkd: `2) пли*вач, и*здржи, два, ми*нута, под, во*да — ___.`,
            answer: [`Пливачот за малку ќе издержеше две минути под вода`],
          },
          {
            mkd: `3) наш, карати*ст, до*бие, зла*тен, ме*дал — ___.`,
            answer: [`Нашиот каратист за малку ќе добиеше златен медал`],
          },
          {
            mkd: `4) Но*вак Ѓоковиќ, се о*ткаже, од, у*ште, е*ден, ту*рнир — ___.`,
            answer: [
              `Новак Ѓоковиќ за малку ќе се откажеше од уште еден турнир`,
            ],
          },
          {
            mkd: `5) Ра*иконен, и*згуби, тр*ка — ___.`,
            answer: [`Раиконен за малку ќе jа изгубеше трка`],
          },
          {
            mkd: `6) jас, па*дне, од, велосипе*д — ___.`,
            answer: [`Јас за малку ќе паднев од велосипедот`],
          },
          {
            mkd: `7) "Ба*ерн Ми*нхен", ремизи*ра — ___.`,
            answer: [`"Баерн Минхен" за малку ќе ремизираше`],
          },
          {
            mkd: `8) на*вивач, про*пушти, полуфина*ле — ___.`,
            answer: [`Навивачот за малку ќе пропуштеше полуфиналето`],
          },
          {
            mkd: `9) на*паѓач, у*дри, го*лман, со, но*га — ___.`,
            answer: [`Напаѓачот за малку ќе удреше голманот со нога`],
          },
          {
            mkd: `10) то*пка, о*тиде, во, а*ут — ___.`,
            answer: [`Топката за малку ќе отидеше во аут`],
          },
          {
            mkd: `11) Ало*нсо, пре*текне, Шума*хер — ___.`,
            answer: [`Алонсо за малку ќе го претекнеше Шумахер`],
          },
          {
            mkd: `12) клуб, до*бие, ка*зна — ___.`,
            answer: [`Клуб за малку ќе добиеше казна`],
          },
        ],
      },
    },
  ],
};
