import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-12",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "ба*ра",
            pron: "ба*ра",
            ru: "искать, требовать, запрашивать",
          },
          {
            mkd: "ба*ра за же*на",
            pron: "ба*ра_за_жэ*на",
            ru: "делать предложение руки и сердца",
          },
          {
            mkd: "ба*кне",
            pron: "ба*кнэ",
            ru: "поцеловать",
          },
          {
            mkd: "ба*кнува",
            pron: "ба*кнува",
            ru: "целовать",
          },
          {
            mkd: "би*вш",
            pron: "би*вш",
            ru: "бывший",
          },
          {
            mkd: "бра*тучед",
            pron: "бра*тучэт",
            ru: "кузен",
          },
          {
            mkd: "брату*четка",
            pron: "брату*чэтка",
            ru: "кузина",
          },
          {
            mkd: "внук",
            pron: "внук",
            ru: "внук, племянник",
          },
          {
            mkd: "вну*ка",
            pron: "вну*ка",
            ru: "внучка, племянница",
          },
          {
            mkd: "гу*шка",
            pron: "гу*шка",
            ru: "обнимать",
          },
          {
            mkd: "гу*шне",
            pron: "гу*шнэ",
            ru: "обнять",
          },
          {
            mkd: "до*знава",
            pron: "до*знава",
            ru: "узнавать (что, о ком/чём)",
          },
          {
            mkd: "до*знае",
            pron: "до*знаэ",
            ru: "узнать (что, о ком/чём)",
          },
          {
            mkd: "е*днаш",
            pron: "э*днаш",
            ru: "однажды, один раз",
          },
          {
            mkd: "же*нет",
            pron: "жэ*нэт",
            ru: "женатый",
          },
          {
            mkd: "се же*ни",
            pron: "сэ_жэ*ни",
            ru: "жениться (о мужчине, несов. в.)",
          },
          {
            mkd: "задо*волство",
            pron: "задо*волство",
            ru: "удовольствие",
          },
          {
            mkd: "се за*љуби",
            pron: "сэ_за*л'уби",
            ru: "влюбиться",
          },
          {
            mkd: "се за*љубува",
            pron: "сэ_за*л'убува",
            ru: "влюбляться",
          },
          {
            mkd: "за*мине",
            pron: "за*минэ",
            ru: "уйти, уехать",
          },
          {
            mkd: "за*минува",
            pron: "за*минува",
            ru: "уходить, уезжать",
          },
          {
            mkd: "се зе*ма",
            pron: "сэ_зэ*ма",
            ru: "вступать в брак (о паре)",
          },
          {
            mkd: "се зе*ме",
            pron: "сэ_зэ*мэ",
            ru: "вступить в брак (о паре)",
          },
          {
            mkd: "и*грачка",
            pron: "и*грачка",
            ru: "игрушка",
          },
          {
            mkd: "комуници*ра",
            pron: "комуници*ра",
            ru: "общаться",
          },
          {
            mkd: "ќе*рка",
            pron: "к’э*рка",
            ru: "дочь",
          },
          {
            mkd: "крај",
            pron: "край",
            ru: "конец",
          },
          {
            mkd: "ма*жена",
            pron: "ма*жэна",
            ru: "замужняя",
          },
          {
            mkd: "се ма*жи",
            pron: "сэ_ма*жи",
            ru: "выходить замуж",
          },
          {
            mkd: "мре*жа",
            pron: "мрэ*жа",
            ru: "сеть",
          },
          {
            mkd: "на крај",
            pron: "на_край",
            ru: "в конце",
          },
          {
            mkd: "на*полни",
            pron: "на*полни",
            ru: "исполниться (о годах)",
          },
          {
            mkd: "напо*лнува",
            pron: "напо*лнува",
            ru: "исполняться (о годах)",
          },
          {
            mkd: "на*скоро",
            pron: "на*скоро",
            ru: "вскоре",
          },
          //
          {
            mkd: "љу*бов",
            pron: "л'у*боф",
            ru: "любовь",
          },
          {
            mkd: "нео*дамна",
            pron: "нео*дамна",
            ru: "недавно",
          },
          {
            mkd: "о*дамна",
            pron: "о*дамна",
            ru: "давно",
          },
          {
            mkd: "се о*жени",
            pron: "сэ_о*жэни",
            ru: "жениться (о мужчине, сов. в.)",
          },
          {
            mkd: "се о*мажи",
            pron: "сэ_о*мажи",
            ru: "выйти замуж",
          },
          {
            mkd: "о*стане",
            pron: "о*станэ",
            ru: "остаться",
          },
          {
            mkd: "оста*нува",
            pron: "оста*нува",
            ru: "оставаться",
          },
          {
            mkd: "по*бара",
            pron: "по*бара",
            ru: "поискать, потребовать, запросить",
          },
          {
            mkd: "по*бара за же*на",
            pron: "по*бара_за_жэ*на",
            ru: "сделать предложение руки и сердца",
          },
          {
            mkd: "по*знава",
            pron: "по*знава",
            ru: "узнавать, знать (кого)",
          },
          {
            mkd: "се_по*знава",
            pron: "сэ_по*знава",
            ru: "быть знакомым",
          },
          {
            mkd: "по*знае",
            pron: "по*знаэ",
            ru: "узнать",
          },
          {
            mkd: "по*кани",
            pron: "по*кани",
            ru: "пригласить",
          },
          {
            mkd: "пока*нува",
            pron: "пока*нува",
            ru: "приглашать",
          },
          {
            mkd: "по*мине",
            pron: "по*минэ",
            ru: "пройти, провести (время)",
          },
          {
            mkd: "поми*нува",
            pron: "поми*нува",
            ru: "проходить, проводить (время)",
          },
          {
            mkd: "се ра*ѓа",
            pron: "сэ_ра*г'я",
            ru: "рождаться",
          },
          {
            mkd: "се ра*зведе",
            pron: "сэ_ра*звэдэ",
            ru: "развестись",
          },
          {
            mkd: "се_разве*дува",
            pron: "сэ_развэ*дува",
            ru: "разводиться",
          },
          {
            mkd: "се ро*ди",
            pron: "сэ_ро*ди",
            ru: "родиться",
          },
          {
            mkd: "слу*чајно",
            pron: "слу*чайно",
            ru: "случайно",
          },
          {
            mkd: "слатка*рница",
            pron: "слатка*рница",
            ru: "кафе-мороженое",
          },
          {
            mkd: "сна*а",
            pron: "сна*а",
            ru: "невестка",
          },
          {
            mkd: "се со*гласи",
            pron: "сэ_со*гласи",
            ru: "согласиться",
          },
          {
            mkd: "се согла*сува",
            pron: "сэ_согла*сува",
            ru: "соглашаться",
          },
          {
            mkd: "со*станок",
            pron: "со*станок",
            ru: "свидание, официальная встреча",
          },
          {
            mkd: "соција*лен",
            pron: "соција*лэн",
            ru: "социальный",
          },
          {
            mkd: "страв",
            pron: "страф",
            ru: "страх",
          },
          {
            mkd: "те*нис",
            pron: "тэ*нис",
            ru: "теннис",
          },
          {
            mkd: "тре*нер",
            pron: "трэ*нэр",
            ru: "тренер",
          },
        ],
      },
    },
  ],
};
