import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-17",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Переведите со словарём.

        (Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
        проверить свою работу нажав на кнопку "Проверить мою работу".)

        Вставьте данные слова в подходящее место предложения:
        
        <span>**до*jдеме, низ, го, се одмо*ривме, поми*навте, ско*каат**</span>`,
      ],

      content: {
        sentences: [
          {
            mkd: `Здра*во А*ндреj! Ка*ко си? Мно*гу се изра*дував ко*га ___ до*бив тво*ето пи*смо. И*звини што не ти одго*ворив ве*днаш.
            Бе*вме со На*таша во Македо*ниjа. Та*му не*мав мо*билен и*нтернет и ре*тко го прове*рував ме*jлот. И*наку, ни*е сме до*бро.`,
            answer: [`го`],
          },
          {
            mkd: `Мно*гу у*баво си поми*навме и ___. О*воj пат бе*вме со Ско*пjе и О*хрид. Са*кавме да оти*деме до Биго*рскиот ма*настир 
            ка*де што се на*оѓа пре*красен ре*збан ико*ностас, но не сти*гнавме.`,
            answer: [`се одмо*ривме`],
          },
          {
            mkd: `Наре*дниот пат са*каме да ___ во Македо*ниjа зи*ме. Ќе до*jдеме за Бо*жиќ, а са*каме да ви*диме и ка*ко се сла*ват Ста*ра 
            но*ва го*дина и Во*дици. За Ста*ра но*ва го*дина задолжи*телно ќе го посе*тиме Вевча*нскиот карнева*л. Се одр*жува на 13 и 14
            jануа*ри во се*лото Ве*вчани бли*зу Стру*га.`,
            answer: [`до*jдеме`],
          },
          {
            mkd: `Учесни*ците на карнава*лот, василича*рите, се маски*раат и пра*ваат пре*тстава ___ се*лото. Се*га карнева*лот се повр*зува 
            со де*нот на све*ти Васи*лиjа, и*наку по по*текло то*а е па*гански о*бичаj.`,
            answer: [`низ`],
          },
          {
            mkd: `Во*дици, или Богоjавле*ние, се сла*ви на 19 jануа*ри. Свеште*никот го фр*ла кр*стот во ре*ка или е*зеро. Обле*чени во 
            ко*стими за пли*вање, верни*ците го че*каат тоj мо*мент и ___ во во*да по кр*стот. Се ве*рува де*ка тоj што ќе го фа*ти кр*стот
            ќе и*ма сре*ќа це*лата на*редна го*дина. И плани*раме да оти*деме на 2-3 де*на во Ма*врово на ски*jање.`,
            answer: [`ско*каат`],
          },
          {
            mkd: `Ти ка*ко си? Ка*ко се тво*ите? Ка*ко го ___ о*дморот? Го*лем по*здрав, И*ван.`,
            answer: [`поми*навте`],
          },
        ],
      },
    },
  ],
};
