import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-17",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Измените предожение по данному образцу.`],

      content: {
        text: `<span>У*тре не*ма да о*диме за Па*риз. — И*ван ка*жа де*ка у*тре сме не*мало да о*диме / не ќе сме о*деле за Па*риз.</span>`,
        sentences: [
          {
            mkd: `1. Анаста*сиjа ќе ги по*кани приjате*лите на сва*дба. — ___.`,
            answer: [
              `И*ван ка*жа де*ка Анаста*сиjа ќе ги пока*нила приjате*лите на сва*дбата`,
            ],
          },
          {
            mkd: `2. Ти не*ма да до*jдеш на ко*нцертот. — ___.`,
            answer: [
              `И*ван ка*жа де*ка **си не*мало да до*jдеш / не ќе си %до*шол / до*шла%** на ко*нцертот`,
            ],
          },
          {
            mkd: `3. Jас ќе ви на*правам по*кана за ви*за. — ___.`,
            answer: [
              `И*ван ка*жа де*ка ќе сум ви **на*правил / напра*вила** по*кана за ви*за`,
            ],
          },
          {
            mkd: `4. Ви*е не*ма да доби*ете ви*за. — ___.`,
            answer: [
              `И*ван ка*жа де*ка **не*мало да доби*ете / не ќе сте до*биле** ви*за`,
            ],
          },
          {
            mkd: `5. Ни*е ќе престоjу*ваме во наjска*пиот хо*тел на о*стровот. — ___.`,
            answer: [
              `И*ван ка*жа де*ка ќе сме престоjу*вале во наjска*пиот хо*тел на о*стровот`,
            ],
          },
          {
            mkd: `6. Мона*сите не*ма да им до*зволат на тури*стите да вле*зат во мана*стирот. — ___.`,
            answer: [
              `И*ван ка*жа де*ка мона*сите **не*мало да им до*зволат / не ќе им дозво*лиле** на тури*стите да вле*зат во мана*стирот`,
            ],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
