import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-17",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Преобразуйте предложения по образцу.`],

      content: {
        text: `<span>Компани*jата не___ (зе*ме) за*ем од ба*нка. — Компани*jата не*ма зе*мено за*ем од ба*нка.</span>`,
        sentences: [
          {
            mkd: `1. То*а е наjва*жно не*што што го ___ (на*прави, jас).`,
            answer: [`и*мам напра*вено`],
          },
          {
            mkd: `2. Да*ли ти го ___ (чи*та) о*воj ро*ман?`,
            answer: [`и*маш чи*тано`],
          },
          {
            mkd: `3. Организато*рите ги ___ (по*кани) си*те ли*дери од регио*нот.`,
            answer: [`и*маат пока*нето`],
          },
          {
            mkd: `4. Си*те се прашу*ваат коj jа ___ (ку*пи) апликаци*jата.`,
            answer: [`и*ма ку*пено`],
          },
          {
            mkd: `5. Не ми се ве*рува де*ка ви*е ги ___ (ка*же) о*вие глу*пости.`,
            answer: [`и*мате ка*жано`],
          },
          {
            mkd: `6. Ни*е ги ___ (о*свои) си*те ти*тули.`,
            answer: [`и*маме осво*ено`],
          },
          {
            mkd: `7. Министе*рството ___ (по*чне) не*колку но*ви про*екти о*ваа го*дина.`,
            answer: [`и*ма по*чнато`],
          },
          {
            mkd: `8. За ра*злика од дру*гите музи*чари ви*е не___ (па*тува) мно*гу.`,
            answer: [`мате па*тувано`],
          },
          {
            mkd: `9. Што ___ (пла*нира, ти) за о*воj ви*кенд.`,
            answer: [`и*маш плани*рано`],
          },
          {
            mkd: `10. На о*воj дру*гар во пет на*утро му ___ (се jа*вува, jас).`,
            answer: [`се и*мам jа*вувано`],
          },
          {
            mkd: `11. Да*ли ___ (слу*шне, ви*е) не*што за о*воj балета*н?`,
            answer: [`и*мате слуш*нато`],
          },
          {
            mkd: `12. О*дамна не___ (сре*тне, ни*е) то*лку позити*вен чо*век.`,
            answer: [`маме сре*тнато`],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
