import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-17",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Позавчера вечером мы с Иваном были в гостях у Эмилии и Наума в Охриде, а сегодня я жду в гости мою подругу Марию из 
        Испании. Завтра она возвращается домой. — Добро пожаловать, Мария, проходи. — Спасибо. Как дела? Как съездили в Македонию?
        — Отлично съездили. А как у тебя дела? — Хорошо, только ещё нужно много сделать. Надо купить подарки для моих родственников и
        друзей. — Я обычно покупаю открытки, магниты, брелоки, алкоголь, конфеты. — Все просят привезти водку, но без таможенной пошлины
        можно провезти только 2 литра вина и 1 литр крепкого алкоголя. Ты не знаешь, где завтра рано утром можно купить матрёшки? В 9
        часов я должна быть в аэропорту. — Я могу тебе дать одну. — Спасибо! Сколько я тебе должна? — Ничего. Угостишь меня обедом в
        Испании. — Договорились! Я жду вас с Иваном в гости. Нам нужно обменяться контактами. Вот мой испанский номер телефона. — Отлично.
        Что ты будешь пить? У нас есть домашнее вино из Македонии. Очень вкусное. — Спасибо, с удовольствием! — Давай выпьем за здоровье!
        За всё хорошее! И счастливого пути!`,
        answer: [
          `За́вчера на́вечер бе́вме со И́ван на го́сти кај На́ум и Еми́лија во О́хрид, а де́нес јас ја че́кам на го́сти мо́јата прија́телка Ма́рија од 
          Шпа́нија. У́тре се враќа до́ма. — До́бре до́јде, Ма́рија, по́вели. — Фа́ла. Ка́ко си? Ка́ко помина́вте во Македо́нија? — Одли́чно помина́вте.
          А ти ка́ко си? — До́бро, са́мо што тре́ба у́ште мно́гу ра́боти да за́вршам. Тре́ба да ку́пам пода́роци за мо́ите ро́днини и прија́тели. — Јас
          оби́чно ку́пувам разгле́дници, ма́гнети, приврзоци, а́лкохол, бонбо́ни. — Си́те замолу́ваат да до́несам во́тка, но без ца́рина мо́же да
          по́несам са́мо 2 ли́тра ви́но и 1 ли́тар же́сток а́лкохол. Да не зна́еш ка́де у́тре ра́но нау́тро мо́же да се ку́пат бабу́шките? Во 9 ча́сот
          тре́ба да би́дам на аеродро́мот. — Мо́же да ти да́дам е́дна. — Фа́ла! Ко́лку ти до́лжам? — Ни́што. Ќе ме че́стиш ру́чек во Шпа́нија.
          — Догово́рено. Ве оче́кувам на го́сти со И́ван. Тре́ба да ги разме́ниме конта́ктите. Е́ве го мо́јот шпа́нски телефо́нски број. — Одли́чно.
          Што ќе се на́пиеш? И́маме дома́шно ви́но од Македо́нија. Мно́гу е у́баво. — Фа́ла, со задово́лство! — А́јде да наздра́виме! За а́рно за
          у́баво! И сре́ќен пат!`,
        ],
      },
    },
  ],
};
