import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-17",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предожение по образцу.`],

      content: {
        text: `<span>Че*сто пату*ваме во стра*нство. — И*ван ка*жа де*ка че*сто сме пату*вале во стра*нство.</span>`,
        sentences: [
          {
            mkd: `1. Jас се пла*шам од во*дата. — ___.`,
            answer: [`И*ван ка*жа дека се пла*шел од во*дата`],
          },
          {
            mkd: `2. Ти ре*тко до*цниш. — ___.`,
            answer: [`И*ван ка*жа дека ре*тко си до*цнил`],
          },
          {
            mkd: `3. Организато*рите не ги пречеку*ваат го*стите на аеродро*мот. — ___.`,
            answer: [
              `И*ван ка*жа дека организато*рите не ги пречеку*вале го*стите на аеродро*мот`,
            ],
          },
          {
            mkd: `4. Ви*е се*когаш ста*вате бе*нзин на о*ваа бе*нзинска ста*ница. — ___.`,
            answer: [
              `И*ван ка*жа дека се*когаш сте ста*вале бе*нзин на о*ваа бе*нзинска ста*ница`,
            ],
          },
          {
            mkd: `5. Ни*кола не пу*ши. — ___.`,
            answer: [`И*ван ка*жа дека Ни*кола не пу*шел`],
          },
          {
            mkd: `6. Ни*е че*сто те навреду*ваме. — ___.`,
            answer: [`И*ван ка*жа дека че*сто сме те навреду*вале`],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
