import { ParagraphSectionsProps } from "@/types";

export const ruleAfterGlossary: ParagraphSectionsProps = {
  type: "lecture",
  content: {
    text: `В македонском языке слово <span>благ</span> и <span>сла\u0301док</span> «сладкий», <span>го\u0301рок</span> и
      <span>го\u0301рчлив</span> «горький» являются синонимами, но в некоторых устойчивых сочетаниях обычно употребляются только
      (или преимущественно) одно: <span>бла\u0301го ка\u0301фе</span> «сладкий кофе», <span>го\u0301рко ка\u0301фе</span> «кофе без сахара»,
      но <span>сла\u0301дко ви\u0301но</span> «сладкое вино», <span>го\u0301рчлив вкус</span> «горький вкус».

      В разговорной речи вместо <span>до\u0301мат</span> часто употребляется слово <span>па\u0301тлиџан</span> (не путайте с
      <span>мо\u0301дар па\u0301тлиџан</span> «баклажан»), вместо <span>цр\u0301вено ви\u0301но</span> — <span>цр\u0301но ви\u0301но</span>
      (буквально «чёрное вино»).`,
  },
};
