import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-15`,
  sections: [
    {
      type: "lecture",
      subtitle: {
        ru: "ДИАЛОГ",
        mkd: "ДИЈАЛОГ",
      },
      content: {
        dialogue: [
          {
            speaker: {
              id: `ivan`,
              mkd: `И*ван:`,
              ru: `Иван:`,
            },
            mkd: [
              `На*таша ме на*учи.`,
              `Па, за жал мно*гу е те*шко да на*jдеш ку*рсеви по маке*донски jа*зик во Ру*сиjа. Уче*бници во книжа*рници и*сто та*ка
              нема. На И*нтернет на*jдов грама*тика на маке*донски jа*зик на а*нглиски во дигита*лна фо*рма. По*чнав да чи*там те*кстови
              со ре*чник, да гле*дам ве*сти на И*нтернет. По*тоа на*jдов е*дна профе*сорка што да*ва ча*сови пре*ку Скаjп.`,
              `Срам ми е, но ни*когаш не бев слу*шнал за Македо*ниjа пред то*а. Не зна*ев ни*што за македо*нската исто*риjа. О*тпосле 
              про*читав и за бо*рбата на Македо*нците за неза*висност, за кодификаци*jата на станда*рдниот маке*донски jа*зик, за
              осамостоjува*њето на Македо*ниjа по ра*спадот на Jугосла*виjа и за совреме*ните про*блеми.`,
              `Да, да, и*ма и збо*рови што зву*чат исто и*ли сли*чно, а зна*чат со*сема не*што дру*го. На при*мер, македо*нското "пра*во" 
              зна*чи пра*во, а ру*ското — де*сно, македо*нскиот "газ" зна*чи газ, а ру*скиот — гас, македо*нскиот "про*лив" зна*чи про*лив,
              а ру*скиот — про*ток, македо*нскиот "жи*вот" зна*чи жи*вот, а ру*скиот — сто*мак и та*ка на*таму.`,
            ],
            ru: [
              `Наташа меня научила.`,
              `К сожалению, очень тяжело найти курсы по македонскому языку в России. Учебников в книжных магазинах тоже нет. В интернете 
              нашёл грамматику македонского языка на английском в электронной форме. Начал читать тексты со словарём, смотреть новости в интернете.
              Потом нашёл одну преподавательницу, которая даёт уроки по Скайпу.`,
              `Мне стыдно, но я никогда не слышал о Македонии до того дня. Ничего не знал о македонской истории. Позднее я прочитал и о борьбе 
              македонцев за независимость, о кодификации македонского литературного языка, о получении Македонией независимости после распада
              Югославии и о современных проблемах.`,
              `Да, да, и есть слова, которые звучат так же или похоже, а значат совсем иное. Например, македонское "право" означает "прямо", а 
              русское — "право", македонский "газ" означает "попа", а русский — "газ", македонский "пролив" означает "понос", а русский — "пролив",
              македонский "живот", означает "жизнь", а русский — "живот" и так далее.`,
            ],
          },
          {
            speaker: {
              id: `naum`,
              mkd: `На*ум:`,
              ru: `Наум:`,
            },
            mkd: [
              `И*ван, ка*де то*лку у*баво го на*учи македо*нскиот jа*зик? Мно*гу те*чно збо*руваш!`,
              `Сам? Не на ку*рсеви?`,
              `А што зна*еше за Македо*ниjа пред да се запо*знаеш со На*таша?`,
              `На*таша, а ти збо*руваш ру*ски?`,
            ],
            ru: [
              `Иван, а где ты так хорошо выучил македонский язык? Ты очень бегло говоришь.`,
              `Сам? Не на курсах?`,
              `А что ты знал о Македонии до того, как познакомился с Наташей?`,
              `Наташа, а ты говоришь по-русски?`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На*таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Не, не, не е ви*стина. На*учи сам. Jас са*мо поне*когаш му ги по*правам гре*шките.`,
              `Ма*лку. А пред да се пре*селам во Ру*сиjа не зна*ев ни*ту е*ден збор на ру*ски. Се чи*ни де*ка ру*скиот и македо*нскиот 
              jа*зик се мно*гу сли*чни, но и*ма и го*леми ра*злики.`,
              `Да, тре*ба мно*гу да па*зиш да не и*спаднеш сме*шен.`,
            ],
            ru: [
              `Нет, нет, это не правда. Он сам выучил. Я только иногда исправляю ему ошибки.`,
              `Немного. До того как я переехала в Россию, я не знала ни слова по-русски. Кажется, что русский и македонский языки очень 
              похожи, но есть и большие отличия.`,
              `Да, нужно быть очень осторожным, чтобы не показаться смешным.`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "naum", language: "ru", replyIndex: 0 },
          { speakerId: "naum", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "naum", language: "ru", replyIndex: 1 },
          { speakerId: "naum", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },
          { speakerId: "naum", language: "ru", replyIndex: 2 },
          { speakerId: "naum", language: "mkd", replyIndex: 2 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "naum", language: "ru", replyIndex: 3 },
          { speakerId: "naum", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },
        ],
      },
    },
  ],
};

//  ѐ
