import { TablesProps } from "@/types";

export const example2: TablesProps = {
  slug: "lesson-17",
  type: "example-2",
  content: {
    text: `Различные формы от глаголов <span>и*ма/не*ма</span> в этой конструкции образуется как от обычных глаголов:`,
    words: [
      {
        mkd: "До то*гаш не*мав про*бано ви*но.",
        ru: "До того момента я никогда не пробовал вино.",
      },
      {
        mkd: "До у*тре сѐ ќе и*мам преве*дено.",
        ru: "Я всё переведу до завтра.",
      },
      {
        mkd: "Да по*чнеше на*време до*сега ти сѐ би и*мал преве*дено.",
        ru: "Если бы ты начал вовремя, ты бы уже всё перевёл до этого времени.",
      },
      {
        mkd: "Ва*ков дел на фо*румов не*маме биде*jќи до*сега се не*ма пока*жано пого*лема заинтереси*раност.",
        ru: "Такого раздела на форуме у нас нет, поскольку до сих пор не был проявлен какой-либо особый интерес.",
      },
    ],
  },
};

// ѐ
