import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-15",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте текст, используя местоимения <span>ни*е</span>, <span>ти*е</span>,  <span>тоj</span> вместо  <span>jас</span>.

        (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span> "jас", "та*а", "ни*е", "ти*е"</span>.
        В центре показано текущее местоимение.
        
        Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
        проверить свою работу нажав на кнопку "Проверить мою работу".)

        Вставьте данные слова в подходящее место:
        
        <span>**са*мо, по*ети, македо*нскиот, мана*стири, импе*риjа, и*сто, по*пладне**</span>`,
      ],
      answerSet: {
        labels: ["Jас", "Ни*е", "Ти*е", "Тоj"],
      },
      content: {
        sentences: [
          {
            mkd: `Пред да се за*пишам на факулте*т не зна*ев ско*ро ни*што за Македо*ниjа и ___ jазик. 
            / Пред да се запи*шеме на факулте*т не зна*евме ско*ро ни*што за Македо*ниjа и ___ jазик.
            / Пред да се за*пишат на факулте*т не зна*еjа ско*ро ни*што за Македо*ниjа и ___ jазик.
            / Пред да се за*пише на факулте*т не зна*еше ско*ро ни*што за Македо*ниjа и ___ jазик.`,
            answer: [`македонскиот/македонскиот/македонскиот/македонскиот`],
          },
          {
            mkd: `И*ако се чи*неше де*ка е мно*гу сли*чен со ру*скиот и*злезе де*ка то*а не е со*сема та*ка. 
            / И*ако се чи*неше де*ка е мно*гу сли*чен со ру*скиот и*злезе де*ка то*а не е со*сема та*ка.
            / И*ако се чи*неше де*ка е мно*гу сли*чен со ру*скиот и*злезе де*ка то*а не е со*сема та*ка.
            / И*ако се чи*неше де*ка е мно*гу сли*чен со ру*скиот и*злезе де*ка то*а не е со*сема та*ка.`,
            answer: [``],
          },
          {
            mkd: `Се ма*чевме со постпозити*вниот член и мина*тите вре*миња и се*како со зборо*вите што звучат ___, а зна*чит со*сема
            дру*го. 
            / Се ма*чевме со постпозити*вниот член и мита*тите вре*миња и се*како со зборо*вите што звучат ___, а зна*чит со*сема
            дру*го.
            / Се ма*чеа со постпозити*вниот член и мита*тите вре*миња и се*како со зборо*вите што звучат ___, а зна*чит со*сема
            дру*го.
            / Се ма*чеше со постпозити*вниот член и мита*тите вре*миња и се*како со зборо*вите што звучат ___, а зна*чит со*сема
            дру*го.`,
            answer: [`исто/исто/исто/исто`],
          },
          {
            mkd: `На при*мер, а*ко на не*коjа де*воjка ѝ ка*жат де*ка е вре*дна, то*а е комплиме*нт, зна*чи до*бро ра*боти и нада*рена е.
            / На при*мер, а*ко на не*коjа де*воjка ѝ ка*жат де*ка е вре*дна, то*а е комплиме*нт, зна*чи до*бро ра*боти и нада*рена е.
            / На при*мер, а*ко на не*коjа де*воjка ѝ ка*жат де*ка е вре*дна, то*а е комплиме*нт, зна*чи до*бро ра*боти и нада*рена е.
            / На при*мер, а*ко на не*коjа де*воjка ѝ ка*жат де*ка е вре*дна, то*а е комплиме*нт, зна*чи до*бро ра*боти и нада*рена е.`,
            answer: [``],
          },
          {
            mkd: `Од на*шите профе*сори до*знавме за македо*нските ___ и писа*тели ка*ко што се Константи*н Милади*нов, Ко*чо Ра*цин, 
            Жи*вко Чи*нго, Пе*тре М. Андре*евски, Бла*же Ко*нески и дру*гите. 
            / Од на*шите профе*сори до*знавме за македо*нските ___ и писа*тели ка*ко што се Константи*н Милади*нов, Ко*чо Ра*цин, 
            Жи*вко Чи*нго, Пе*тре М. Андре*евски, Бла*же Ко*нески и дру*гите.
            / Од на*шите профе*сори до*знавме за македо*нските ___ и писа*тели ка*ко што се Константи*н Милади*нов, Ко*чо Ра*цин, 
            Жи*вко Чи*нго, Пе*тре М. Андре*евски, Бла*же Ко*нески и дру*гите.
            / Од на*шите профе*сори до*знавме за македо*нските ___ и писа*тели ка*ко што се Константи*н Милади*нов, Ко*чо Ра*цин, 
            Жи*вко Чи*нго, Пе*тре М. Андре*евски, Бла*же Ко*нески и дру*гите.`,
            answer: [`поети/поети/поети/поети`],
          },
          {
            mkd: `Бла*же Коне*ски не бил ___ пи*сател, ту*ку и го*лем на*учник, акаде*мик, про*фесор.
            / Бла*же Коне*ски не бил ___ пи*сател, ту*ку и го*лем на*учник, акаде*мик, про*фесор.
            / Бла*же Коне*ски не бил ___ пи*сател, ту*ку и го*лем на*учник, акаде*мик, про*фесор.
            / Бла*же Коне*ски не бил ___ пи*сател, ту*ку и го*лем на*учник, акаде*мик, про*фесор.`,
            answer: [`само/само/само/само`],
          },
          {
            mkd: `Бил е*ден од кодификато*рите на станда*тдниот маке*донски jа*зик во 1945 го*дина.
            / Бил е*ден од кодификато*рите на станда*тдниот маке*донски jа*зик во 1945 го*дина.
            / Бил е*ден од кодификато*рите на станда*тдниот маке*донски jа*зик во 1945 го*дина.
            / Бил е*ден од кодификато*рите на станда*тдниот маке*донски jа*зик во 1945 го*дина.`,
            answer: [``],
          },
          {
            mkd: `По вто*ра го*дина о*тидов во О*хрид на Семина*рот по маке*донски jа*зик, литерату*ра и культу*ра. 
            / По вто*ра го*дина оти*довме во О*хрид на Семина*рот по маке*донски jа*зик, литерату*ра и культу*ра.
            / По вто*ра го*дина оти*доа во О*хрид на Семина*рот по маке*донски jа*зик, литерату*ра и культу*ра.
            / По вто*ра го*дина о*тиде во О*хрид на Семина*рот по маке*донски jа*зик, литерату*ра и культу*ра.`,
            answer: [``],
          },
          {
            mkd: `То*а бе*ше незабо*равно доживу*вање. 
            / То*а бе*ше незабо*равно доживу*вање.
            / То*а бе*ше незабо*равно доживу*вање.
            / То*а бе*ше незабо*равно доживу*вање.`,
            answer: [``],
          },
          {
            mkd: `Пре*дпладне и*мав ча*сови, ___ се ка*пев и се со*нчав, а на*вечер се дру*жев со студе*нти од це*лиот свет. 
            / Пре*дпладне и*мавме ча*сови, ___ се ка*певме и се со*нчавме, а на*вечер се дру*жевме со студе*нти од це*лиот свет.
            / Пре*дпладне и*маа ча*сови, ___ се ка*пеа и се со*нчаа, а на*вечер се дру*жеа со студе*нти од це*лиот свет.
            / Пре*дпладне и*маше ча*сови, ___ се ка*пеше и се со*нчаше, а на*вечер се дру*жеше со студе*нти од це*лиот свет.`,
            answer: [`попладне/попладне/попладне/попладне`],
          },
          {
            mkd: `Се*како бев на Пла*ошник, на Тврди*ната, во цр*квата Све*та Со*фиjа од XI век, Све*ти Jо*ван Ка*нео од XIII век, во 
            Богоро*дица Перивле*пта, а по*сетив и дру*ги знамени*тости во О*хрид. Се во*зев со бро*дче до мана*стирот Све*ти На*ум, а
            та*му со ка*jчето про*шетав до изво*рите на ре*ката Црн Дрим.
            / Се*како бе*вме на Пла*ошник, на Тврди*ната, во цр*квата Све*та Со*фиjа од XI век, Све*ти Jо*ван Ка*нео од XIII век, во 
            Богоро*дица Перивле*пта, а посе*тивме и дру*ги знамени*тости во О*хрид. Се во*зевме со бро*дче до мана*стирот Све*ти На*ум, а
            та*му со ка*jчето проше*тавме до изво*рите на ре*ката Црн Дрим.
            / Се*како бе*а на Пла*ошник, на Тврди*ната, во цр*квата Све*та Со*фиjа од XI век, Све*ти Jо*ван Ка*нео од XIII век, во 
            Богоро*дица Перивле*пта, а посе*тиjа и дру*ги знамени*тости во О*хрид. Се во*зеа со бро*дче до мана*стирот Све*ти На*ум, а
            та*му со ка*jчето проше*таа до изво*рите на ре*ката Црн Дрим.
            / Се*како бе*ше на Пла*ошник, на Тврди*ната, во цр*квата Све*та Со*фиjа од XI век, Све*ти Jо*ван Ка*нео од XIII век, во 
            Богоро*дица Перивле*пта, а по*сети и дру*ги знамени*тости во О*хрид. Се во*зеше со бро*дче до мана*стирот Све*ти На*ум, а
            та*му со ка*jчето про*шета до изво*рите на ре*ката Црн Дрим.`,
            answer: [``],
          },
          {
            mkd: `Е*ден ви*кенд о*тидов до Би*тола, во ко*jа за вре*ме на Осма*нската ___ се нао*ѓале конзула*тите на ра*злични зе*мjи. 
            / Е*ден ви*кенд оти*довме до Би*тола, во ко*jа за вре*ме на Осма*нската ___ се нао*ѓале конзула*тите на ра*злични зе*мjи.
            / Е*ден ви*кенд оти*доа до Би*тола, во ко*jа за вре*ме на Осма*нската ___ се нао*ѓале конзула*тите на ра*злични зе*мjи.
            / Е*ден ви*кенд о*тиде до Би*тола, во ко*jа за вре*ме на Осма*нската ___ се нао*ѓале конзула*тите на ра*злични зе*мjи.`,
            answer: [`империја/империја/империја/империја`],
          },
          {
            mkd: `И бев во анти*чкиот град Херакле*jа бли*зку до Би*тола. И*мав сре*ќа да го по*сетам фестива*лот "О*хридско ле*то". 
            По*краj класи*чната му*зика слу*шнав пре*красна маке*донска на*родна му*зика и ви*дов ка*ко се и*граат маке*донски о*ра! 
            / И бе*вме во анти*чкиот град Херакле*jа бли*зку до Би*тола. И*мавме сре*ќа да го посе*тите фестива*лот "О*хридско ле*то". 
            По*краj класи*чната му*зика слу*шнавме пре*красна маке*донска на*родна му*зика и ви*довме ка*ко се и*граат маке*донски о*ра!
            / И бе*а во анти*чкиот град Херакле*jа бли*зку до Би*тола. И*маа сре*ќа да го по*сетат фестива*лот "О*хридско ле*то". 
            По*краj класи*чната му*зика слу*шнаа пре*красна маке*донска на*родна му*зика и ви*доа ка*ко се и*граат маке*донски о*ра!
            / И бе*ше во анти*чкиот град Херакле*jа бли*зку до Би*тола. И*маше сре*ќа да го по*сети фестива*лот "О*хридско ле*то". 
            По*краj класи*чната му*зика слу*шна пре*красна маке*донска на*родна му*зика и ви*де ка*ко се и*граат маке*донски о*ра!`,
            answer: [``],
          },
          {
            mkd: `Наре*дните го*дини се оби*дував што по*често да до*аѓам во Македо*ниjа во ко*jа а*нтички гра*дови се на*оѓаат бли*ску 
            до средновеко*вните цр*кви и ___, а плани*ните и езе*рата се то*лку у*бави што не мо*жат да се о*пишат со збо*рови. 
            / Наре*дните го*дини се обиду*вавме што по*често да доа*ѓаме во Македо*ниjа во ко*jа а*нтички гра*дови се на*оѓаат бли*ску 
            до средновеко*вните цр*кви и ___, а плани*ните и езе*рата се то*лку у*бави што не мо*жат да се о*пишат со збо*рови.
            / Наре*дните го*дини се обиду*ваа што по*често да доа*ѓаат во Македо*ниjа во ко*jа а*нтички гра*дови се на*оѓаат бли*ску 
            до средновеко*вните цр*кви и ___, а плани*ните и езе*рата се то*лку у*бави што не мо*жат да се о*пишат со збо*рови.
            / Наре*дните го*дини се обиду*ваше што по*често да до*аѓа во Македо*ниjа во ко*jа а*нтички гра*дови се на*оѓаат бли*ску 
            до средновеко*вните цр*кви и ___, а плани*ните и езе*рата се то*лку у*бави што не мо*жат да се о*пишат со збо*рови.`,
            answer: [`манастири/манастири/манастири/манастири`],
          },
        ],
      },
    },
  ],
};
