import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-15",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Чьи ошибки исправляют эти преподаватели? — Студентов. 2. На экзамене преподаватели не будут исправлять ваши ошибки. 
        3. Если преподаватели не будут исправлять ваши ошибки, как вы выучите язык? 4. Пожалуйста, всегда исправляй мои ошибки. 5. Пусть
        преподаватель исправляет твои ошибки. 6. Этот преподаватель никогда меня не исправлял! 7. Твои коллеги сказали, что на экзамене
        преподаватели не исправляли ошибки. 8. Если бы вы всегда исправляли мои ошибки, я бы лучше говорил по-македонски.`,
        answer: [
          `1. Чии грешки поправаат професорите? — На студентите. 2. На испитот професорите нема да ви ги поправаат грешките. 
          3. Ако професорите не ви ги поправаат грешките како ќе го научите јазикот? 4. Те молам, секогаш поправај ги моите грешки.
          5. Професорот нека ги поправа твоите грешки. 6. Овој професор никогаш не ме поправал! 7. Твоите колеги кажаа дека на испитот
          професорите не ги поправале грешките. 8. Секогаш да ги поправавте моите грешки
          **подобро ќе зборував македонски. / јас подобро би %зборувал / зборувала% македонски.**`,
        ],
      },
    },
  ],
};

//**зборувал / зборувала**
