import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-15",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения по образцу.`],
      content: {
        text: "<span>Студе*нтот го по*ложи и*спитот. — Студе*нтот го бе*ше по*ложил и*спитот.</span>",

        sentences: [
          {
            mkd: `1. Студи*рав пра*во. — ___.`,
            answer: [`Го бев студирав право`],
          },
          {
            mkd: `2. Ни*е ги нау*чиме си*те збо*рови. — ___.`,
            answer: [`Ние ги бевме научиле сите зборови`],
          },
          {
            mkd: `3. Профе*сорот го о*дложи предава*њето. — ___.`,
            answer: [`Професорот го беше одложил предавањето`],
          },
          {
            mkd: `4. До*jдовте на консулта*циjа? — ___.`,
            answer: [`Бевте дошлена на консултација?`],
          },
          {
            mkd: `5. Учени*ците мно*гу се изнерви*раа. — ___.`,
            answer: [`Учениците многу се беа изнервирале`],
          },
          {
            mkd: `6. Наставни*чката го о*бjасни прави*лото. — ___.`,
            answer: [`Наставничката го беше објаснила правилото`],
          },
          {
            mkd: `7. На ку*рсот до*знав мно*гу но*ви ра*боти. — ___.`,
            answer: [`На курсот бев **дознал / дознала** многу нови работи`],
          },
          {
            mkd: `8. До*jдовме на Семина*рот за маке*донски jа*зик, литерату*ра и култу*ра. — ___.`,
            answer: [
              `Дојдовме на Семинарот за македонски јазик, литература и култура`,
            ],
          },
          {
            mkd: `9. Не*над jа про*чита грамати*ката. — ___.`,
            answer: [`Ненад ја беше прочитал граматиката`],
          },
          {
            mkd: `10. Ви*е го ку*пивте ре*чникот? — ___?`,
            answer: [`Вие го бевте купиле речникот`],
          },
          {
            mkd: `11. Ти го на*прави дома*шното без ни*ту е*дна гре*шка. — ___.`,
            answer: [
              `Ти го беше **направил / направила** домашното без ниту една грешка`,
            ],
          },
          {
            mkd: `12. Професо*рката jа о*ткажа консултаци*jата. — ___.`,
            answer: [`Професорката ја беше откажала консултацијата`],
          },
        ],
      },
    },
  ],
};
