import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-15",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте предложения по образцу, используя союз <span>ка*ко да</span>.`,
      ],

      content: {
        text: `<span>И*гор ужи*ваше. То*а беше после*дниот ден во него*виот жи*вот. — И*гор ужи*ваше ка*ко то*а да бе*ше после*дниот ден 
              во него*виот жи*вот.</span>`,
        sentences: [
          {
            mkd: `1. Зо*што Ми*лан се одне*сува та*ка? Jас сум крив. — ___?`,
            answer: [`Зошто Милан се однесува како да сум крив`],
          },
          {
            mkd: `2. Зо*што та*ка о*твораш у*ста? Нем ли си? — ___?`,
            answer: [`Зошто отвораш уста како да си нем`],
          },
          {
            mkd: `3. Де*тето се ра*сплака. Го за*боле не*што. — ___.`,
            answer: [`Детето се расплака како да го заболе нешто`],
          },
          {
            mkd: `4. Ма*рина ме по*гледна. Ми се лу*ти. — ___.`,
            answer: [`Марина ме погледна како да ми се лути`],
          },
          {
            mkd: `5. Са*ња пре*многу бр*зо збо*рува. Се пра*вда. — ___.`,
            answer: [`Сања премногу брзо зборува како да се правда`],
          },
          {
            mkd: `6. Тинеjџе*рите пу*штаа гла*сна му*зика. Бе*а са*ми во па*ркот. — ___.`,
            answer: [
              `Тинејџерите пуштаа гласна музика како да беа сами во паркот`,
            ],
          },
          {
            mkd: `7. Коле*гите збору*ваат со нив. Ни*што не се слу*чило. — ___.`,
            answer: [`Колегите зборуваа со нив како ништо да не се случило`],
          },
          {
            mkd: `8. Зо*што им ка*жува та*кви ра*боти на лу*гето? Не е све*сен де*ка со то*а ги навре*дува. — ___.`,
            answer: [
              `Зошто им кажува такви работи на луѓето како да не е свесен дека со тоа ги навредува`,
            ],
          },
          {
            mkd: `9. А*танас по*мина по*краj со*бата. Не посто*еше. — ___.`,
            answer: [`Атанас помина покрај собата како да не постоеше`],
          },
          {
            mkd: `10. Те*а ма*вташе со ра*ка. Са*каше не*што да ка*же. — ___.`,
            answer: [`Теа мавташе со рака како да сакаше нешто да каже`],
          },
          {
            mkd: `11. Зо*што во*зат то*лку бр*зо? За нив не ва*жат за*кони. — ___.`,
            answer: [`Зошто возат толку брзо како за нив да не важат закони`],
          },
          {
            mkd: `12. Во о*воj град и*ма трото*ари. Но во реа*лноста ги не*ма. — ___.`,
            answer: [
              `Во овој град има тротоари, но во реалноста како да не ги нема`,
            ],
          },
        ],
      },
    },
  ],
};
