import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-15",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Вчера я опять встречался с Наташей и её мужем Иваном. Я всё время удивляюсь, как хорошо Иван говорит по-македонски. 
        Оказывается, он его выучил сам! После того как Иван познакомился с Наташей, он купил в книжном магазине македонско-русский словарь,
        нашёл в Интернете грамматику македонского языка на английском языке и начал читать тексты. Он не нашёл в Москве курсов по
        македонскому языку, поэтому занимался с преподавателем по скайпу. С Иваном очень интересно разговаривать, потому что он много читал
        об истории Македонии, борьбе за независимость, кодификации македонского языка в 1945 году и получении Македонией независимости после
        распада Югославии. Мне было интересно, говорит ли Наташа так же хорошо по-русски, как Иван по-македонски. Оказывается, она только
        недавно начала учить русский язык, а до переезда в Россию не знала ни слова по-русски. Иван и Наташа рассказали, что некоторые слова
        звучат так же или похоже, но значат совсем иное. Нужно быть осторожным, чтобы не показаться смешным. А я думал, что русский и
        македонский очень похожи!`,
        answer: [
          `Вчера пак се сретнав со Наташа и нејзиниот маж Иван. Цело време се чудам колку убаво Иван зборува македонски. **Излезе / Се покажа** 
          дека го научил сам! Откако Иван се запозна со Наташа купи македонско-руски речник во книжарница, најде на интернет граматика на
          македонскиот јазик на англиски и почна да чита текстови. Не нашол во Москва курсеви по македонски јазик затоа учел со една
          професорка преку Скајп. Со Иван е многу интересно да се зборува затоа што многу читал за историјата на Македонија, за борбата за
          независност, за кодификацијата на македонскиот јазик во 1945 година и за осамостојувањето на Македонија по распадот на Југославија.
          Ми беше интересно дали Наташа зборува исто толку добро руски колку што Иван зборува македонски. **Излезе / Се покажа** дека
          неодамна почнала да го учи рускиот јазик, а пред да се преселат во Русија не знаела ниту еден збор на руски. Иван и Наташа раскажаа
          дека некои зборови звучат исто или слично, а значат сосема нешто друго. Треба многу да **пазиш / внимаваш** да не испаднеш смешен. А јас
          мислев дека рускиот и македонскиот се многу слични!`,
        ],
      },
    },
  ],
};
