import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-15",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Составьте предложения из данных слов, используя плюсквамперфект.`,
      ],

      content: {
        text: "<span>Jас, по*двлече, на*jважно. — Jас го бев по*двлекол наjва*жногто.</span>",
        sentences: [
          {
            mkd: `1) Де*те, за*лепи, на, sид, ка*ртички, со, збо*рови. — ___.`,
            answer: [`Детето ги беше залепило на ѕидот картичките со зборови`],
          },
          {
            mkd: `2) Ти, за*врши, сту*дии, по, нови*нарство? — ___?`,
            answer: [`Ти беше **завршил / завршила** студии по новинарство`],
          },
          {
            mkd: `3) Ви*е, ку*пи, дигита*лен, фотоапара*т? — ___?`,
            answer: [`Вие бевте купиле дигитален фотоапарат`],
          },
          {
            mkd: `4) Наш, соу*ченик, се пре*сели, во, друг, град. — ___.`,
            answer: [`Нашиот соученик се беше пресел во друг град`],
          },
          {
            mkd: `5) Де*кан, ра*скаже, на, студе*нти, за, ра*спад, на, Со*ветски Со*jуз. — ___.`,
            answer: [
              `Деканот им беше раскажал на студентите за распадот на Советскиот Сојуз`,
            ],
          },
          {
            mkd: `6) Jас, пре*веде, е*ден, те*жок, текст, од, маке*донски, jа*зик, на, ру*ски. — ___.`,
            answer: [
              `Јас бев **превел / правела** еден тежок текст од македонски јазик на руски`,
            ],
          },
          {
            mkd: `7) Ти, до*знае, за, и*спит? — ___?`,
            answer: [`Ти беше **дознал / дознала** за испитот`],
          },
          {
            mkd: `8) Jугосла*виjа, се ра*спадне. — ___.`,
            answer: [`Југославија се беше распаднала`],
          },
          {
            mkd: `9) Ни*е, ре*ши, про*блем. — ___.`,
            answer: [`Ние го бевме решиле проблемот`],
          },
          {
            mkd: `10) Студе*нтка, па*дне. — ___.`,
            answer: [`Студентката беше падна`],
          },
          {
            mkd: `11) Jас, се за*пише, на, фило*лошки, факулте*т. — ___.`,
            answer: [`Јас бев се **запишал / запишала** на филолошки факултет`],
          },
          {
            mkd: `12) Ни*е, да*jде, анало*гиjа, за, нов, фа*кти. — ___.`,
            answer: [`Ние бевме нашле аналогија за новите факти`],
          },
        ],
      },
    },
  ],
};
