import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-15",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте текст, используя местоимения <span>ни*е</span>, <span>ти*е</span>,  <span>тоj</span> вместо  <span>jас</span>.

        (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span> "jас", "та*а", "ни*е", "ти*е"</span>.
        В центре показано текущее местоимение.
        
        Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
        проверить свою работу нажав на кнопку "Проверить мою работу".)

        Вставьте данные слова в подходящее место:
        
        <span>**са*мо, по*ети, македо*нскиот, мана*стири, импе*риjа, и*сто, по*пладне**</span>`,
      ],
      answerSet: {
        labels: ["Jас", "Тоj", "Ни*е", "Ти*е"],
      },
      content: {
        sentences: [
          {
            mkd: `Пред да се за*пишам на факулте*т не зна*ев ско*ро ни*што за Македо*ниjа и ___ jазик. 
            / .
            / Ни*когаш не сме трени*рале спорт.
            / Ти*е ни*когаш не трени*рале спорт.`,
            answer: [`македонскиот/македонскиот/македонскиот/македонскиот`],
          },
          {
            mkd: `И*ако се чи*неше де*ка е мно*гу сли*чен со ру*скиот и*злезе де*ка то*а не е со*сема та*ка. 
            / Во ___ и на факулте*т ги мра*зеше часо*вите по фи*зичко.
            / Во ___ и на факулте*т ги мра*зевме часо*вите по фи*зичко.
            / Во ___ и на факулте*т ги мра*зеа часо*вите по фи*зичко.`,
            answer: [``],
          },
          {
            mkd: `Се ма*чевме со постпозити*вниот член и мита*тите вре*миња и се*како со зборо*вите што звучат ___, а зна*чит со*сема
            дру*го. 
            / Не разби*раше зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти.
            / Не разби*равме зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти.
            / Не разби*раа зо*што лу*ѓето гле*даат спорт и ___ за ра*злични спорти*сти.`,
            answer: [``],
          },
          {
            mkd: `На при*мер, а*ко на не*коjа де*воjка ѝ ка*жат де*ка е вре*дна, то*а е комплиме*нт, зна*чи до*бро ра*боти и нада*рена е.
            / Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да се
            по*тиш на спра*ви за ве*жба*ње.
            / Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да се
            по*тиш на спра*ви за ве*жба*ње.
            / Мно*гу е попри*jатно да се*диш и да пи*еш ка*фе или пи*во на ра*ат о*тколку да тр*чаш по не*коjа глу*пава ___ или да се
            по*тиш на спра*ви за ве*жба*ње.`,
            answer: [``],
          },
          {
            mkd: `Од на*шите профе*сори до*знавме за македо*нските ___ и писа*тели ка*ко што се Константи*н Милади*нов, Ко*чо Ра*цин, 
            Жи*вко Чи*нго, Пе*тре М. Андре*евски, Бла*же Ко*нески и дру*гите. 
            / Ко*га та*а напо*лни три*есет го*дини по*чна да и*ма про*блеми ___ здра*вjето.
            / Ко*га напо*лнивме три*есет го*дини по*чнавме да и*маме про*блеми ___ здра*вjето.
            / Ко*га напо*лниjа три*есет го*дини по*чнаа да и*маат про*блеми ___ здра*вjето.`,
            answer: [`со/со/со/со`],
          },
          {
            mkd: `Бла*же Коне*ски не бил ___ пи*сател, ту*ку и го*лем на*учник, акаде*мик, про*фесор.
            / Те*шко ѝ бе*ше да се ка*чи пе*шки на трет кат, по*чна да jа бо*ли грб ___ се*дење пред компjутер и посто*jано ка*шлаше.
            / Те*шко ни бе*ше да се ка*чиме пе*шки на трет кат, по*чна да нè бо*ли грб ___ се*дење пред компjутер и посто*jано ка*шлавме.
            / Те*шко им бе*ше да се ка*чат пе*шки на трет кат, по*чна да ги бо*ли грб ___ се*дење пред компjутер и посто*jано ка*шлаа.`,
            answer: [`од/од/од/од`],
          },
          {
            mkd: `Бил е*ден од кодификато*рите на станда*тдниот маке*донски jа*зик во 1945 го*дина.
            / И се зде*бели мно*гу. Пр*во ре*ши да ги о*стави ци*гарите, да се хра*ни здра*во, да пе*шачи пред ___ и да ле*гнува перед
            двана*есет.
            / И се зде*беливме мно*гу. Пр*во ре*шивме да ги о*ставиме ци*гарите, да се хра*ниме здра*во, да пе*шачиме перед ___ и да
            ле*гнуваме пред двана*есет.
            / И се зде*белиjа мно*гу. Пр*во ре*шиjа да ги о*стават ци*гарите, да се хра*нат здра*во, да пе*шачат пред ___ и да
            ле*гнуваат пред двана*есет.`,
            answer: [``],
          },
          {
            mkd: `По вто*ра го*дина о*тидов во О*хрид на Семина*рот по маке*донски jа*зик, литерату*ра и культу*ра. 
            / За три ме*сеци о*слабе 10 ки*ла, пре*стана да ___ и ѝ се по*добри со*нот.
            / За три ме*сеци о*слабевме 10 ки*ла, пре*станавме да ___ и ни се по*добри со*нот.
            / За три ме*сеци о*слабеа 10 ки*ла, пре*станаа да ___ и им се по*добри со*нот.`,
            answer: [``],
          },
          {
            mkd: `То*а бе*ше незабо*равно доживу*вање. 
            / По*тоа по*чна да тр*ча со друга*рите, но мно*гу jа бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажа.
            / По*тоа по*чнавме да тр*чаме со друга*рите, но мно*гу нè бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажавме.
            / По*тоа по*чнаа да тр*чаат со друга*рите, но мно*гу ги бо*леа зглобо*вите и муску*лите и за*тоа се о*ткажаа.`,
            answer: [``],
          },
          {
            mkd: `Пре*дпладне и*мав ча*сови, ___ се ка*пев и се со*нчав, а на*вечер се дру*жев со студе*нти од це*лиот свет. 
            / Про*ба да во*зи велосипе*д. И се до*падна. По*чна да се во*зи со велосипе*д ___ ра*бота.
            / Про*бавме да во*зиме велосипе*д. Ни се до*падна. По*чнавме да се во*зиме со велосипе*д ___ ра*бота.
            / Про*баа да во*зат велосипе*д. Им се до*падна. По*чнаа да се во*зат со велосипе*д ___ ра*бота.`,
            answer: [`до/до/до/до`],
          },
          {
            mkd: `Се*како бев на Пла*ошник, на Тврди*ната, во цр*квата Све*та Со*фиjа од XI век, Све*ти Jо*ван Ка*нео од XIII век, во 
            Богоро*дица Перивле*пта, а по*сетив и дру*ги знамени*тости во О*хрид. Се во*зев со бро*дче до мана*стирот Све*ти На*ум, а
            та*му со ка*jчето про*шетав до изво*рите на ре*ката Црн Дрим.
            / Ко*га jа прашу*ваат ка*ко го за*сака спо*ртот се*когаш ___ де*ка не го са*ка спо*ртот, ту*ку по не*го се чу*вствува
            до*бро.
            / Ко*га нè прашу*ваат ка*ко го за*сакавме спо*ртот се*когаш ___ де*ка не го са*каме спо*ртот, ту*ку по не*го се чу*вствуваме
            до*бро.
            / Ко*га ги прашу*ваат ка*ко го за*сакаа спо*ртот се*когаш ___ де*ка не го са*каат спо*ртот, ту*ку по не*го се чу*вствуваат
            до*бро.`,
            answer: [``],
          },
          {
            mkd: `Е*ден ви*кенд о*тидов до Би*тола, во ко*jа за вре*ме на Осма*нската ___ се нао*ѓале конзула*тите на ра*злични зе*мjи. 
            / Про*ба да во*зи велосипе*д. И се до*падна. По*чна да се во*зи со велосипе*д ___ ра*бота.
            / Про*бавме да во*зиме велосипе*д. Ни се до*падна. По*чнавме да се во*зиме со велосипе*д ___ ра*бота.
            / Про*баа да во*зат велосипе*д. Им се до*падна. По*чнаа да се во*зат со велосипе*д ___ ра*бота.`,
            answer: [`до/до/до/до`],
          },
          {
            mkd: `И бев во анти*чкиот град Херакле*jа бли*зку до Би*тола. И*мав сре*ќа да го по*сетам фестива*лот "О*хридско ле*то". 
            По*краj класи*чната му*зика слу*шнав пре*красна маке*донска на*родна му*зика и ви*дов ка*ко се и*граат маке*донски о*ра! 
            / Про*ба да во*зи велосипе*д. И се до*падна. По*чна да се во*зи со велосипе*д ___ ра*бота.
            / Про*бавме да во*зиме велосипе*д. Ни се до*падна. По*чнавме да се во*зиме со велосипе*д ___ ра*бота.
            / Про*баа да во*зат велосипе*д. Им се до*падна. По*чнаа да се во*зат со велосипе*д ___ ра*бота.`,
            answer: [``],
          },
          {
            mkd: `Наре*дните го*дини се оби*дував што по*често да до*аѓам во Македо*ниjа во ко*jа а*нтички гра*дови се на*оѓаат бли*ску 
            до средновеко*вните цр*кви и ___, а плани*ните и езе*рата се то*лку у*бави што не мо*жат да се о*пишат со збо*рови. 
            / Про*ба да во*зи велосипе*д. И се до*падна. По*чна да се во*зи со велосипе*д ___ ра*бота.
            / Про*бавме да во*зиме велосипе*д. Ни се до*падна. По*чнавме да се во*зиме со велосипе*д ___ ра*бота.
            / Про*баа да во*зат велосипе*д. Им се до*падна. По*чнаа да се во*зат со велосипе*д ___ ра*бота.`,
            answer: [`до/до/до/до`],
          },
        ],
      },
    },
  ],
};
