import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-11",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "Ба*дник",
            pron: "ба*дник",
            ru: "сочельник",
          },
          {
            mkd: "бискви*т",
            pron: "бискви*т",
            ru: "печенье",
          },
          {
            mkd: "Бо*жиќ / Бо*жик",
            pron: "бо*жик' / бо*жик",
            ru: "Рождество",
          },
          {
            mkd: "бонбо*на",
            pron: "бонбо*на",
            ru: "конфета",
          },
          {
            mkd: "ве*рува",
            pron: "вэ*рува",
            ru: "верить",
          },
          {
            mkd: "во*зрасен",
            pron: "во*зрасэн",
            ru: "взрослый",
          },
          {
            mkd: "га*зда",
            pron: "га*зда",
            ru: "хозяин",
          },
          {
            mkd: "го*дишен",
            pron: "го*дишэн",
            ru: "годовой",
          },
          {
            mkd: "го*дишно вре*ме",
            pron: "го*дишно_врэ*мэ",
            ru: "время года",
          },
          {
            mkd: "де*ли",
            pron: "дэ*ли",
            ru: "делить",
          },
          {
            mkd: "до*бива",
            pron: "до*бива",
            ru: "получать",
          },
          {
            mkd: "до*бие",
            pron: "до*биэ",
            ru: "получить",
          },
          {
            mkd: "зеле*нее",
            pron: "зэлэ*нэ",
            ru: "зеленеть",
          },
          {
            mkd: "зи*мски",
            pron: "зи*мски",
            ru: "зимний",
          },
          {
            mkd: "се и*скапе",
            pron: "сэ_и*скапэ",
            ru: "искупаться",
          },
          {
            mkd: "се и*сонча",
            pron: "сэ_й*сонча",
            ru: "загореть",
          },
          {
            mkd: "јану*ари (м.р.)",
            pron: "йану*ари",
            ru: "январь",
          },
          {
            mkd: "се ка*пе",
            pron: "сэ_ка*пэ",
            ru: "купаться",
          },
          {
            mkd: "ко*ледар",
            pron: "ко*лэдар",
            ru: "колядник",
          },
          {
            mkd: "коле*дарска пе*сна",
            pron: "колэ*дарска_пэ*сна",
            ru: "колядка",
          },
          {
            mkd: "Ко*леде",
            pron: "Ко*лэдэ",
            ru: "сочельник",
          },
          {
            mkd: "ле*сен",
            pron: "лэ*снэн",
            ru: "лёгкий",
          },
          {
            mkd: "ле*сно",
            pron: "лэ*сно",
            ru: "легко",
          },
          {
            mkd: "ма*ало",
            pron: "ма*ало",
            ru: "район",
          },
          {
            mkd: "о*ган",
            pron: "о*ган",
            ru: "огонь, костёр",
          },
          {
            mkd: "о*милен",
            pron: "о*милэн",
            ru: "любимый",
          },
          {
            mkd: "о*рев",
            pron: "о*рэв",
            ru: "грецкий орех",
          },
          {
            mkd: "па*ричка",
            pron: "па*ричка",
            ru: "монетка",
          },
          {
            mkd: "пе*е",
            pron: "пэ*э",
            ru: "петь",
          },
          {
            mkd: "пе*сна",
            pron: "пэ*сна",
            ru: "песня",
          },
          {
            mkd: "по*дели",
            pron: "по*дэли",
            ru: "поделить",
          },
          {
            mkd: "по*каже",
            pron: "по*кажэ",
            ru: "показать",
          },
          {
            mkd: "пока*жува",
            pron: "пока*жува",
            ru: "показывать",
          },
          {
            mkd: "по*сен",
            pron: "по*сэн",
            ru: "постный",
          },
          {
            mkd: "пра*зник",
            pron: "пра*зник",
            ru: "праздник",
          },
          {
            mkd: "про*слави",
            pron: "про*слави",
            ru: "отметить, отпраздновать",
          },
          {
            mkd: "ра*кав",
            pron: "ра*каф",
            ru: "рукав",
          },
          {
            mkd: "ра*сцуту",
            pron: "ра*сцуту",
            ru: "расцвести",
          },
          {
            mkd: "сла*ви",
            pron: "сла*ви",
            ru: "отмечать, праздновать",
          },
          {
            mkd: "сле*ден",
            pron: "слэ*дэн",
            ru: "следующий",
          },
          {
            mkd: "со*бере",
            pron: "со*бэрэ",
            ru: "собрать",
          },
          {
            mkd: "со*бира",
            pron: "со*бира",
            ru: "собирать",
          },
          {
            mkd: "се со*нча",
            pron: "сэ_со*нча",
            ru: "загорать",
          },
          {
            mkd: "специја*лен",
            pron: "спэција*лэн",
            ru: "специальный",
          },
          {
            mkd: "сре*ќен",
            pron: "срэ*к'эн",
            ru: "счастливый",
          },
          {
            mkd: "се тру*ди",
            pron: "сэ_тру*ди",
            ru: "стараться",
          },
          {
            mkd: "цу*ти",
            pron: "цу*ти",
            ru: "цвести",
          },
          {
            mkd: "че*стита (нешто некому)",
            pron: "чэ*стита",
            ru: "поздравлять",
          },
          {
            mkd: "чу*ка",
            pron: "чу*ка",
            ru: "стучать",
          },
          {
            mkd: "чу*кне",
            pron: "чу*кнэ",
            ru: "стукнуть",
          },
        ],
      },
    },
  ],
};
