import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>го</span>, <span>jа</span>, <span>ги</span> там, где нужно.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. Ќе ви ___ ра*скажам за При*леп.`,
            answer: [`го`],
          },
          {
            mkd: `2. Ќе ви ___ ра*скажам инте*ресни при*казни за Кичево.`,
            answer: [`ги`],
          },
          {
            mkd: `3. Ќе ви ___ ра*скажам си*те инте*ресни при*казни за Куманово.`,
            answer: [`ги`],
          },
          {
            mkd: `4. ___ гле*даме е*ден мно*гу инте*ресен филм со родите*лите.`,
            answer: [`Го`],
          },
          {
            mkd: `5. Че*сто ___ о*диме на* гости ка*j нив.`,
            answer: [`ги`],
          },
          {
            mkd: `6. Не*коj ___ збо*рува со И*ван и Бла*гоjа.`,
            answer: [`го`],
          },
          {
            mkd: `7. Са*кам да му ___ ка*жам за тво*jот по*дарок.`,
            answer: [`го`],
          },
          {
            mkd: `8. Са*кам да му ___ по*кажам тво*jот по*дарок.`,
            answer: [`го`],
          },
          {
            mkd: `9. Не*ма да ___ че*каме Би*серка.`,
            answer: [`ја`],
          },
          {
            mkd: `10. Ко*го ___ прашу*ваат На*ум и Кли*ме?`,
            answer: [`го`],
          },
          {
            mkd: `11. Со ко*го ___ збору*ваат На*ум и Кли*ме?`,
            answer: [`го`],
          },
          {
            mkd: `12. Ко*го ___ са*каат да ___ пра*шаат На*ум и Кли*ме?`,
            answer: [`го`, `го`],
          },
          {
            mkd: `13. И*вана си*те ___ зна*ат.`,
            answer: [`го`],
          },
          {
            mkd: `14. Што ___ че*каш?`,
            answer: [`го`],
          },
          {
            mkd: `15. Ко*jа ко*ла ___ са*каш да ___ ку*пиш?`,
            answer: [`ја`, `ја`],
          },
          {
            mkd: `16. Ка*ква ко*ла ___ са*каш да ___ ку*пиш?`,
            answer: [`ја`, `ја`],
          },
          {
            mkd: `17. Во о*воj ре*сторан ___ не*ма та*ква пи*ца.`,
            answer: [`ја`],
          },
          {
            mkd: `18. Во о*ваа аге*нциjа ___ и*ма си*те кла*си автомо*били.`,
            answer: [`ги`],
          },
        ],
      },
    },
  ],
};
