import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-6",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `— Добрый день! — Добрый день! Мы хотим взять на прокат машину. — Да, конечно. Машину какого класса вы хотите взять
        напрокат? — Экономик, с автоматичесткй коробкой передач, дизель. — Могу вам посоветовать вот эту машину. Она расходует мало
        топлива и очень удобная. — А кондиционер есть? — Да, машина оборудована кондиционером и CD-плеером. — А что входит в цену? —
        В цену входит старахование для поездки за границу, страховка транспортного средства и пассажиров, страхование гражданской
        ответственности. — А цены указаны с НДС или без? — Цены указаны с НДС. — А мы можем взять машину в Скопье и сдать её в Охриде? —
        К сожалению, нет. — А какие документы нужны, чтобы взять у вас машину напрокат? — Нужна личная карта или загранпаспорт, македонское
        или международное водительское удостоверение. Водителю должно быть больше 25 лет.`,
        answer: [
          `— Добар ден! — Добар ден! Сакаме да изнаjмиме кола. — Да, секако. Кола од коjа класа сакате да изнаjмите? — Економик, со 
          автоматски менувач на брзини, на дизел. — Можам да ви jа перпорачам оваа кола. Троши малку гориво и е многу удобна. — Дали има
          клима-уред? — Да, колата е опремена со клима-уред и CD плеер. — А што е вклучено во цената? — Во цената се вклучени зелен картон,
          осигурување на возило и патниците, и осигурување од трето лице. — А цените се прикажани со вклучен ДДВ или без? — Цените се
          прикажани со вклучен ДДВ. — А дали може да jа подигнеме колата во Скопjе и да jа предадеме во Охрид? — За жал не. — А кои
          документи требаат да се изнаjми колата од каj вас? — Требаат личната карта или пасошот и македонската или меѓународната возачка
          дозвола. Возачот треба да има над 25 години.`,
        ],
      },
    },
  ],
};
