import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.
        
        (Подсказка: используйте кнопки ниже, чтобы переключать режимы выполнения задания а), б), в). В центре показано текущий режим.)`,
      ],
      answerSet: {
        labels: ["а)", "б)", "в)"],
      },
      content: {
        sentences: [
          {
            mkd: `нео*пходен апара*т ___ ,`,
            answer: [
              `неопходниот апарат/неопходни апарати/неопходните апарати`,
            ],
          },
          {
            mkd: `ограни*чена бр*зина ___ ,`,
            answer: [
              `ограничената брзина/ограничени брзини/ограничените брзини`,
            ],
          },
          {
            mkd: `до*стапно во*зило ___ ,`,
            answer: [`достапното возило/достапни возила/достапните возила`],
          },
          {
            mkd: `де*сна вра*та ___ ,`,
            answer: [`десната врата/десни врати/десните врати`],
          },

          {
            mkd: `ска*по го*риво ___ ,`,
            answer: [`скапото гориво/скапи горива/скапите горива`],
          },
          {
            mkd: `мо*е ко*мбе ___ ,`,
            answer: [`моето комбе/мои комбиња/моите комбиња`],
          },
          {
            mkd: `го*лема ку*тиjа ___ ,`,
            answer: [`големата кутиjа/големи кутии/големите кутии`],
          },
          {
            mkd: `бел леб ___ ,`,
            answer: [`белиот леб/бели лебови/белите лебови`],
          },
          {
            mkd: `мла*до ли*це ___ ,`,
            answer: [`младото лице/млади лица/млидите лица`],
          },
          {
            mkd: `сигу*рносен триа*голник ___ ,`,
            answer: [
              `сигурниот триаголник/сигуносни триаголници/сигуносните триаголници`,
            ],
          },
          {
            mkd: `во*здушна пе*рница ___ ,`,
            answer: [`воздушната перница/воздушни перници/воздушните перници`],
          },
        ],
      },
    },
  ],
};
