import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте глаголы в скобках в форму имперфекта. Переведите со словарём. Трансформируйте текст используя местоимения <span>jас</span>,
        <span>ние</span>, <span>тие</span>.
        
        (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span>"Деjан", "jас", "ние", "тие"</span>. В центре
        показано текущее местоимение.)`,
      ],
      answerSet: {
        labels: ["Деjан", "jас", "ние", "тие"],
      },
      content: {
        sentences: [
          {
            mkd: `Минта*тата го*дина Де*jан че*сто ___ (па*тува) од О*хрид за Ско*пjе.`,
            answer: [`патуваше/патував/патувавме/патуваа`],
          },
          {
            mkd: `На*jчесто ___ (О*ди) со воз.`,
            answer: [`одеше/одев/одевме/одеа`],
          },
          {
            mkd: `О*днапред ___ (би*ра) ме*сто и ва*гон пре*ку и*нтернет, ги ___ (внесу*ва) подато*ците од па*сошот, ___ (пла*ќа) со ка*ртичка
            и ___ (зачу*вува) електро*нски би*лет на телефо*н.`,
            answer: [
              `бираше/бирав/биравме/бираа`,
              `внесуваше/внесував/внесувавме/внесуваа`,
              `плаќаше/плаќав/плаќавме/плаќаа`,
              `зачувуваше/зачував/зачувавме/зачуваа`,
            ],
          },
          {
            mkd: `Со* себе ___ (зе*ма) са*мо до*лна о*блека, тре*невки, ко*стим, ко*шула, врато*вска, ла*птоп, че*тка и па*ста за за*би.`,
            answer: [`земаше/земав/земавме/земаа`],
          },
          {
            mkd: `За Ско*пjе од О*хрид ___ (тр*гнува) о*бично во де*сет на*вечер.`,
            answer: [`тргнуваше/тргнував/тргнувавме/тргнуваа`],
          },
          {
            mkd: `Пред вле*зот во во*зот ги ___ (пока*жува) па*сош и биле*тот на телефо*нот.`,
            answer: [`покажуваше/покажував/покажувавме/покажуваа`],
          },
          {
            mkd: `Во во*зот ___ (до*бива) посте*лнина од службе*никот и ве*днаш ___ (ле*гнува).`,
            answer: [
              `добиваше/добивав/добивавме/добиваа`,
              `легнуваше/легнував/легнувавме/легнуваа`,
            ],
          },
          {
            mkd: `На*утро ___ (ми*е) за*би, ___ (пи*е) ка*фе и ___ (обле*кува) ко*стим.`,
            answer: [
              `миеше/миев/миевме/миеа`,
              `пиеше/пиев/пиевме/пиеа`,
              `облекуваше/облекував/облекувавме/облекуваа`,
            ],
          },
          {
            mkd: `Во*зот во Ско*пjе о*бично ___ (сти*гнува) во шест на*утро.`,
            answer: [`стигнуваше/стигнував/стигнувавме/стигнуваа`],
          },
          {
            mkd: `Од железни*чката ста*ница ___ (о*ди) со та*кси до хо*телот.`,
            answer: [`одеше/одев/одевме/одеа`],
          },
          {
            mkd: `Та*му ___ (поjа*дува), ___ (прове*рува) слу*жбен меjл и ___ (се спре*ма) за сре*дби.`,
            answer: [
              `поjадуваше/поjадував/поjадувавме/поjадуваа`,
              `проверуваше/проверував/проверувавме/проверуваа`,
              `се спремаеше/се спремав/се спремавме/се спремаа`,
            ],
          },
        ],
      },
    },
  ],
};
