import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Продолжите предложения, следуя образцу.
        
        (Подсказка: используйте кнопки ниже, чтобы переключать режимы от больше к больше всего. В центре показано текущая величина.)`,
      ],

      answerSet: {
        labels: ["больше", "больше всего"],
      },
      content: {
        text: "<span>О*ваа ко*ла е мно*гу ска*па. — Та*а е по*скапа. — О*наа е на*jскапа.</span>",
        sentences: [
          {
            mkd: `1. О*воj воз е мно*гу бе*збеден. — ___.`,
            answer: [`Тоj е побезбеден./Оноj е најбезбеден.`],
          },
          {
            mkd: `2. О*воj би*лет е мно*гу е*втин. — ___.`,
            answer: [`Тоj е поевтин./Оноj е наjевтин.`],
          },
          {
            mkd: `3. О*ваа авто*буска ста*ница е мно*гу го*лема. — ___.`,
            answer: [`Таа е поголема./Онаа е наjголема.`],
          },
          {
            mkd: `4. О*вие у*слови се мно*гу ло*ши. — ___.`,
            answer: [`Тие се полоши./Оние е наjлоши.`],
          },
          {
            mkd: `5. О*воj ме*нувач е мно*гу у*добен. — ___.`,
            answer: [`Тоj е поудобен./Оноj е наjудобен.`],
          },
          {
            mkd: `6. О*воj USB-по*лнач е мно*гу до*бар. — ___.`,
            answer: [`Тоj е подобар./Оноj е наjдобар.`],
          },
          {
            mkd: `7. О*ва ре*зервно тр*кало е мно*гу ска*по. — ___.`,
            answer: [`Тоа е поскапо./Она е наjскапо.`],
          },
          {
            mkd: `8. О*ва во*зило е но*во. — ___.`,
            answer: [`Тоа е поново/Она е наjново.`],
          },
        ],
      },
    },
  ],
};
