import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `нео*пходен апара*т a) ___ ;`,
            answer: [`неопходниот апарат`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`неопходни апарати`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`неопходните апарати`],
          },
          {
            mkd: `ограни*чена бр*зина a) ___ ;`,
            answer: [`ограничената брзина`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`ограничени брзини`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`ограничените брзини`],
          },
          {
            mkd: `до*стапно во*зило a) ___ ;`,
            answer: [`достапното возило`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`достапни возила`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`достапните возила`],
          },
          {
            mkd: `де*сна вра*та a) ___ ;`,
            answer: [`десната врата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`десни врати`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`десните врати`],
          },
          {
            mkd: `ска*по го*риво a) ___ ;`,
            answer: [`скапото гориво`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`скапи горива`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`скапите горива`],
          },
          {
            mkd: `мо*е ко*мбе a) ___ ;`,
            answer: [`моето комбе`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мои комбиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`моите комбиња`],
          },
          {
            mkd: `го*лема ку*тиjа a) ___ ;`,
            answer: [`големата кутиjа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`големи кутии`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`големите кутии`],
          },
          {
            mkd: `бел леб a) ___ ;`,
            answer: [`белиот леб`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`бели лебови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`белите лебови`],
          },
          {
            mkd: `мла*до ли*це a) ___ ;`,
            answer: [`младото лице`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`млади лица`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`млидите лица`],
          },
          {
            mkd: `сигу*рносен триа*голник a) ___ ;`,
            answer: [`сигурниот триаголник`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`сигуносни триаголници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`сигуносните триаголници`],
          },
          {
            mkd: `во*здушна пе*рница a) ___ ;`,
            answer: [`воздушната перница`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`воздушни перници`],
          },
          {
            mkd: `в) ___ `,
            answer: [`воздушните перници`],
          },
        ],
      },
    },
  ],
};
