import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-6",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [
        `Переведите на македонский язык.
        
        (Обратите внимание: некоторые пледложения могут иметь более одного правильного ответа.)`,
      ],
      content: {
        original: `Когда я была маленькая, каждый год летом мы ездили на Чёрное море. Папа заранее покупал билеты на поезд и резервировал 
        двухместный номер с дополнительной кроватью для меня. Накануне поездки мама долго собирала чемоданы, а я ей помогала. В день
        поездки папа вызывал такси. Потом выходили и садились в такси. На вокзале мы находили наш вагон, паказывали наши документы и
        занимали наши места.
        
        Мне всегда очень нравилось путешествовать на поезде. Столько новых людей, интересных разговоров и красивых пейзажей за окном.
        
        Когда мы приезжали, мы брали такси и ехали в гостиницу. Там заселялись, быстро переодевались и сразу шли на пляж! Папа и я очень
        любим плавать, а мама боится воды. После пляжа мы возвращались а гостиницу, принимали душ, переодевались и шли обедать в какой-
        нибудь ресторан. После обеда я спала, а потом мы опять шли на море. Вечером мы гуляли по берегу и отдыхали.`,
        answer: [
          `Кога бев мала, секоjа година на лето одевме на Црно море. Татко ми однапред купуваше возни билети и резервираше двокреветна
          соба со дополнителен кревет за мене. На денот пред патувањето маjка ми долго пакуваше куфери, а jас ѝ помагав. На денот на
          патувањето татко ми викаше такси. Потоа излегувавме и се качувавме во такси. На железничката станица го наоѓавме нашиот вагон,
          ги покажувавме нашите документи и седнувавме на нашите места.
          Секогаш сакав да патувам со воз. Толку нови луѓе, интересни разговори и убави пеjзажи зад прозорецот!
          Кога доаѓавме, земавме такси и одевме во хотел. Таму се вселувавме, брзо се пресоблекувавме и веднаш одевме на плажа! Татко
          ми и jас многу сакаме да пливаме, а маjка ми се плаши од вода. По плажа се враќавме во хотелот, се туширавме, се пресоблекувавме
          и одевме да ручаме во некоj ресторан. По ручекот спиев, а потоа повторно одевме на плажа. Навечер шетавме по брегот на морето
          и (се) одморавме.`,
        ],
      },
    },
  ],
};
