import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `апара*т a) ___ ;`,
            answer: [`апаратот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`апарати`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`апаратите`],
          },
          {
            mkd: `бр*зина a) ___ ;`,
            answer: [`брзината`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`брзини`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`брзините`],
          },
          {
            mkd: `во*зило a) ___ ;`,
            answer: [`возилото`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`возила`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`возилата`],
          },
          {
            mkd: `вра*та a) ___ ;`,
            answer: [`вратата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`врати`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`вратите`],
          },
          {
            mkd: `го*риво a) ___ ;`,
            answer: [`горивото`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`горива`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`горивата`],
          },
          {
            mkd: `ко*мбе a) ___ ;`,
            answer: [`комбето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`комбиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`комбињата`],
          },
          {
            mkd: `ку*тиjа a) ___ ;`,
            answer: [`кутијата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`кутии`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`кутиите`],
          },
          {
            mkd: `леб a) ___ ;`,
            answer: [`лебот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`лебови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`лебовите`],
          },
          {
            mkd: `ли*це a) ___ ;`,
            answer: [`лицето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`лица`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`лицата`],
          },
          {
            mkd: `триа*голник a) ___ ;`,
            answer: [`триаголникот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`триаголници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`триаголниците`],
          },
          {
            mkd: `пе*рница a) ___ ;`,
            answer: [`перницата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`перници`],
          },
          {
            mkd: `в) ___ `,
            answer: [`перниците`],
          },
        ],
      },
    },
  ],
};
