import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения, следуя образцу.`],

      content: {
        text: "<span>Моj, се*стра, стар, ти, 2 го*дини. — Мо*jата се*стра е по*стара од те*бе 2 го*дини.</span>",
        sentences: [
          {
            mkd: `1. Не*гов, стан, е*втин, не*jзин, 1000 амери*кански до*лари. — ___.`,
            answer: [
              `Неговиот стан е поевтин од неjзиниот 1000 американски долари`,
            ],
          },
          {
            mkd: `2. О*ноj, слу*жбеник, ви*сок, ви*е, 3 сантиме*три. — ___.`,
            answer: [`Оноj службеник е повисок од вас 3 сантиметри`],
          },
          {
            mkd: `3. Наш, ко*ла, скап, ни*вен, 200 е*вра. — ___.`,
            answer: [`Нашата кола е поскапа од нивната 200 евра`],
          },
          {
            mkd: `4. О*воj, де*ца, мал, та*а, 1 го*дина. — ___.`,
            answer: [`Овие деца се помали од неа 1 година`],
          },
          {
            mkd: `5. Та*тко ми, ни*зок, jас, 2 сантиме*три. — ___.`,
            answer: [`Татко ми е понизок од мене 2 сантиметри`],
          },
          {
            mkd: `6. О*воj, бе*нзинска ста*ница, го*лем, о*ноj, 30 ква*дратни ме*три. — ___.`,
            answer: [
              `Оваа бензинска станица е поголема од онаа 30 квадратни метри`,
            ],
          },
        ],
      },
    },
  ],
};
