import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-6",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.
        
        (Подсказка: используйте кнопки ниже, чтобы переключать режимы выполнения задания а), б), в). В центре показано текущий режим.)`,
      ],
      answerSet: {
        labels: ["а)", "б)", "в)"],
      },
      content: {
        sentences: [
          {
            mkd: `апара*т ___ ,`,
            answer: [`апаратот/апарати/апаратите`],
          },
          {
            mkd: `бр*зина ___ ,`,
            answer: [`брзината/брзини/брзините`],
          },
          {
            mkd: `во*зило ___ ,`,
            answer: [`возилото/возила/возилата`],
          },
          {
            mkd: `вра*та ___ ,`,
            answer: [`вратата/врати/вратите`],
          },
          {
            mkd: `го*риво ___ ,`,
            answer: [`горивото/горива/горивата`],
          },
          {
            mkd: `ко*мбе ___ ,`,
            answer: [`комбето/комбиња/комбињата`],
          },
          {
            mkd: `ку*тиjа ___ ,`,
            answer: [`кутијата/кутии/кутиите`],
          },
          {
            mkd: `леб ___ ,`,
            answer: [`лебот/лебови/лебовите`],
          },
          {
            mkd: `ли*це ___ ,`,
            answer: [`лицето/лица/лицата`],
          },
          {
            mkd: `триа*голник ___ ,`,
            answer: [`триаголникот/триаголници/триаголниците`],
          },
          {
            mkd: `пе*рница ___ ,`,
            answer: [`перницата/перници/перниците`],
          },
        ],
      },
    },
  ],
};
