import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-5",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Мы не хотим ни пить ни есть. 2. Моя сестра умеет готовить не только тавче-гравче, но и турли-таву. 3. Мои сёстры умеют   
        готовить не только тавче-гравче, но и турли-таву. 4. Вам надо купить сыр, брынзу, а также сливочное масло. 5. Они хлеб не могут купить,
        не то что мясо. 6. Мы не знаем, придёт ли Иван к нам или нет. 7. Вы не знаете, открыт ли завтра этот музей?`,
        answer: [
          `1. Не сакаме ниту да пиеме, ниту да jадеме. 2. Сестра ми не знае да готви само тавче-гравче, туку и турли-тава. 3. Моите сестри не 
        знаат да готват тавче-гравче, туку турли-тава. 4. Треба да купите кашкавал, сирење, како и путер. 5. Леб не можат да купат, а камоли
        месо. 6. Не знаеме дали Иван ќе доjде каj нас или не. 7. Дали знаете, дали овоj музеj утре е отворен или не?`,
        ],
      },
    },
  ],
};
