import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>го</span>, <span>jа</span>, <span>ги</span> там, где нужно.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. За ве\u0301чера се\u0301когаш ___ пи\u0301jам мле\u0301ко.`,
            answer: [`го`],
          },
          {
            mkd: `2. Са\u0301кам да му ___ по\u0301дарам о\u0301воj те\u0301лефон.`,
            answer: [`го`],
          },
          {
            mkd: `3. У\u0301тре ќе ___ о\u0301дам на го\u0301сти каj мо\u0301ите приjа\u0301тели.`,
            answer: [``],
          },
          {
            mkd: `4. Ле\u0301карот ___ ле\u0301кува лу\u0301ѓе, а наста\u0301вникот ___ у\u0301чи де\u0301ца.`,
            answer: [`ги`, `ги`],
          },
          {
            mkd: `5. О\u0301воj на\u0301ставник ___ у\u0301чи ќе\u0301рка ми.`,
            answer: [`jа`],
          },
          {
            mkd: `6. Не е мо\u0301жно да ___ са\u0301каш си\u0301те лу\u0301ѓе.`,
            answer: [`ги`],
          },
          {
            mkd: `7. Внук ми ___ са\u0301ка си\u0301те.`,
            answer: [`ги`],
          },
          {
            mkd: `8. Де\u0301неска ___ ру\u0301чаме во це\u0301нтарот на гра\u0301дот.`,
            answer: [``],
          },
          {
            mkd: `9. За 2 де\u0301на ќе ___ се сре\u0301тнеме во Него\u0301тино.`,
            answer: [``],
          },
          {
            mkd: `10. Ма\u0301риjа и А\u0301цо ___ че\u0301каат е\u0301ден чо\u0301век.`,
            answer: [``],
          },
          {
            mkd: `11. Би\u0301љана и А\u0301ндреj ___ че\u0301каат Пе\u0301тре.`,
            answer: [`го`],
          },
          {
            mkd: `12. Би\u0301љана и А\u0301ндреj ___ че\u0301ка Пе\u0301тре.`,
            answer: [`ги`],
          },
          {
            mkd: `13. Ко\u0301го ___ че\u0301каш?`,
            answer: [`го`],
          },
          {
            mkd: `14. Са\u0301кам да ти ___ ра\u0301скажам се\u0301.`,
            answer: [``],
          },
          {
            mkd: `15. Ко\u0301jа пе\u0301jачка на\u0301jмногу ___ са\u0301кате?`,
            answer: [`jа`],
          },
          {
            mkd: `16. Зо\u0301што не ___ са\u0301каш студе\u0301нтите од вто\u0301рата гру\u0301па?`,
            answer: [`ги`],
          },
          {
            mkd: `17. Да\u0301 во о\u0301ваа прода\u0301вница ___ и\u0301ма о\u0301ва цр\u0301вено ви\u0301но?`,
            answer: [`го`],
          },
          {
            mkd: `18. Ка\u0301кво ___ ви\u0301но са\u0301каш? — Са\u0301кам розе\u0301.`,
            answer: [``],
          },
        ],
      },
    },
  ],
};
