import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `италиjа\u0301нски авио\u0301н a) ___ ;`,
            answer: [`италиjанскиот авион`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`италиjански авиони`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`италиjанските авиони`],
          },
          {
            mkd: `си\u0301лна але\u0301ргиjа a) ___ ;`,
            answer: [`силната алергиjа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`силни алергии`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`силните алергии`],
          },
          {
            mkd: `стар ан a) ___ ;`,
            answer: [`стариот ан`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`стари анови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`старите анови`],
          },
          {
            mkd: `не\u0301гова ви\u0301љушка a) ___ ;`,
            answer: [`неговата виљушка`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`негови виљушки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`неговите виљушки`],
          },
          {
            mkd: `тво\u0301jа глу\u0301пост a) ___ ;`,
            answer: [`твоjата глупост`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`твои глупости`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`твоите глупости`],
          },
          {
            mkd: `ви\u0301сок го\u0301сподин a) ___ ;`,
            answer: [`високиот господин`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`високи господа`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`високите господа`],
          },
          {
            mkd: `у\u0301бава го\u0301споѓа a) ___ ;`,
            answer: [`убавата госпоѓа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`убави госпоѓи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`убавите госпоѓи`],
          },
          {
            mkd: `моj и\u0301злез a) ___ ;`,
            answer: [`моjот излез`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мои излези`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`моите излези`],
          },
          {
            mkd: `бла\u0301го jа\u0301болко a) ___ ;`,
            answer: [`благото jаболко`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`благи jаболка`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`благите jаболка`],
          },
          {
            mkd: `вку\u0301сно jа\u0301дење a) ___ ;`,
            answer: [`вкусното jадење`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`вкусни jадења`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`вкусните jадења`],
          },
          {
            mkd: `наш jа\u0301зик a) ___ ;`,
            answer: [`нашиот jазик`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`наши jазици`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`нашите jазици`],
          },
          {
            mkd: `чист кат a) ___ ;`,
            answer: [`чистиот кат`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`чисти катови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`чистите катови`],
          },
          {
            mkd: `шпа\u0301нско ка\u0301фуле a) ___ ;`,
            answer: [`шпанското кафуле`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`шпански кафулиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`шпанските кафулиња`],
          },
          {
            mkd: `ни\u0301вен клуч a) ___ ;`,
            answer: [`нивниот клуч`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`нивни клучеви`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`нивните клучеви`],
          },
          {
            mkd: `за\u0301морен лет a) ___ ;`,
            answer: [`заморниот лет`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`заморни летови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`заморните летовите`],
          },
          {
            mkd: `у\u0301морен маж a) ___ ;`,
            answer: [`уморениот маж`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`уморени мажи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`уморените мажи`],
          },
          {
            mkd: `де\u0301сна ма\u0301са a) ___ ;`,
            answer: [`десната маса`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`десни маси`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`десните маси`],
          },
          {
            mkd: `но\u0301во мени\u0301 a) ___ ;`,
            answer: [`новото мени`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`нови мениjа`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`новите мениjа`],
          },
          {
            mkd: `сло\u0301бодно ме\u0301сто a) ___ ;`,
            answer: [`слободното место`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`слободни места`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`слободните места`],
          },
          {
            mkd: `а\u0301нтички мост a) ___ ;`,
            answer: [`античкиот мост`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`антички мостови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`античките мостови`],
          },
          {
            mkd: `ге\u0301рмански музе\u0301j a) ___ ;`,
            answer: [`германскиот музеj`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`германски музеи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`германските музеи`],
          },
          {
            mkd: `ма\u0301ло па\u0301рче a) ___ ;`,
            answer: [`малото парче`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мали парчиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`малите парчиња`],
          },
          {
            mkd: `до\u0301бар па\u0301тник a) ___ ;`,
            answer: [`добриот патник`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`добри патници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`добрите патници`],
          },
          {
            mkd: `го\u0301рко пи\u0301во a) ___ ;`,
            answer: [`горкото пиво`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`горки пива`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`горките пива`],
          },
          {
            mkd: `лу\u0301та пи\u0301перка a) ___ ;`,
            answer: [`лутата пиперка`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`лути пиперки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`лутите пиперки`],
          },
          {
            mkd: `со\u0301лено предjа\u0301дење a) ___ ;`,
            answer: [`соленото предjадење`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`солени предjадења`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`солените предjадења`],
          },
          {
            mkd: `у\u0301нгарско пре\u0301зиме a) ___ ;`,
            answer: [`унгарското презиме`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`унгарски презимиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`унгарските презимиња`],
          },
          {
            mkd: `не\u0301jзина резерва\u0301циjа a) ___ ;`,
            answer: [`неjзината резервациjа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`неjзини резервации`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`неjзините резервации`],
          },
          {
            mkd: `стар Ру\u0301син a) ___ ;`,
            answer: [`стариот Русин`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`стари Руси`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`старите Руси`],
          },
          {
            mkd: `не\u0301познат слу\u0301жбеник a) ___ ;`,
            answer: [`непознатиот службеник`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`непознати службеници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`непознатите службеници`],
          },
          {
            mkd: `го\u0301лема сме\u0301тка a) ___ ;`,
            answer: [`големата сметка`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`големи сметки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`големите сметки`],
          },
          {
            mkd: `еднокре\u0301ветна со\u0301ба a) ___ ;`,
            answer: [`еднокреветната соба`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`еднокреветни соби`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`еднокреветните соби`],
          },
          {
            mkd: `ки\u0301сел сос a) ___ ;`,
            answer: [`киселиот сос`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`кисели сосови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`киселите сосови`],
          },
          {
            mkd: `желе\u0301зничка ста\u0301ница a) ___ ;`,
            answer: [`железничката станица`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`железнички станици`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`железничките станици`],
          },
          {
            mkd: `твоj таксиме\u0301тар a) ___ ;`,
            answer: [`твоjот таксиметар`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`твои таксиметри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`твоите таксиметри`],
          },
          {
            mkd: `о\u0301творен це\u0301тар a) ___ ;`,
            answer: [`отворениот центар`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`отворени центри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`отворените центри`],
          },
        ],
      },
    },
  ],
};
