import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте предлоги <span>до</span>, <span>зад</span>, <span>кон</span>, <span>на\u0301месо</span>, <span>на</span>, <span>низ</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. Ќе о\u0301дите пра\u0301во. Ко\u0301га ќе ви\u0301дите е\u0301дна ма\u0301ла ста\u0301ра цр\u0301ква ќе
            свр\u0301тите ___ не\u0301а. Од ле\u0301вата стра\u0301на ќе би\u0301де на\u0301шата ку\u0301ќа.`,
            answer: [`кон`],
          },
          {
            mkd: `2. Кра\u0301децот вле\u0301зе ___ про\u0301зорот.`,
            answer: [`низ`],
          },
          {
            mkd: `3. Во а\u0301вион се\u0301когаш се\u0301дам ___ и\u0301злезот.`,
            answer: [`до`],
          },
          {
            mkd: `4. Да\u0301ли мо\u0301же ___ во jу\u0301ни да о\u0301диме за О\u0301хрид во jу\u0301ли? Во jу\u0301ни ќе и\u0301мам
            мно\u0301гу ра\u0301бота.`,
            answer: [`наместо`],
          },
          {
            mkd: `5. И\u0301мам чу\u0301вство де\u0301ка не\u0301коj сто\u0301и ___ ме\u0301не, но ко\u0301га се вр\u0301там ни\u0301кого не
            гле\u0301дам.`,
            answer: [`зад`],
          },
          {
            mkd: `6. Чи\u0301и се докуме\u0301нтите? — То\u0301а се докуме\u0301нтите ___ мо\u0301ите роди\u0301тели.`,
            answer: [`на`],
          },
        ],
      },
    },
  ],
};
