import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-5",
  sections: [
    {
      type: "highlight-word-exercise",
      prompt: [
        `Прочитайте текст, переведите со словарём. Неопределенные прямые объкты выделите «поужирным» и определённые <em>курсивом</em>.
        
        (Подсказка: клик по слову меняет его стиль с обычного до «полужирного»/<em>курсивного</em>.)
        `,
      ],
      content: {
        original: `<span>Ве\u0301черва че\u0301каме го\u0301сти. Же\u0301на ми цел ден го\u0301тви. Пр\u0301во пра\u0301ви по\u0301лнети
        пи\u0301перки со ме\u0301лено сви\u0301нско ме\u0301со и по\u0301сни са\u0301рми со о\u0301риз. По\u0301тоа пе\u0301че ко\u0301мпери,
        пи\u0301ти со спа\u0301наќ, се\u0301че до\u0301мати, краста\u0301вици и кро\u0301мит за шо\u0301пска са\u0301лата и ре\u0301нда
        си\u0301рење. Про\u0301бува и до\u0301дава сол, би\u0301бер, зе\u0301jтин и ма\u0301лку о\u0301цет. Jас о\u0301дам во
        прода\u0301вница и ку\u0301пувам су\u0301во и бла\u0301го ви\u0301но, две ши\u0301шиња бе\u0301ло и два ши\u0301шиња цр\u0301вено,
        со\u0301кови, во\u0301да и чаj. Ни\u0301е пи\u0301еме чаj са\u0301мо ко\u0301га боледу\u0301ваме, но де\u0301неска и\u0301маме
        го\u0301сти од По\u0301лска. Ти\u0301е пи\u0301jат мно\u0301гу чаj. Се вра\u0301ќам до\u0301ма и jа серви\u0301раме ма\u0301сата.
        Ста\u0301ваме е\u0301ден у\u0301бав син ча\u0301ршав, чи\u0301нии, ча\u0301ши, са\u0301лфети и при\u0301бори jа\u0301дење — по
        е\u0301дна ла\u0301жица, ви\u0301љушка и нож. За да jа укра\u0301симе трпе\u0301зата, ста\u0301ваме ва\u0301за со све\u0301ќиња.
        Се е подго\u0301твено.</span>`,
        answer: [
          `Ве\u0301черва че\u0301каме «го\u0301сти». Же\u0301на ми цел ден го\u0301тви. Пр\u0301во пра\u0301ви «по\u0301лнети
        пи\u0301перки» со ме\u0301лено сви\u0301нско ме\u0301со и по\u0301сни «са\u0301рми» со «о\u0301риз». По\u0301тоа пе\u0301че «ко\u0301мпери»,
        «пи\u0301ти» со спа\u0301наќ, се\u0301че «до\u0301мати», «краста\u0301вици» и «кро\u0301мит» за шо\u0301пска са\u0301лата и ре\u0301нда
        «си\u0301рење». Про\u0301бува и до\u0301дава «сол», «би\u0301бер», «зе\u0301jтин» и ма\u0301лку «о\u0301цет». Jас о\u0301дам во
        прода\u0301вница и ку\u0301пувам су\u0301во и бла\u0301го «ви\u0301но», две ши\u0301шиња бе\u0301ло и два ши\u0301шиња цр\u0301вено,
        «со\u0301кови», «во\u0301да» и «чаj». Ни\u0301е пи\u0301еме «чаj» са\u0301мо ко\u0301га боледу\u0301ваме, но де\u0301неска и\u0301маме
        «го\u0301сти» од По\u0301лска. Ти\u0301е пи\u0301jат мно\u0301гу «чаj». Се вра\u0301ќам до\u0301ма и jа серви\u0301раме <em>ма\u0301сата</em>.
        Ста\u0301ваме е\u0301ден у\u0301бав «син» ча\u0301ршав, «чи\u0301нии», «ча\u0301ши», «са\u0301лфети» и «при\u0301бори» jа\u0301дење — по
        е\u0301дна «ла\u0301жица», «ви\u0301љушка» и «нож». За да jа укра\u0301симе <em>трпезата</em>, ста\u0301ваме «ва\u0301за» со «све\u0301ќиња».
        Се е подго\u0301твено.
        `,
        ],
      },
    },
  ],
};
