import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `италиjа*нски авио*н a) ___ ;`,
            answer: [`италиjанскиот авион`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`италиjански авиони`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`италиjанските авиони`],
          },
          {
            mkd: `си*лна але*ргиjа a) ___ ;`,
            answer: [`силната алергиjа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`силни алергии`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`силните алергии`],
          },
          {
            mkd: `стар ан a) ___ ;`,
            answer: [`стариот ан`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`стари анови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`старите анови`],
          },
          {
            mkd: `не*гова ви*љушка a) ___ ;`,
            answer: [`неговата виљушка`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`негови виљушки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`неговите виљушки`],
          },
          {
            mkd: `тво*jа глу*пост a) ___ ;`,
            answer: [`твоjата глупост`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`твои глупости`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`твоите глупости`],
          },
          {
            mkd: `ви*сок го*сподин a) ___ ;`,
            answer: [`високиот господин`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`високи господа`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`високите господа`],
          },
          {
            mkd: `у*бава го*споѓа a) ___ ;`,
            answer: [`убавата госпоѓа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`убави госпоѓи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`убавите госпоѓи`],
          },
          {
            mkd: `моj и*злез a) ___ ;`,
            answer: [`моjот излез`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мои излези`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`моите излези`],
          },
          {
            mkd: `бла*го jа*болко a) ___ ;`,
            answer: [`благото jаболко`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`благи jаболка`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`благите jаболка`],
          },
          {
            mkd: `вку*сно jа*дење a) ___ ;`,
            answer: [`вкусното jадење`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`вкусни jадења`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`вкусните jадења`],
          },
          {
            mkd: `наш jа*зик a) ___ ;`,
            answer: [`нашиот jазик`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`наши jазици`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`нашите jазици`],
          },
          {
            mkd: `чист кат a) ___ ;`,
            answer: [`чистиот кат`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`чисти катови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`чистите катови`],
          },
          {
            mkd: `шпа*нско ка*фуле a) ___ ;`,
            answer: [`шпанското кафуле`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`шпански кафулиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`шпанските кафулиња`],
          },
          {
            mkd: `ни*вен клуч a) ___ ;`,
            answer: [`нивниот клуч`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`нивни клучеви`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`нивните клучеви`],
          },
          {
            mkd: `за*морен лет a) ___ ;`,
            answer: [`заморниот лет`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`заморни летови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`заморните летовите`],
          },
          {
            mkd: `у*морен маж a) ___ ;`,
            answer: [`уморениот маж`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`уморени мажи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`уморените мажи`],
          },
          {
            mkd: `де*сна ма*са a) ___ ;`,
            answer: [`десната маса`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`десни маси`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`десните маси`],
          },
          {
            mkd: `но*во мени* a) ___ ;`,
            answer: [`новото мени`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`нови мениjа`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`новите мениjа`],
          },
          {
            mkd: `сло*бодно ме*сто a) ___ ;`,
            answer: [`слободното место`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`слободни места`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`слободните места`],
          },
          {
            mkd: `а*нтички мост a) ___ ;`,
            answer: [`античкиот мост`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`антички мостови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`античките мостови`],
          },
          {
            mkd: `ге*рмански музе*j a) ___ ;`,
            answer: [`германскиот музеj`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`германски музеи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`германските музеи`],
          },
          {
            mkd: `ма*ло па*рче a) ___ ;`,
            answer: [`малото парче`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мали парчиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`малите парчиња`],
          },
          {
            mkd: `до*бар па*тник a) ___ ;`,
            answer: [`добриот патник`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`добри патници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`добрите патници`],
          },
          {
            mkd: `го*рко пи*во a) ___ ;`,
            answer: [`горкото пиво`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`горки пива`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`горките пива`],
          },
          {
            mkd: `лу*та пи*перка a) ___ ;`,
            answer: [`лутата пиперка`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`лути пиперки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`лутите пиперки`],
          },
          {
            mkd: `со*лено предjа*дење a) ___ ;`,
            answer: [`соленото предjадење`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`солени предjадења`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`солените предjадења`],
          },
          {
            mkd: `у*нгарско пре*зиме a) ___ ;`,
            answer: [`унгарското презиме`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`унгарски презимиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`унгарските презимиња`],
          },
          {
            mkd: `не*jзина резерва*циjа a) ___ ;`,
            answer: [`неjзината резервациjа`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`неjзини резервации`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`неjзините резервации`],
          },
          {
            mkd: `стар Ру*син a) ___ ;`,
            answer: [`стариот Русин`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`стари Руси`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`старите Руси`],
          },
          {
            mkd: `не*познат слу*жбеник a) ___ ;`,
            answer: [`непознатиот службеник`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`непознати службеници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`непознатите службеници`],
          },
          {
            mkd: `го*лема сме*тка a) ___ ;`,
            answer: [`големата сметка`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`големи сметки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`големите сметки`],
          },
          {
            mkd: `еднокре*ветна со*ба a) ___ ;`,
            answer: [`еднокреветната соба`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`еднокреветни соби`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`еднокреветните соби`],
          },
          {
            mkd: `ки*сел сос a) ___ ;`,
            answer: [`киселиот сос`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`кисели сосови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`киселите сосови`],
          },
          {
            mkd: `желе*зничка ста*ница a) ___ ;`,
            answer: [`железничката станица`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`железнички станици`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`железничките станици`],
          },
          {
            mkd: `твоj таксиме*тар a) ___ ;`,
            answer: [`твоjот таксиметар`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`твои таксиметри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`твоите таксиметри`],
          },
          {
            mkd: `о*творен це*тар a) ___ ;`,
            answer: [`отворениот центар`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`отворени центри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`отворените центри`],
          },
        ],
      },
    },
  ],
};
