import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте предлоги <span>до</span>, <span>зад</span>, <span>кон</span>, <span>на*месо</span>, <span>на</span>, <span>низ</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. Ќе о*дите пра*во. Ко*га ќе ви*дите е*дна ма*ла ста*ра цр*ква ќе
            свр*тите ___ не*а. Од ле*вата стра*на ќе би*де на*шата ку*ќа.`,
            answer: [`кон`],
          },
          {
            mkd: `2. Кра*децот вле*зе ___ про*зорот.`,
            answer: [`низ`],
          },
          {
            mkd: `3. Во а*вион се*когаш се*дам ___ и*злезот.`,
            answer: [`до`],
          },
          {
            mkd: `4. Да*ли мо*же ___ во jу*ни да о*диме за О*хрид во jу*ли? Во jу*ни ќе и*мам
            мно*гу ра*бота.`,
            answer: [`наместо`],
          },
          {
            mkd: `5. И*мам чу*вство де*ка не*коj сто*и ___ ме*не, но ко*га се вр*там ни*кого не
            гле*дам.`,
            answer: [`зад`],
          },
          {
            mkd: `6. Чи*и се докуме*нтите? — То*а се докуме*нтите ___ мо*ите роди*тели.`,
            answer: [`на`],
          },
        ],
      },
    },
  ],
};
