import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>го</span>, <span>jа</span>, <span>ги</span> там, где нужно.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. За ве\u0301чера се\u0301когаш ___ пи\u0301jам мле\u0301ко.`,
            answer: [`го`],
          },
          {
            mkd: `2. Са\u0301кам да му ___ по\u0301дарам о\u0301воj те\u0301лефон.`,
            answer: [`го`],
          },
          {
            mkd: `3. У\u0301тре ќе ___ о\u0301дам на го\u0301сти каj мо\u0301ите приjа\u0301тели.`,
            answer: [`ме`],
          },
          {
            mkd: `4. Ле\u0301карот ___ ле\u0301кува лу\u0301ѓе, а наста\u0301вникот ___ у\u0301чи де\u0301ца.`,
            answer: [`ги`, `jа`],
          },
          {
            mkd: `5. Зо\u0301што не ___ (ни\u0301е) че\u0301каш?`,
            answer: [`не`],
          },
          {
            mkd: `6. Че\u0301сто ___ (та\u0301а) ку\u0301пуваш?`,
            answer: [`jа`],
          },
          {
            mkd: `7. Са\u0301кам да ___ (ти) пра\u0301шам.`,
            answer: [`те`],
          },
          {
            mkd: `8. Мно\u0301гу са\u0301каат да ___ (вие) запо\u0301знаат?`,
            answer: [`ве`],
          },
          {
            mkd: `9. ___ (то\u0301j) ко\u0301ристам ко\u0301га па\u0301тувам.`,
            answer: [`Го`],
          },
          {
            mkd: `10. ___ (ти\u0301е) прашу\u0301ваме за И\u0301стамбул.`,
            answer: [`Ги`],
          },
          {
            mkd: `11. Да\u0301ли ___ (jас) разби\u0301рате.`,
            answer: [`ме`],
          },
          {
            mkd: `12. Љу\u0301бица мно\u0301гу ___ (се\u0301бе) са\u0301ка.`,
            answer: [`се`],
          },
          {
            mkd: `13. Зо\u0301што не ___ (ни\u0301е) че\u0301каш?`,
            answer: [`не`],
          },
          {
            mkd: `14. Че\u0301сто ___ (та\u0301а) ку\u0301пуваш?`,
            answer: [`jа`],
          },
          {
            mkd: `15. Са\u0301кам да ___ (ти) пра\u0301шам.`,
            answer: [`те`],
          },
          {
            mkd: `16. Мно\u0301гу са\u0301каат да ___ (вие) запо\u0301знаат?`,
            answer: [`ве`],
          },
          {
            mkd: `17. Са\u0301кам да ___ (ти) пра\u0301шам.`,
            answer: [`те`],
          },
          {
            mkd: `18. Мно\u0301гу са\u0301каат да ___ (вие) запо\u0301знаат?`,
            answer: [`ве`],
          },
        ],
      },
    },
  ],
};
