import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-5",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Мои друзья любят читать македонские книги. 2. Я не хочу читаль эти книги 3. Нам надо купить подарок для Дарко. Мы не 
        знаем, что ему подарить. 4. Ты знаешь, что завтра к нам приедут Деян и Зорица? Ты можешь показать им наш город и пообедать с ними?
        5. Мы ждём Драгана и Гоце. 6. Этот официант хорошо работает. (Нам) надо дать ему чаевые. 7. Мне нужно 100 денар. Мне нужно разменять
        500 денар по 100. 8. Это твоя сестра? Ирена может показать ей Скопье. — Я не хочу, чтобы Ирена показывала ей Скопье, потому что
        Ирена очень устала (Ирена очень уставшая). 9. Вы можете забронировать один столик для двоих? Мы придем около семи часов.
        10. Мои друзья советуют мне попробовать это белое сухое вино. Оно им очень нравиться. 11. Счёт, пожалуйста. 12. Мы ждём счёт уже
        пол часа. 13. Я хочу, что бы официант поменял эту вилку, потому что она грязная. 14. Что ты ешь? — Турли-таву. — Из чего готовиться
        это блюдо? — Из овощей и мяса. 15. У тебя есть брат? 16. У тебя есть эта книга? 17. В этой библиотеке много старых книг.
        18. Эти книги есть только в нашей библиотеке.`,
        answer: [
          `1. Моите приjатели сакаат да читаат македонски книги. 2. Не сакам да ги читам овие книги. Не ми се допаѓаат. 3. Треба да купиме
        подарок за Дарко. Не знаеме што да му подариме. 4. Дали знаеш дека утре каj нас ќе доjдат Деjан и Зорица? Дали можеш да им го
        покажеш нашиот град и да ручаш со нив? 5. Ги чекама Драган и Гоце. 6. Овоj келнер добро работи. Треба да му дадеме бакшиш.
        7. Ми требаат 100 денари. Треба да раситнам 500 денари по 100. 8. Тоа е сестра ти? Ирена може да ѝ покаже Скопjе. — Не сакам Ирена
        да ѝ го покажува Скопjе затоа што Ирена е уморена. 9. Дали можете да резервирате една маса за дваjца? Ќе доjеме околу седум часот.
        10. Моите приjатели ми препорачуваат да го пробам ова суво бело вино. Многу им се допаѓа. 11. Сметка, ве молам. 12. Чекаме сметка
        веќе половина час. 13. Сакам келнерот да jа смени оваа виљушка затоа шо е нечиста. 14. Што jадеш? — Турли-тава. — Од што се прави ова
        jадење? — Од зеленчук и месо. 15. Дали имаш брат? 16. Дали ја имаш оваа книга? 17. Во оваа библиотека има многу стари книги.
        18. Овие книги ги има само во нашата библиотека.`,
        ],
      },
    },
  ],
};
