import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>го</span>, <span>jа</span>, <span>ги</span> там, где нужно.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. За ве*чера се*когаш ___ пи*jам мле*ко.`,
            answer: [`го`],
          },
          {
            mkd: `2. Са*кам да му ___ по*дарам о*воj те*лефон.`,
            answer: [`го`],
          },
          {
            mkd: `3. У*тре ќе ___ о*дам на го*сти каj мо*ите приjа*тели.`,
            answer: [``], // не нужно
          },
          {
            mkd: `4. Ле*карот ___ ле*кува лу*ѓе, а наста*вникот ___ у*чи де*ца.`,
            answer: [`ги`, `ги`],
          },
          {
            mkd: `5. О*воj на*ставник ___ у*чи ќе*рка ми.`,
            answer: [`ја`],
          },
          {
            mkd: `6. Не е мо*жно да ___ са*каш си*те лу*ѓе.`,
            answer: [`ги`],
          },
          {
            mkd: `7. Внук ми ___ са*ка си*те.`,
            answer: [`ги`],
          },
          {
            mkd: `8. Де*неска ___ ру*чаме во це*нтарот на гра*дот.`,
            answer: [``], // не нужно
          },
          {
            mkd: `9. За 2 де*на ќе ___ се сре*тнеме во Него*тино.`,
            answer: [``], // не нужно
          },
          {
            mkd: `10. Ма*риjа и А*цо ___ че*каат е*ден чо*век.`,
            answer: [`го`],
          },
          {
            mkd: `11. Би*љана и А*ндреj ___ че*каат Пе*тре.`,
            answer: [`го`],
          },
          {
            mkd: `12. Би*љана и А*ндреj ___ че*ка Пе*тре.`,
            answer: [`ги`],
          },
          {
            mkd: `13. Ко*го ___ че*каш?`,
            answer: [`го`],
          },
          {
            mkd: `14. Са*кам да ти ___ ра*скажам се*.`,
            answer: [`го`],
          },
          {
            mkd: `15. Ко*jа пе*jачка на*jмногу ___ са*кате?`,
            answer: [`ја`],
          },
          {
            mkd: `16. Зо*што не ___ са*каш студе*нтите од вто*рата гру*па?`,
            answer: [`ги`],
          },
          {
            mkd: `17. Да* во о*ваа прода*вница ___ и*ма о*ва цр*вено ви*но?`,
            answer: [`го`],
          },
          {
            mkd: `18. Ка*кво ___ ви*но са*каш? — Са*кам розе*.`,
            answer: [``], // не нужно
          },
        ],
      },
    },
  ],
};
