import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.
        
        (Подсказка: используйте кнопки ниже, чтобы переключать режимы выполнения задания а), б), в). В центре показано текущий режим.)`,
      ],
      answerSet: {
        labels: ["а)", "б)", "в)"],
      },
      content: {
        sentences: [
          {
            mkd: `авио*н ___ ,`,
            answer: [`авионот/авиони/авионите`],
          },
          {
            mkd: `але*ргиjа ___ ,`,
            answer: [`алергиjата/алергии/алергиите`],
          },
          {
            mkd: `ан ___ ,`,
            answer: [`анот/анови/ановите`],
          },
          {
            mkd: `ви*љушка ___ ,`,
            answer: [`виљушката/виљушки/виљушките`],
          },
          {
            mkd: `глу*пост ___ ,`,
            answer: [`глупоста/глупости/глупостите`],
          },
          {
            mkd: `го*сподин ___ ,`,
            answer: [`господинот/господа/господата`],
          },
          {
            mkd: `го*споѓа ___ ,`,
            answer: [`госпоѓата/госпоѓи/госпоѓите`],
          },
          {
            mkd: `и*злез ___ ,`,
            answer: [`излезот/излези/излезите`],
          },
          {
            mkd: `jа*болко ___ ,`,
            answer: [`jаболкото/jаболка/jаболката`],
          },
          {
            mkd: `jа*дење ___ ,`,
            answer: [`jадењето/jадења/jадењата`],
          },
          {
            mkd: `jа*зик ___ ,`,
            answer: [`jазикот/jазици/jазиците`],
          },
          {
            mkd: `кат ___ ,`,
            answer: [`катот/катови/катовите`],
          },
          {
            mkd: `ка*фуле ___ ,`,
            answer: [`кафулето/кафулиња/кафулињата`],
          },
          {
            mkd: `кило*метар ___ ,`,
            answer: [`километарот/километри/километрите`],
          },
          {
            mkd: `клуч ___ ,`,
            answer: [`клучот/клучеви/клучевите`],
          },
          {
            mkd: `лет ___ ,`,
            answer: [`летот/летови/летовите`],
          },
          {
            mkd: `маж ___ ,`,
            answer: [`мажот/мажи/мажите`],
          },
          {
            mkd: `ма*са ___ ,`,
            answer: [`масата/маси/масите`],
          },
          {
            mkd: `мени* ___ ,`,
            answer: [`менито/мениjа/мениjата`],
          },
          {
            mkd: `ме*сто ___ ,`,
            answer: [`местото/места/местата`],
          },
          {
            mkd: `мост ___ ,`,
            answer: [`мостот/мостови/мостовите`],
          },
          {
            mkd: `музе*j ___ ,`,
            answer: [`музеjот/музеи/музеите`],
          },
          {
            mkd: `па*рче ___ ,`,
            answer: [`парчето/парчиња/парчињата`],
          },
          {
            mkd: `па*тник ___ ,`,
            answer: [`патникот/патници/патниците`],
          },
          {
            mkd: `пи*во ___ ,`,
            answer: [`пивото/пива/пивата`],
          },
          {
            mkd: `пи*перка ___ ,`,
            answer: [`пиперката/пиперки/пиперките`],
          },
          {
            mkd: `предjа*дење ___ ,`,
            answer: [`предjадењето/предjадења/предjадењата`],
          },
          {
            mkd: `пре*зиме ___ ,`,
            answer: [`презимето/презимиња/презимињата`],
          },
          {
            mkd: `резерва*циjа ___ ,`,
            answer: [`резервациjата/резервации/резервациите`],
          },
          {
            mkd: `Ру*син ___ ,`,
            answer: [`Русинот/Руси/Русите`],
          },
          {
            mkd: `слу*жбеник ___ ,`,
            answer: [`службеникот/службеници/службениците`],
          },
          {
            mkd: `сме*тка ___ ,`,
            answer: [`сметката/сметки/сметките`],
          },
          {
            mkd: `со*ба ___ ,`,
            answer: [`собата/соби/собите`],
          },
          {
            mkd: `сос ___ ,`,
            answer: [`сосот/сосови/сосовите`],
          },
          {
            mkd: `ста*ница ___ ,`,
            answer: [`станицата/станици/станиците`],
          },
          {
            mkd: `таксиме*тар ___ ,`,
            answer: [`таксиметарот/таксиметри/таксиметрите`],
          },
          {
            mkd: `це*тар ___ ,`,
            answer: [`центарот/центри/центрите`],
          },
          {
            mkd: `час ___ ,`,
            answer: [`часот/часови/часовите`],
          },
        ],
      },
    },
  ],
};
