import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.
        
        (Подсказка: используйте кнопки ниже, чтобы переключать режимы выполнения задания а), б), в). В центре показано текущий режим.)`,
      ],
      answerSet: {
        labels: ["а)", "б)", "в)"],
      },
      content: {
        sentences: [
          {
            mkd: `италиjа*нски авио*н  ___ ,`,
            answer: [
              `италиjанскиот авион/италиjански авиони/италиjанските авиони`,
            ],
          },
          {
            mkd: `си*лна але*ргиjа  ___ ,`,
            answer: [`силната алергиjа/силни алергии/силните алергии`],
          },
          {
            mkd: `стар ан  ___ ,`,
            answer: [`стариот ан/стари анови/старите анови`],
          },
          {
            mkd: `не*гова ви*љушка ___ ,`,
            answer: [`неговата виљушка/негови виљушки/неговите виљушки`],
          },
          {
            mkd: `тво*jа глу*пост ___ ,`,
            answer: [`твоjата глупост/твои глупости/твоите глупости`],
          },
          {
            mkd: `ви*сок го*сподин ___ ,`,
            answer: [`високиот господин/високи господа/високите господа`],
          },
          {
            mkd: `у*бава го*споѓа ___ ,`,
            answer: [`убавата госпоѓа/убави госпоѓи/убавите госпоѓи`],
          },
          {
            mkd: `моj и*злез ___ ,`,
            answer: [`моjот излез/мои излези/моите излези`],
          },
          {
            mkd: `бла*го jа*болко ___ ,`,
            answer: [`благото jаболко/благи jаболка/благите jаболка`],
          },
          {
            mkd: `вку*сно jа*дење ___ ,`,
            answer: [`вкусното jадење/вкусни jадења/вкусните jадења`],
          },
          {
            mkd: `наш jа*зик ___ ,`,
            answer: [`нашиот jазик/наши jазици/нашите jазици`],
          },
          {
            mkd: `чист кат ___ ,`,
            answer: [`чистиот кат/чисти катови/чистите катови`],
          },
          {
            mkd: `шпа*нско ка*фуле ___ ,`,
            answer: [`шпанското кафуле/шпански кафулиња/шпанските кафулиња`],
          },
          {
            mkd: `ни*вен клуч ___ ,`,
            answer: [`нивниот клуч/нивни клучеви/нивните клучеви`],
          },
          {
            mkd: `за*морен лет ___ ,`,
            answer: [`заморниот лет/заморни летови/заморните летовите`],
          },
          {
            mkd: `у*морен маж ___ ,`,
            answer: [`уморениот маж/уморени мажи/уморените мажи`],
          },
          {
            mkd: `де*сна ма*са ___ ,`,
            answer: [`десната маса/десни маси/десните маси`],
          },
          {
            mkd: `но*во мени* ___ ,`,
            answer: [`новото мени/нови мениjа/новите мениjа`],
          },
          {
            mkd: `сло*бодно ме*сто ___ ,`,
            answer: [`слободното место/слободни места/слободните места`],
          },
          {
            mkd: `а*нтички мост ___ ,`,
            answer: [`античкиот мост/антички мостови/античките мостови`],
          },
          {
            mkd: `ге*рмански музе*j ___ ,`,
            answer: [`германскиот музеj/германски музеи/германските музеи`],
          },
          {
            mkd: `ма*ло па*рче ___ ,`,
            answer: [`малото парче/мали парчиња/малите парчиња`],
          },
          {
            mkd: `до*бар па*тник ___ ,`,
            answer: [`добриот патник/добри патници/добрите патници`],
          },
          {
            mkd: `го*рко пи*во ___ ,`,
            answer: [`горкото пиво/горки пива/горките пива`],
          },
          {
            mkd: `лу*та пи*перка ___ ,`,
            answer: [`лутата пиперка/лути пиперки/лутите пиперки`],
          },
          {
            mkd: `со*лено предjа*дење ___ ,`,
            answer: [
              `соленото предjадење/солени предjадења/солените предjадења`,
            ],
          },
          {
            mkd: `у*нгарско пре*зиме ___ ,`,
            answer: [
              `унгарското презиме/унгарски презимиња/унгарските презимиња`,
            ],
          },
          {
            mkd: `не*jзина резерва*циjа ___ ,`,
            answer: [
              `неjзината резервациjа/неjзини резервации/неjзините резервации`,
            ],
          },
          {
            mkd: `стар Ру*син ___ ,`,
            answer: [`стариот Русин/стари Руси/старите Руси`],
          },
          {
            mkd: `не*познат слу*жбеник ___ ,`,
            answer: [
              `непознатиот службеник/непознати службеници/непознатите службеници`,
            ],
          },
          {
            mkd: `го*лема сме*тка ___ ,`,
            answer: [`големата сметка/големи сметки/големите сметки`],
          },
          {
            mkd: `еднокре*ветна со*ба ___ ,`,
            answer: [
              `еднокреветната соба/еднокреветни соби/еднокреветните соби`,
            ],
          },
          {
            mkd: `ки*сел сос ___ ,`,
            answer: [`киселиот сос/кисели сосови/киселите сосови`],
          },
          {
            mkd: `желе*зничка ста*ница ___ ,`,
            answer: [
              `железничката станица/железнички станици/железничките станици`,
            ],
          },
          {
            mkd: `твоj таксиме*тар ___ ,`,
            answer: [`твоjот таксиметар/твои таксиметри/твоите таксиметри`],
          },
          {
            mkd: `о*творен це*тар ___ ,`,
            answer: [`отворениот центар/отворени центри/отворените центри`],
          },
        ],
      },
    },
  ],
};
