import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-5",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `авио\u0301н a) ___ ;`,
            answer: [`авионот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`авиони`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`авионите`],
          },
          {
            mkd: `але\u0301ргиjа a) ___ ;`,
            answer: [`алергиjата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`алергии`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`алергиите`],
          },
          {
            mkd: `ан a) ___ ;`,
            answer: [`анот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`анови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`ановите`],
          },
          {
            mkd: `ви\u0301љушка a) ___ ;`,
            answer: [`виљушката`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`виљушки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`виљушките`],
          },
          {
            mkd: `глу\u0301пост a) ___ ;`,
            answer: [`глупоста`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`глупости`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`глупостите`],
          },
          {
            mkd: `го\u0301сподин a) ___ ;`,
            answer: [`господинот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`господа`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`господата`],
          },
          {
            mkd: `го\u0301споѓа a) ___ ;`,
            answer: [`госпоѓата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`госпоѓи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`госпоѓите`],
          },
          {
            mkd: `и\u0301злез a) ___ ;`,
            answer: [`излезот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`излези`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`излезите`],
          },
          {
            mkd: `jа\u0301болко a) ___ ;`,
            answer: [`jаболкото`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`jаболка`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`jаболката`],
          },
          {
            mkd: `jа\u0301дење a) ___ ;`,
            answer: [`jадењето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`jадења`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`jадењата`],
          },
          {
            mkd: `jа\u0301зик a) ___ ;`,
            answer: [`jазикот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`jазици`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`jазиците`],
          },
          {
            mkd: `кат a) ___ ;`,
            answer: [`катот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`катови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`катовите`],
          },
          {
            mkd: `ка\u0301фуле a) ___ ;`,
            answer: [`кафулето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`кафулиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`кафулињата`],
          },
          {
            mkd: `кило\u0301метар a) ___ ;`,
            answer: [`километарот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`километри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`километрите`],
          },
          {
            mkd: `клуч a) ___ ;`,
            answer: [`клучот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`клучеви`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`клучевите`],
          },
          {
            mkd: `лет a) ___ ;`,
            answer: [`летот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`летови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`летовите`],
          },
          {
            mkd: `маж a) ___ ;`,
            answer: [`мажот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мажи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`мажите`],
          },
          {
            mkd: `ма\u0301са a) ___ ;`,
            answer: [`масата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`маси`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`масите`],
          },
          {
            mkd: `мени\u0301 a) ___ ;`,
            answer: [`менито`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мениjа`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`мениjата`],
          },
          {
            mkd: `ме\u0301сто a) ___ ;`,
            answer: [`местото`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`места`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`местата`],
          },
          {
            mkd: `мост a) ___ ;`,
            answer: [`мостот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`мостови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`мостовите`],
          },
          {
            mkd: `музе\u0301j a) ___ ;`,
            answer: [`музеjот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`музеи`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`музеите`],
          },
          {
            mkd: `па\u0301рче a) ___ ;`,
            answer: [`парчето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`парчиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`парчињата`],
          },
          {
            mkd: `па\u0301тник a) ___ ;`,
            answer: [`патникот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`патници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`патниците`],
          },
          {
            mkd: `пи\u0301во a) ___ ;`,
            answer: [`пивото`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`пива`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`пивата`],
          },
          {
            mkd: `пи\u0301перка a) ___ ;`,
            answer: [`пиперката`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`пиперки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`пиперките`],
          },
          {
            mkd: `предjа\u0301дење a) ___ ;`,
            answer: [`предjадењето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`предjадења`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`предjадењата`],
          },
          {
            mkd: `пре\u0301зиме a) ___ ;`,
            answer: [`презимето`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`презимиња`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`презимињата`],
          },
          {
            mkd: `резерва\u0301циjа a) ___ ;`,
            answer: [`резервациjата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`резервации`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`резервациите`],
          },
          {
            mkd: `Ру\u0301син a) ___ ;`,
            answer: [`Русинот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`Руси`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`Русите`],
          },
          {
            mkd: `слу\u0301жбеник a) ___ ;`,
            answer: [`службеникот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`службеници`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`службениците`],
          },
          {
            mkd: `сме\u0301тка a) ___ ;`,
            answer: [`сметката`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`сметки`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`сметките`],
          },
          {
            mkd: `со\u0301ба a) ___ ;`,
            answer: [`собата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`соби`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`собите`],
          },
          {
            mkd: `сос a) ___ ;`,
            answer: [`сосот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`сосови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`сосовите`],
          },
          {
            mkd: `ста\u0301ница a) ___ ;`,
            answer: [`станицата`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`станици`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`станиците`],
          },
          {
            mkd: `таксиме\u0301тар a) ___ ;`,
            answer: [`таксиметарот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`таксиметри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`таксиметрите`],
          },
          {
            mkd: `це\u0301тар a) ___ ;`,
            answer: [`центарот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`центри`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`центрите`],
          },
          {
            mkd: `час a) ___ ;`,
            answer: [`часот`],
          },
          {
            mkd: `б) ___ ;`,
            answer: [`часови`],
          },
          {
            mkd: `в) ___ ,`,
            answer: [`часовите`],
          },
        ],
      },
    },
  ],
};
