import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-5",
  sections: [
    {
      type: "highlight-word-exercise",
      prompt: [
        `Прочитайте текст, переведите со словарём. Неопределенные прямые объкты выделите «полужирным» и определённые <em>курсивом</em>.
        
        (Подсказка: клик по слову меняет его стиль с обычного до «полужирного», следующий клик до <em>курсивного</em>.)
        `,
      ],
      content: {
        original: `<span>Ве*черва че*каме го*сти. Же*на ми цел ден го*тви. Пр*во пра*ви по*лнети пи*перки со ме*лено сви*нско ме*со и
        по*сни са*рми со о*риз. По*тоа пе*че ко*мпери, пи*ти со спа*наќ, се*че до*мати, краста*вици и кро*мит за шо*пска са*лата и ре*нда
        си*рење. Про*бува и до*дава сол, би*бер, зе*jтин и ма*лку о*цет. Jас о*дам во прода*вница и ку*пувам су*во и бла*го ви*но, две
        ши*шиња бе*ло и два ши*шиња цр*вено, со*кови, во*да и чаj. Ни*е пи*еме чаj са*мо ко*га боледу*ваме, но де*неска и*маме го*сти од
        По*лска. Ти*е пи*jат мно*гу чаj. Се вра*ќам до*ма и jа серви*раме ма*сата. Ста*ваме е*ден у*бав син ча*ршав, чи*нии, ча*ши,
        са*лфети и при*бори jа*дење — по е*дна ла*жица, ви*љушка и нож. За да jа укра*симе трпе*зата, ста*ваме ва*за со све*ќиња.
        Се е подго*твено.</span>`,
        answer: [
          `Ве*черва че*каме «го*сти». Же*на ми цел ден го*тви. Пр*во пра*ви «по*лнети пи*перки» со ме*лено сви*нско ме*со и по*сни
          «са*рми» со «о*риз». По*тоа пе*че «ко*мпери», «пи*ти» со спа*наќ, се*че «до*мати», «краста*вици» и «кро*мит» за шо*пска са*лата
          и ре*нда «си*рење». Про*бува и до*дава «сол», «би*бер», «зе*jтин» и ма*лку «о*цет». Jас о*дам во прода*вница и ку*пувам су*во и
          бла*го «ви*но», две ши*шиња бе*ло и два ши*шиња цр*вено, «со*кови», «во*да» и «чаj». Ни*е пи*еме «чаj» са*мо ко*га боледу*ваме,
          но де*неска и*маме «го*сти» од По*лска. Ти*е пи*jат мно*гу «чаj». Се вра*ќам до*ма и jа серви*раме <em>ма*сата</em>. Ста*ваме
          е*ден у*бав «син» ча*ршав, «чи*нии», «ча*ши», «са*лфети» и «при*бори» jа*дење — по е*дна «ла*жица», «ви*љушка» и «нож». За да
          jа укра*симе <em>трпезата</em>, ста*ваме «ва*за» со «све*ќиња». Се е подго*твено.
        `,
        ],
      },
    },
  ],
};
