import { ParagraphSectionsProps } from "@/types";

export const indefinitePronouns: ParagraphSectionsProps = {
  type: "grammar-indefinite-pronouns",
  slug: "lesson-14",
  subtitle: "НЕОПРЕДЕЛЁННЫЕ МЕСТОИМЕНИЯ",
  content: {
    text: `Наиболее употребительными неопределёнными местоимениями являются: <span>не*коj</span> «некто, кто-то, кто-нибудь, кто-либо»,
    <span>не*што</span> «нечто, что-то, что-нибудь, что-либо», <span>не*коj</span> «некоторый, какой-то, какой-нибудь, какой-либо»,
    <span>не*каков</span> «какой-то, какой-нибудь, какой-либо», <span>не*како</span> «как-то, как-нибудь, как-либо», <span>не*каде</span>
    «где-то, где-нибудь, где-либо» и т.д. Кроме того, неопределённые местоимения образуются с элементами <span>би*ло</span>,
    <span>го*де</span>, <span>и да е</span>: <span>коj би*ло</span>, <span>коj-го*де</span>, <span>коj и да е</span>
    «кто-либо, любой, кто бы то ни было».
    
    В разговорной речи элемемт <span>би*ло</span> может стоять на первом месте, но норма предписывает второе: <span>коj би*ло</span>, а
    не <span>би*ло коj</span>.`,
  },
};
