import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-2",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "бр*oj",
            pron: "бро́й",
            ru: "номер",
          },
          {
            mkd: "ве*ќе",
            pron: "вэ́к'э",
            ru: "уже",
          },
          {
            mkd: "вле*гува",
            pron: "влэ́гува",
            ru: "входить",
          },
          {
            mkd: "во го*тово",
            pron: "во_го́тово",
            ru: "наличными",
          },
          {
            mkd: "град",
            pron: "грат",
            ru: "город",
          },
          {
            mkd: "двокре*ветна со*ба",
            pron: "двокрэ*вэтна_со*ба",
            ru: "двухмесный номер",
          },
          {
            mkd: "де*сно",
            pron: "дэ*сно",
            ru: "направо, справа",
          },
          {
            mkd: "до",
            pron: "до",
            ru: "до",
          },
          {
            mkd: "до*бар",
            pron: "до*бар",
            ru: "хороший",
          },
          {
            mkd: "до*бро",
            pron: "до*бро",
            ru: "хорошо",
          },
          {
            mkd: "е*вро",
            pron: "э*вро",
            ru: "евро",
          },
          {
            mkd: "еднокре*ветна со*ба",
            pron: "эднокре*ветна_со*ба",
            ru: "одномесный номер",
          },
          {
            mkd: "и*лjада",
            pron: "и*л'йада",
            ru: "тысяча",
          },
          {
            mkd: "иско*ристи",
            pron: "иско*ристи",
            ru: "использовать (сов. вид)",
          },
          {
            mkd: "за*морен",
            pron: "за*морэн",
            ru: "утомительный",
          },
          {
            mkd: "ка*де",
            pron: "ка*де",
            ru: "где, куда",
          },
          {
            mkd: "ка*ртичка",
            pron: "ка*ричка",
            ru: "карточка",
          },
          {
            mkd: "кат",
            pron: "кат",
            ru: "этаж",
          },
          {
            mkd: "клуч",
            pron: "клуч",
            ru: "ключ",
          },
          {
            mkd: "ко*лку",
            pron: "ко*лку",
            ru: "сколько, на сколько",
          },
          {
            mkd: "ко*ристи",
            pron: "ко*ристи",
            ru: "использовать (не сов. вид)",
          },
          {
            mkd: "ле*во",
            pron: "лэ*во",
            ru: "налево, слева",
          },
          {
            mkd: "моj",
            pron: "мой",
            ru: "мой",
          },
          {
            mkd: "мо*мент",
            pron: "мо*мэнт",
            ru: "момент, миг",
          },
          {
            mkd: "се на*оѓа",
            pron: "сэ_на*ог'а",
            ru: "находится",
          },
          {
            mkd: "наш",
            pron: "наш",
            ru: "наш",
          },
          {
            mkd: "не*гов",
            pron: "нэ*гов",
            ru: "его",
          },
          {
            mkd: "не*jзин",
            pron: "нэ*йзин",
            ru: "её",
          },
          {
            mkd: "не*пушач",
            pron: "не*пушач",
            ru: "не курящий",
          },
          {
            mkd: "ни*вен",
            pron: "ни*вэн",
            ru: "их",
          },
          {
            mkd: "ни*зок",
            pron: "ни*зок",
            ru: "низкий",
          },
          {
            mkd: "нов",
            pron: "ноф",
            ru: "новый",
          },
          {
            mkd: "ноќ (ж.р.)",
            pron: "нок'",
            ru: "ночь",
          },
          {
            mkd: "о*воj",
            pron: "о*вой",
            ru: "этот",
          },
          {
            mkd: "од",
            pron: "от",
            ru: "от, из, с",
          },
          {
            mkd: "о*ноj",
            pron: "о*ной",
            ru: "тот",
          },
          {
            mkd: "пла*ќа",
            pron: "пла*к'а",
            ru: "платить",
          },
          {
            mkd: "по*jадок",
            pron: "по*йадок",
            ru: "завтрак",
          },
          {
            mkd: "поло*вина",
            pron: "поло*вина",
            ru: "половина",
          },
          {
            mkd: "пре*зиме",
            pron: "прэ*зиме",
            ru: "фамилия",
          },
          {
            mkd: "при*земjе",
            pron: "при*зэмйэ",
            ru: "первый этаж",
          },
          {
            mkd: "пу*шач",
            pron: "пу*шач",
            ru: "курящий, курильщик",
          },
          {
            mkd: "ра*збере",
            pron: "ра*збэрэ",
            ru: "понять",
          },
          {
            mkd: "ра*збера",
            pron: "ра*збэра",
            ru: "понимать",
          },
          {
            mkd: "резерва*циjа",
            pron: "рэзэрва*цийа",
            ru: "бронь",
          },
          {
            mkd: "рестора*н",
            pron: "рэстора*н",
            ru: "ресторан",
          },
          {
            mkd: "реце*пциjа",
            pron: "рэцэ*пцийа",
            ru: "стойка администратора",
          },
          {
            mkd: "рецепцио*нер",
            pron: "рэцэпцио*нер",
            ru: "дежурный администратор",
          },
          {
            mkd: "са*мо",
            pron: "са*мо",
            ru: "только",
          },
          {
            mkd: "си*од",
            pron: "си*од",
            ru: "весь",
          },
          {
            mkd: "ска*по",
            pron: "ска*по",
            ru: "дорого",
          },
          {
            mkd: "со*ба",
            pron: "со*ба",
            ru: "комната, номер (в гостинице)",
          },
          {
            mkd: "сти*гне",
            pron: "сти*гнэ",
            ru: "прибить, добраться",
          },
          {
            mkd: "сти*гнува",
            pron: "сти*гнува",
            ru: "прибывать, добираться",
          },
          {
            mkd: "таксиме*тар",
            pron: "таксимэ*тар",
            ru: "таксометр",
          },
          {
            mkd: "такси*ст",
            pron: "такси*ст",
            ru: "таксист",
          },
          {
            mkd: "твоj",
            pron: "твой",
            ru: "твой",
          },
          {
            mkd: "то*гаш",
            pron: "то*гаш",
            ru: "тогда",
          },
          {
            mkd: "тоj",
            pron: "той",
            ru: "этот",
          },
          {
            mkd: "то*кму",
            pron: "то*кму",
            ru: "именно",
          },
          {
            mkd: "то*пло",
            pron: "то*пло",
            ru: "тепло",
          },
          {
            mkd: "ту*ка",
            pron: "ту*ка",
            ru: "тут",
          },
          {
            mkd: "у*морен",
            pron: "у*морэн",
            ru: "уставший",
          },
          {
            mkd: "фикси*ран",
            pron: "фикси*ран",
            ru: "фиксирований",
          },
          {
            mkd: "хо*тел",
            pron: "хо*тэл",
            ru: "гостиница",
          },
          {
            mkd: "це*на",
            pron: "цэ*на",
            ru: "цена",
          },
          {
            mkd: "це*нтар",
            pron: "цэ*нтар",
            ru: "центр",
          },
          {
            mkd: "час",
            pron: "час",
            ru: "час",
          },
          {
            mkd: "чи*ни",
            pron: "чи*ни",
            ru: "стоить",
          },
        ],
      },
    },
  ],
};
