import { VocabularyData } from "@/types/vocabularyTypes";

const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-2",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "бр\u0301oj",
            pron: "бро́й",
            ru: "номер",
          },
          {
            mkd: "ве\u0301ќе",
            pron: "вэ́к'э",
            ru: "уже",
          },
          {
            mkd: "вле\u0301гува",
            pron: "влэ́гува",
            ru: "входить",
          },
          {
            mkd: "во го\u0301тово",
            pron: "во_го́тово",
            ru: "наличными",
          },
          {
            mkd: "град",
            pron: "грат",
            ru: "город",
          },
          {
            mkd: "двокре\u0301ветна со\u0301ба",
            pron: "двокрэ\u0301вэтна_со\u0301ба",
            ru: "двухмесный номер",
          },
          {
            mkd: "де\u0301сно",
            pron: "дэ\u0301сно",
            ru: "направо, справа",
          },
          {
            mkd: "до",
            pron: "до",
            ru: "до",
          },
          {
            mkd: "до\u0301бар",
            pron: "до\u0301бар",
            ru: "хороший",
          },
          {
            mkd: "до\u0301бро",
            pron: "до\u0301бро",
            ru: "хорошо",
          },
          {
            mkd: "е\u0301вро",
            pron: "э\u0301вро",
            ru: "евро",
          },
          {
            mkd: "еднокре\u0301ветна со\u0301ба",
            pron: "эднокре\u0301ветна_со\u0301ба",
            ru: "одномесный номер",
          },
          {
            mkd: "и\u0301лjада",
            pron: "и\u0301л'йада",
            ru: "тысяча",
          },
          {
            mkd: "иско\u0301ристи",
            pron: "иско\u0301ристи",
            ru: "использовать (сов. вид)",
          },
          {
            mkd: "за\u0301морен",
            pron: "за\u0301морэн",
            ru: "утомительный",
          },
          {
            mkd: "ка\u0301де",
            pron: "ка\u0301де",
            ru: "где, куда",
          },
          {
            mkd: "ка\u0301ртичка",
            pron: "ка\u0301ричка",
            ru: "карточка",
          },
          {
            mkd: "кат",
            pron: "кат",
            ru: "этаж",
          },
          {
            mkd: "клуч",
            pron: "клуч",
            ru: "ключ",
          },
          {
            mkd: "ко\u0301лку",
            pron: "ко\u0301лку",
            ru: "сколько, на сколько",
          },
          {
            mkd: "ко\u0301ристи",
            pron: "ко\u0301ристи",
            ru: "использовать (не сов. вид)",
          },
          {
            mkd: "ле\u0301во",
            pron: "лэ\u0301во",
            ru: "налево, слева",
          },
          {
            mkd: "моj",
            pron: "мой",
            ru: "мой",
          },
          {
            mkd: "мо\u0301мент",
            pron: "мо\u0301мэнт",
            ru: "момент, миг",
          },
          {
            mkd: "се на\u0301ог\u0301а",
            pron: "сэ_на\u0301ог'а",
            ru: "находится",
          },
          {
            mkd: "наш",
            pron: "наш",
            ru: "наш",
          },
          {
            mkd: "не\u0301гов",
            pron: "нэ\u0301гов",
            ru: "его",
          },
          {
            mkd: "не\u0301jзин",
            pron: "нэ\u0301йзин",
            ru: "её",
          },
          {
            mkd: "не\u0301пушач",
            pron: "не\u0301пушач",
            ru: "не курящий",
          },
          {
            mkd: "ни\u0301вен",
            pron: "ни\u0301вэн",
            ru: "их",
          },
          {
            mkd: "ни\u0301зок",
            pron: "ни\u0301зок",
            ru: "низкий",
          },
          {
            mkd: "нов",
            pron: "ноф",
            ru: "новый",
          },
          {
            mkd: "ноќ (ж.р.)",
            pron: "нок'",
            ru: "ночь",
          },
          {
            mkd: "о\u0301воj",
            pron: "о\u0301вой",
            ru: "этот",
          },
          {
            mkd: "од",
            pron: "от",
            ru: "от, из, с",
          },
          {
            mkd: "о\u0301ноj",
            pron: "о\u0301ной",
            ru: "тот",
          },
          {
            mkd: "пла\u0301ќа",
            pron: "пла\u0301к'а",
            ru: "платить",
          },
          {
            mkd: "по\u0301jадок",
            pron: "по\u0301йадок",
            ru: "завтрак",
          },
          {
            mkd: "поло\u0301вина",
            pron: "поло\u0301вина",
            ru: "половина",
          },
          {
            mkd: "пре\u0301зиме",
            pron: "прэ\u0301зиме",
            ru: "фамилия",
          },
          {
            mkd: "при\u0301земjе",
            pron: "при\u0301зэмйэ",
            ru: "первый этаж",
          },
          {
            mkd: "пу\u0301шач",
            pron: "пу\u0301шач",
            ru: "курящий, курильщик",
          },
          {
            mkd: "ра\u0301збере",
            pron: "ра\u0301збэрэ",
            ru: "понять",
          },
          {
            mkd: "ра\u0301збера",
            pron: "ра\u0301збэра",
            ru: "понимать",
          },
          {
            mkd: "резерва\u0301циjа",
            pron: "рэзэрва\u0301цийа",
            ru: "бронь",
          },
          {
            mkd: "рестора\u0301н",
            pron: "рэстора\u0301н",
            ru: "ресторан",
          },
          {
            mkd: "реце\u0301пциjа",
            pron: "рэцэ\u0301пцийа",
            ru: "стойка администратора",
          },
          {
            mkd: "рецепцио\u0301нер",
            pron: "рэцэпцио\u0301нер",
            ru: "дежурный администратор",
          },
          {
            mkd: "са\u0301мо",
            pron: "са\u0301мо",
            ru: "только",
          },
          {
            mkd: "си\u0301од",
            pron: "си\u0301од",
            ru: "весь",
          },
          {
            mkd: "ска\u0301по",
            pron: "ска\u0301по",
            ru: "дорого",
          },
          {
            mkd: "со\u0301ба",
            pron: "со\u0301ба",
            ru: "комната, номер (в гостинице)",
          },
          {
            mkd: "сти\u0301гне",
            pron: "сти\u0301гнэ",
            ru: "прибить, добраться",
          },
          {
            mkd: "сти\u0301гнува",
            pron: "сти\u0301гнува",
            ru: "прибывать, добираться",
          },
          {
            mkd: "таксиме\u0301тар",
            pron: "таксимэ\u0301тар",
            ru: "таксометр",
          },
          {
            mkd: "такси\u0301ст",
            pron: "такси\u0301ст",
            ru: "таксист",
          },
          {
            mkd: "твоj",
            pron: "твой",
            ru: "твой",
          },
          {
            mkd: "то\u0301гаш",
            pron: "то\u0301гаш",
            ru: "тогда",
          },
          {
            mkd: "тоj",
            pron: "той",
            ru: "этот",
          },
          {
            mkd: "то\u0301кму",
            pron: "то\u0301кму",
            ru: "именно",
          },
          {
            mkd: "то\u0301пло",
            pron: "то\u0301пло",
            ru: "тепло",
          },
          {
            mkd: "ту\u0301ка",
            pron: "ту\u0301ка",
            ru: "тут",
          },
          {
            mkd: "у\u0301морен",
            pron: "у\u0301морэн",
            ru: "уставший",
          },
          {
            mkd: "фикси\u0301ран",
            pron: "фикси\u0301ран",
            ru: "фиксирований",
          },
          {
            mkd: "хо\u0301тел",
            pron: "хо\u0301тэл",
            ru: "гостиница",
          },
          {
            mkd: "це\u0301на",
            pron: "цэ\u0301на",
            ru: "цена",
          },
          {
            mkd: "це\u0301нтар",
            pron: "цэ\u0301нтар",
            ru: "центр",
          },
          {
            mkd: "час",
            pron: "час",
            ru: "час",
          },
          {
            mkd: "чи\u0301ни",
            pron: "чи\u0301ни",
            ru: "стоить",
          },
        ],
      },
    },
  ],
};

export default vocabulary;
