import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-17",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "а*рен",
            pron: "а*рэн",
            ru: "хороший, годный",
          },
          {
            mkd: "брош",
            pron: "брош",
            ru: "брошь",
          },
          {
            mkd: "до*лжи",
            pron: "до*лжи",
            ru: "быть должным",
          },
          {
            mkd: "же*сток",
            pron: "жэ*сток",
            ru: "жёсткий, крепкий (об алкоголе)",
          },
          {
            mkd: "се збо*гува",
            pron: "сэ_збо*гува",
            ru: "прощаться",
          },
          {
            mkd: "збогу*вање",
            pron: "збогу*ван'э",
            ru: "прощание",
          },
          {
            mkd: "ко*нтакт",
            pron: "ко*нтакт",
            ru: "контакт",
          },
          {
            mkd: "ле*та",
            pron: "лэ*та",
            ru: "лететь, летать",
          },
          {
            mkd: "ма*гнет",
            pron: "ма*гнэт",
            ru: "магнит",
          },
          {
            mkd: "мејл",
            pron: "мэјл",
            ru: "мейл",
          },
          {
            mkd: "на*здрави",
            pron: "на*здрави",
            ru: "поднять тост, выпить за здоровье",
          },
          {
            mkd: "наздра*вува",
            pron: "наздра*вува",
            ru: "поднимать тост, выпивать за здоровье",
          },
          {
            mkd: "но*ќева",
            pron: "но*к'эва",
            ru: "ночевать",
          },
          {
            mkd: "оче*кува",
            pron: "очэ*кува",
            ru: "ожидать",
          },
          {
            mkd: "пепе*рутка",
            pron: "пэпэ*рутка",
            ru: "бабочка",
          },
          {
            mkd: "при*врзок",
            pron: "при*врзок",
            ru: "брелок",
          },
          {
            mkd: "разгле*дница",
            pron: "разглэ*дница",
            ru: "открытка",
          },
          {
            mkd: "ра*змени",
            pron: "ра*змэни",
            ru: "разменять, обменять",
          },
          {
            mkd: "разме*нува",
            pron: "размэ*нува",
            ru: "разменивать, обменивать",
          },
          {
            mkd: "сувени*р",
            pron: "сувэни*р",
            ru: "сувенир",
          },
          {
            mkd: "фи*лигран",
            pron: "фи*лигран",
            ru: "филигрань",
          },
          {
            mkd: "ца*рина",
            pron: "ца*рина",
            ru: "таможня, таможенная пошлина",
          },
          {
            mkd: "ча*сти",
            pron: "ча*сти",
            ru: "угощать",
          },
        ],
      },
    },
  ],
};
