import { ParagraphSectionsProps } from "@/types";

export const imperative: ParagraphSectionsProps = {
  type: "grammar-imperative",
  slug: "lesson-8",
  title: {
    ru: "ГРАММАТИКА",
    mkd: "ГРАМАТИКА",
  },
  subtitle: "ПОВЕЛИТЕЛЬНОЕ НАКЛОНЕНИЕ",
  content: {
    text: `Формы повелительного наклонения образуются при помощи формантов <span>-j</span>, <span>-jте</span> от всех глаголов а-класса 
    и от глаголов и-класса и е-класса, оканчивающихся на два гласных: <span>чи*та — чи*таj</span>, <span>чи*таjте</span>; <span>брои —
    броj</span>, <span>бро*jте</span>; <span>жи*вее — жи*веj</span>, <span>жи*веjте</span>. От глаголов и-класса и е-класса, оканчивающихся
    на одну гласную форма 2-го лица ед.ч. образуеться при помощи форманта <span>-и</span>, а 2-го лица мн.ч. — при помощи форманта
    <span>-ете</span>: <span>и*звини — и*звини</span>, <span>изви*нете</span>; <span>jа*де — jа*ди</span>, <span>jа*дете</span>. Исключения:
    <span>да*де — даj</span>, <span>да*jте</span>; <span>кла*де — клаj</span>, <span>кла*jте</span>; <span>сум — би*ди</span>,
    <span>би*дете</span>.
    
    Частички при этом ставятся после глагола. Согласно правилам литературного языка частицы и глагол составляют фонетическое слово, поэтому
    ударение должно падать на третий слог от конца: <span>прочита*j ми jа о*наа кни*га</span> «прочитай мне ту книгу», <span>прчитаjте*
    ми jа о*наа кни*га</span> «прочитайте мне ту книгу». В разговорной речи правила переноса ударения часто не соблюдается.
    
    Для образования отрицательных форм повелительного наклонения следует добавить частицу <span>не</span>, при этом правила перноса
    частиц после глагола становится опциональным (можно переносить, а можно нет): <span>не чи*таj ми jа о*наа кни*га</span> или
    <span>не ми jа чи*таj о*наа кни*га</span> «не читай мне ту книгу»; <span>не чи*таjте ми jа о*наа кни*га</span> или
    <span>не ми jа чи*таjте о*наа кни*га</span> «не читайте мне ту книгу».`,
  },
};
