import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-10",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `— Привет, Наташа! Как дела? Как Иван? Я его видел вчера, он плохо выглядел. — Да, позавчера он подхватил где-то 
        кишечный грипп, всю ночь у него была высокая темпрература, диарея и его тошнило. — Если ему нужна помощь, я могу отвезти его в
        больницу, мой дядя врач. — Спасибо, я купила лекарство в аптеке, ему уже лучше. Ты знаешь, когда мы едем в отпуск, с ним всегда
        что-то происходит. В прошлом году, когда мы отдыхали в Бразилии, его укусила змея. Я очень испугалась и вызвала скорую помощь. К
        счастью, скорая приехала очень быстро. Врач дал ему противоядие, и всё закончилось хорошо. А когда мы в Скопье, Иван никогда не
        болеет. Здоров, как бык. — Ох, ему действительно не везёт. Пусть поскорее выздоравливает. Плохо болеть на отдыхе. Три года назад
        мы поехали в Грецию с детьми. У младшей дочери начало болеть горло. Мы думали, что это простуда, но она начала сильно кашлять,
        у неё поднялась температура. Мы пошли к врачу. Оказалось, что у неё воспаление лёгких. Врач выписал нам рецепт. Мы сразу вернулись
        в Македонию. Она выздоровела только через две недели.`,
        answer: [
          `— Здраво, Наташа! Како си? Како е Иван? Го видов вчера, лошо изгледаше. — Да, завчера фати некаде стомачен вирус, цела ноќ 
          имаше висока температура, диjареа повраќаше. — Ако му треба помош, може да го однесам во болница, чичко ми е лекар. — Фала, му
          купив лек од аптека, веќе му е подобро. Знаеш, кога одиме на одмор секогаш му се случува нешто. Лани кога одморавме во Бразил
          го касна змиjа. Многу се исплашив и викнав брза помош. За среќа брзата помош стигна брзо. Лекарот му даде серум и се заврши
          добро. А, кога сме во Скопjе ништо не го боли. Здрав е како дрен. — Леле, навистина нема среќа. Побрзо да оздрави. Многу е лошо
          да се разболиш на одмор. Пред три години отидовме во Грциjа со децата. Помлада ќерка почна да jа боли грлото. Мислевме дека тоа
          е настинка, но почна силно да кашла и имаше висока температура. Отидовме на лекар. Излезе дека има воспаление на белите дробови.
          Лекарот ни препиша рецепт. Веднаш се вративме во Македониjа. Оздраве дури за две недели.`,
        ],
      },
    },
  ],
};
