import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-10",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте глаголы в нужную форму аориста или имперфекта в зависимости от вида.`,
      ],
      content: {
        sentences: [
          {
            mkd: `Вче*ра А*цо и На*таша ___ (ста*не), ___ (се истуши*ра) и ___ (и*змие) за*би.`,
            answer: [`стана`, `се истушираа`, `изимиjа`],
          },
          {
            mkd: `А*цо ___ (се и*збричи), а На*таша ___ (се на*шминка).`,
            answer: [`се избричи`, `се нашминка`],
          },
          {
            mkd: `По*тоа На*таша ___ (зго*тви) по*јадок и ти*е ___ (по*јадува).`,
            answer: [`зготви`, `појадуваа`],
          },
          {
            mkd: `А*цо ___ (о*тиде) на ра*бота со ко*ла, а На*таша ___ (о*тиде) пе*шки.`,
            answer: [`отиде`, `отиде`],
          },
          {
            mkd: `Во Ско*пjе це*ло вре*ме и*ма ме*теж за*тоа вче*ра А*цо ___ (за*доцни).`,
            answer: [`задоцни`],
          },
          {
            mkd: `Ра*бота ___ (за*почне) во о*сум ча*сот.`,
            answer: [`започна`],
          },
          {
            mkd: `Во е*ден А*цо и не*ковите ко*леги ___ (ру*ча) во е*ден мал ресто*ран.`,
            answer: [`ручаа`],
          },
          {
            mkd: `Во пет ча*сот А*цо ___ (за*врши) со ра*бота и ___ (о*тиде) во прода*вница, та*му ___ (ку*пи) хра*на и ___ (се вра*ти)
            со ко*ла до*ма.`,
            answer: [`заврши`, `отиде`, `купи`, `се врати`],
          },
          {
            mkd: `До*ма На*таша ___ (зго*тви) ве*чера.`,
            answer: [`зготви`],
          },
          {
            mkd: `Ти*е ___ (ве*чера), а по*тоа ма*лку ___ (о*дмори) и ___ (се сре*тне) со ни*ните при*јатели.`,
            answer: [`вечераа`, `одморија`, `се сретнаа`],
          },
          {
            mkd: `___ (ле*гне) во двана*есет ча*сот.`,
            answer: [`Легна`],
          },
        ],
      },
    },
  ],
};
