import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-10",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения из данных слов, используя аорист.`],

      content: {
        text: "<span>Ни*е, вра*ти, па*ри, Го*ран и Зо*ра. — Ни*е им вра*тивме па*рите на Го*ран и Зо*ра.</span>",
        sentences: [
          {
            mkd: `1) син ми, се ра*зболи — ___.`,
            answer: [`Син ми се разболе`],
          },
          {
            mkd: `2) Го*ран, за*боли, гла*ва — ___.`,
            answer: [`Горан го заболе главата`],
          },
          {
            mkd: `3) ка*ко, ти, и*стегне, о*воj, му*скул — ___(?)`,
            answer: [`Како ти го истегна овој мускул`],
          },
          {
            mkd: `4) да*ли, ви*е, ви*ди, нов, рабо*тници — ___(?)`,
            answer: [`Дали вие ги видовте новите работници`],
          },
          {
            mkd: `5) те*тка, за*брани, не*jзин, вну*ци, пли*ва — ___.`,
            answer: [`Тетката им забрани на нејзините внуци да пливаат`],
          },
          {
            mkd: `6) ке*лнер, ни*е, ра*ситни, па*ри — ___.`,
            answer: [`Келнерот ни раситни пари`],
          },
          {
            mkd: `7) во, ко*лку, час, тр*гне, а*втобус — ___ (?)`,
            answer: [`Во колку часот тргна автобусот`],
          },
          {
            mkd: `8) Бо*рjана, и*спие, а*пче, про*тив, главо*болка — ___.`,
            answer: [`Боjрана испи апче против главоболка`],
          },
          {
            mkd: `9) jас, ски*не, моj, jа*кна — ___.`,
            answer: [`Јас ја скинав мојата јакна`],
          },
          {
            mkd: `10) ни*е, за*плаче — ___.`,
            answer: [`Ние заплакавме`],
          },
          {
            mkd: `11) ти, на*пиша, пи*смо, тво*j, роди*тели — ___(?)`,
            answer: [`Ти им напиша писмо на твоите родители`],
          },
          {
            mkd: `12) луѓе, пре*мине, пат — ___.`,
            answer: [`Луѓето го преминаа патот`],
          },
          {
            mkd: `13) пацие*нт, се по*жали, ле*кар, на, ви*сок, температу*ра — ___.`,
            answer: [`Пациентот се пожали на лекарот за високата температура`],
          },
          {
            mkd: `14) ни*е, о*тиде, на, го*сти, каj, И*скра — ___.`,
            answer: [`Ние отидовме на гости кај Искра`],
          },
          {
            mkd: `15) коj, ти, се jа*ви — ___(?)`,
            answer: [`На **кого / кому** ти се jави / Коj ти се jави`],
          },
          {
            mkd: `16) крва*вење, пре*стане — ___.`,
            answer: [`Крвавењето престана`],
          },
        ],
      },
    },
  ],
};
