import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-10",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. У кого болит живот? — У меня. 2. Я знаю, что после операции у меня еще долго будет болеть живот. 3. Если у меня 
        долго болит живот, я пью это лекарство. 4. Если у меня будет долго болеть живот, я пойду к врачу. 5. Если у меня не болит живот,
        я пойду с вами в кино. 6. Раньше у меня часто болел живот. — Когда болел живот? — У меня. 7. Позавчера у меня сильно заболела
        голова. 8. Если ты будешь долго сидеть на солнце, у тебя заболит голова. 9. Если у тебя заболит голова, я тебе дам таблетку от
        головной боли. 10. Если у моего брата не заболит опять голова, мы пойдем в кино. 11. Не сиди долго на солнце, у тебя заболит
        голова. — Не заболит.`,
        answer: [
          `1. Кого го боли стомакот? — Мене. 2. Знам дека по операциjата уште долго ќе ме боли стомакот. 3. Ако долго ме боли стомакот го
          пиjам овоj лек. 4. Ако долго ме боли стомакот ќе одам на лекар. 5. Ако не ме боли стомакот ќе одам со вас на кино. 6. Порано
          често ме болеше стомакот. — Кога го болеше? — Мене. 7. Завчера силно ме заболе главата. 8. Ако долго седиш на сонцето ќе те
          заболи главата. 9. Ако те заболи главата ќе дадам апче против главоболка. 10. Ако на мојот брат повторно не го заболи главата,
          ќе одиме во кино. 11. Не седи долго на сонцето, ќе те заболи главата. — Нема.`,
        ],
      },
    },
  ],
};
