import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-10",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте глаголы в аорист. Трансформируйте предложения, используя местоимения <span>jас</span>, <span>ни*е</span>, <span>ти*е</span>.
      
          (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span>"тоj", "jас", "ни*е", "ти*е"</span>. В центре
        показано текущее местоимение.)`,
      ],
      answerSet: {
        labels: ["Тоj", "Jас", "Ни*е", "Ти*е"],
        pronounWords: ["ми", "му", "му", "му"],
      },
      content: {
        sentences: [
          {
            mkd: `1. Зла*те ___ (ста*не) мно*гу рано.`,
            answer: [`стана/станав/станавме/станаа`],
          },
          {
            mkd: `2. Мари*на го ___ (запо*знае) Да*рко пред не*колку го*дини.`,
            answer: [`запозна/запознав/запознавме/запознаа`],
          },
          {
            mkd: `3. Сло*бодан jа ___ (ши*не) но*гата до*дека и*граше фу*дбал.`,
            answer: [`шина/шинав/шинавме/шинаа`],
          },
          {
            mkd: `4. Еми*лиjа ги ___ (ра*сипе) ко*лата.`,
            answer: [`расипе/расипав/расипавме/расипаа`],
          },
          {
            mkd: `5. Фро*сина ___ (се и*змие).`,
            answer: [`се изми/се измив/се измивме/се измија`],
          },
          {
            mkd: `6. Ве*сна ___ (се о*блече) и ___ (и*злезе) од до*ма.`,
            answer: [
              `се облече/се облеков/се облековме/се облекоа`,
              `излезе/излезов/излезовме/излегоа`,
            ],
          },
          {
            mkd: `7. Ма*рко ___ (се о*труе) со ри*ба.`,
            answer: [`се отруе/се отруев/се отруевме/се отруjа`],
          },
          {
            mkd: `8. Па*вле ни*што не ___ (ра*збере).`,
            answer: [`разбра/разбрав/разбравме/разбраа`],
          },
          {
            mkd: `9. У*бавка ___ (и*спече) у*бави ки*фли.`,
            answer: [`испече/испеков/испековме/испекоа`],
          },
          {
            mkd: `10. И*лиjа ни ___ (ра*скаже) за и*спитот.`,
            answer: [`раскажа/раскажав/раскажавме/раскажаа`],
          },
          {
            mkd: `11. А*нѓела им ___ (до*несе) у*бави пода*роци на сво*ите вну*ци.`,
            answer: [`донесе/донесов/донесовме/донесоа`],
          },
          {
            mkd: `12. Jо*рдан ___ (ле*гне) и ве*днаш ___ (за*спие).`,
            answer: [
              `легна/легнав/легнавме/легнаа`,
              `заспа/заспав/заспавме/заспаа`,
            ],
          },
          {
            mkd: `13. Не*над по гре*шка го ___ (зе*ме) мо*ето па*лто на*место сво*е.`,
            answer: [`зеде/зедов/зедовме/зедоа`],
          },
          {
            mkd: `14. А*нѓел го ___ (о*днесе) сако*то на хе*миско чи*чтење.`,
            answer: [`однесе/однесов/однесовме/однесоа`],
          },
          {
            mkd: `15. Ка*ко На*де jа ___ (прежи*вее) во*jната?`,
            answer: [`преживеа/преживеав/преживеавме/преживеа`],
          },
          {
            mkd: `16. Ле*карот **[[PRONOUN_WORD]]** ___ (да*де) ре*цепт.`,
            answer: [`даде/дадов/дадовме/дадоа`],
          },
        ],
      },
    },
  ],
};
