import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-10",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте глаголы в нужную форму аориста или имперфекта в зависимости от вида. Переведите со словарём.`,
      ],
      content: {
        sentences: [
          {
            mkd: `Се*га многу*мина во гра*дот се бо*лни од грип.`,
          },
          {
            mkd: `Вче*ра, мо*jот ко*лега ко*jшто се*ди до ме*не цел ден ___ (ка*шла) и ___ (ду*ва) нос.`,
            answer: [`кашлаше`, `дуваше`],
          },
          {
            mkd: `Де*нес ко*га ___ (се ра*збуди), ме ___ (бо*ли) це*лото те*ло и ___ (и*ма) ви*сока температу*ра.`,
            answer: [`се разбудив`, `болеше`, `имав`],
          },
          {
            mkd: `Веро*jатно, ___ (се за*рази) од не*го.`,
            answer: [`се заразив`],
          },
          {
            mkd: `Му ___ (се jа*ви) на мо*jот шеф и му ___ (ка*же) де*ка ___ (се ра*зболи) и де*ка не*ма да до*jдам.`,
            answer: [`се jавив`, `кажав`, `се разболев`],
          },
          {
            mkd: `По*тоа ___ (се jа*ви) во ординаци*jата на мо*jот ле*кар и ___ (за*каже) те*рмин во 12 ча*сот.`,
            answer: [`се jави`, `закажав`],
          },
          {
            mkd: `Ко*га ___ (до*jде) каj ле*карот, тоj у*ште ___ (сум) за*фатен, за*тоа ма*лку ___ (по*чека).`,
            answer: [`доjдов`, `беше`, `почека`],
          },
          {
            mkd: `Во ординаци*jата ___ (и*ма) ре*дица, но ле*карот ме ___ (при*ми) прв за*тоа што и*мав зака*жано.`,
            answer: [`имаше`, `прими`],
          },
          {
            mkd: `Ле*карот ми ___ (и*змери) температу*ра, ми го ___ (пре*гледа) гр*лото, ми ги ___ (слу*шне) гра*дите и ми ___ (ка*же) 
            де*ка тре*ба да на*правам ре*ндген на бе*лите дро*бови.`,
            answer: [`измери`, `прегледа`, `слушна`, `кажа`],
          },
          {
            mkd: `Ми ___ (да*де) у*пат и ___ (о*тиде) во поликли*ника.`,
            answer: [`даде`, `отидов`],
          },
          {
            mkd: `Биде*jќи сум стра*нец и не*мам маке*донско осигуру*вање, пр*во ___ (пла*ти), па по*тоа ___ (на*прави) ре*ндген.`,
            answer: [`платив`, `направив`],
          },
          {
            mkd: `Штом jа ___ (до*би) сни*мката, му jа ___ (о*днесе) на мо*jот ле*кар.`,
            answer: [`добив`, `однесов`],
          },
          {
            mkd: `Ле*карот jа ___ (по*гледне) сни*мката и ___ (ка*же) де*ка и*мам воспале*ние на бе*лите дро*бови.`,
            answer: [`погледна`, `кажа`],
          },
          {
            mkd: `Ми ___ (пре*пише) антибио*тик што тре*ба да го зе*мам два па*ти на ден, на*утро и на*вечер, по о*брок, во те*кот на 
            се*дум де*на.`,
            answer: [`препиша`],
          },
          {
            mkd: `О*ткако ___ (и*злезе) од каj ле*карот, ___ (о*тиде) во а*птека, го ___ (ку*пи) антибио*тик ко*jшто о*ди на ре*цепт
            и ___ (се вра*ти) до*ма.`,
            answer: [`излегов`, `отидов`, `купив`, `се вратив`],
          },
          {
            mkd: `Не ми ___ (се jа*де), за*тоа са*мо ___ (пи*е) чаj од на*не.`,
            answer: [`се jадеше`, `пиев`],
          },
          {
            mkd: `Цел ден ___ (ле*жи) во кре*вет, ___ (гле*да) фи*лмови и ___(спи*е).`,
            answer: [`лежев`, `гледав`, `спиев`],
          },
          {
            mkd: `Ве*черта ___ (до*jде) се*стра ми, ми ___ (зго*тви) су*па, jа ___ (и*зеде), го ___ (и*спие) а*пчето и ___ (ле*гне) да
            спи*jам `,
            answer: [`доjде`, `зготви`, `изедов`, `испив`, `легнав`],
          },
        ],
      },
    },
  ],
};
