import { TablesProps } from "@/types";

export const pluperfect: TablesProps = {
  type: `pluperfect`,
  slug: "lesson-15",
  text: `Плюсквамперфект образуется при помощи глагола «быть» в форме прошедшего времени и л-формы.`,
  content: {
    subtitle: [" ", "пра*ви", "на*прави"],
    rows: [
      {
        person: "јас",
        forms: ["бев пра*ве-л/а", "бев на*прави-л/напра*ви-ла"],
      },
      {
        person: "ти",
        forms: ["бе*ше пра*ве-л/а", "бе*ше на*прави-л/напра*ви-ла"],
      },
      {
        person: "тој, та*а, то*а",
        forms: ["бе*ше пра*ве-л/а/о", "бе*ше на*прави-л/напра*ви-ла/о"],
      },
      {
        person: "ни*е",
        forms: ["бе*вме пра*ве-ле", "бе*вме напра*ви-ле"],
      },
      {
        person: "ви*е",
        forms: ["бе*вте пра*ве-ле", "бе*вте напра*ви-ле"],
      },
      {
        person: "ти*е",
        forms: ["бе*а пра*ве-ле", "бе*а напра*ви-ле"],
      },
    ],
  },
};
