import { ParagraphSectionsProps } from "@/types";

export const accent: ParagraphSectionsProps = {
  type: "accent",
  slug: "lesson-1",
  subtitle: "УДАРЕНИЕ",
  content: {
    text: `
      В македонском языке ударение фиксированное - на третьем слоге от конца: <span>у*чебник, уче*бници</span>. Иногда ударение стоит на
      другом месте и имеет смыслоразличительную функцию: <span>годи*нaва</span> <strong>этот год</strong> - <span>година*ва</span>
      <strong>в этом году</strong>. В некоторых иностранных словах ударение стоит на других слогах, такие слова нужно запоминать:
      <span>коле*га</span> «коллега», <span>ниво*</span> «уровень», все глаголы на - «ира» (<span>мини*ра</span> «минировать»).
      
      Есть ряд случаев, когда несколько слов произносятся как одно фонетическое слово.
      
      Два слова обозначают одно понятие или название: <span>суво* грозjе</span> [суво*_грозЙэ] «изюм».
      
      Определение + существительное: <span>стари* луг*е</span> [стари*_луг*э] «старые люди», <span>старите* луг*е</span> [старите*_луг*э]
      «эти старые люди», <span>мо*j човек</span> [мо*й_човэк] «мой человек», <span>таа* жена</span> [таа*_жэна] «эта женщина»,
      <span>долга у*лица</span> [долга_у*лица] «длинная улица». Исключения: на слова <span>е*ден, не*коj</span> ударение не переносится -
      <span>една же*на</span> [эдна_жэ*на] «одна женщина».
      
      Приветствие и прощание: <span>до виду*вање</span> [до_виду*ване] «до свиданья».
      
      Существительное + имя собственное: <span>цар Са*муил</span> [цар_Са*муил] «царь Самуил».
      
      Простое числительное + существительное: <span>два* дена</span> [два*_дэна] «два дня».
      
      Некоторые предлоги в пространственном, временном значении или значении образа действия + существительное:
      <span>до* небо</span> [до*_нэбо] «до неба».
      
      Предлог + полная форма местоимения: <span>бе*з нас</span> [бэ*з_нас] «без нас».
      
      Частица «не» + односложный/двусложный глагол: <span>не* можам</span> [нэ*_можам] «не могу».
      
      Вопросительное слово + глагол: <span>што* сакаш</span> [што*_сакаш] «что хочешь».
      
      Союз + знаменательная часть речи: <span>и* jас и ти*</span> [и*_йас_и_ти*] «и я и ты».
      
      Существительное + краткая форма местоимения: <span>братуче*тка ми</span> [братучэ*тка_ми] «моя двоюродная сестра».
      
      Слова <span>еве, ете, ене</span> + краткая форма местоимения: <span>е*ве ги</span> [э*вэ_ги] «вот они».
      
      Глагол в повелительном наклонении + частица/частицы: <span>доне*си го</span> [донэ*си_го] «принеси его», <span>донесите* ни го</span>
      [донесите*_ни_го] «принесите нам его».
      
      Клитика (частица, не имеющая своего ударения) + знаменательная часть речи + клитика: <span>си му ре*кол ли</span> [си_му_рэ*кол_ли] «сказал ли ты ему».
      
      Отрицание + клитика + знаменательная часть речи: <span>не се* смеат</span> [нэ_сэ*_смэат] «не смеются».
      
      Вопросительное слово + клитика + знаменательная часть речи: <span>коj ќе* оди</span> [кой_ке*_оди] «кто пойдет».
      
      Знаменательная часть речи + клитика + знаменательная часть речи: <span>три* и пол</span> [три*_и_пол] «три с половиной».`.trim(),
  },
};
