import { ParagraphSectionsProps } from "@/types";

export const accent: ParagraphSectionsProps = {
  type: "accent",
  title: "УДАРЕНИЕ",
  content: {
    text: `
      В македонском языке ударение фиксированное - на третьем слоге от конца: <span>у\u0301чебник, уче\u0301бници</span>.
      Иногда ударение стоит на другом месте и имеет смыслоразличительную функцию:
      <span>годи\u0301нaва</span> <strong>этот год</strong> - <span>година\u0301ва</span> <strong>в этом году</strong>.
      В некоторых иностранных словах ударение стоит на других слогах, такие слова нужно запоминать: <span>коле\u0301га</span>
      «коллега», <span>ниво\u0301</span> «уровень»,
      все глаголы на - «ира» (<span>мини\u0301ра</span> «минировать»).
      
      Есть ряд случаев, когда несколько слов произносятся как одно фонетическое слово.
      
      Два слова обозначают одно понятие или название: <span>суво\u0301 грозjе</span> [суво\u0301_грозЙэ] «изюм».
      
      Определение + существительное: <span>стари\u0301 луг\u0301е</span> [стари\u0301_луг\u0301э] «старые люди»,
      <span>старите\u0301 луг\u0301е</span> [старите\u0301_луг\u0301э] «эти старые люди»,
      <span>мо\u0301j човек</span> [мо\u0301й_човэк] «мой человек»,
      <span>таа\u0301 жена</span> [таа\u0301_жэна] «эта женщина»,
      <span>долга у\u0301лица</span> [долга_у\u0301лица] «длинная улица».
      Исключения: на слова <span>е\u0301ден, не\u0301коj</span>
      ударение не переносится - <span>една же\u0301на</span> [эдна_жэ\u0301на] «одна женщина».
      
      Приветствие и прощание: <span>до виду\u0301вање</span> [до_виду\u0301ване] «до свиданья».
      
      Существительное + имя собственное: <span>цар Са\u0301муил</span> [цар_Са\u0301муил] «царь Самуил».
      
      Простое числительное + существительное: <span>два\u0301 дена</span> [два\u0301_дэна] «два дня».
      
      Некоторые предлоги в пространственном, временном значении или значении образа действия + существительное:
      <span>до\u0301 небо</span> [до\u0301_нэбо] «до неба».
      
      Предлог + полная форма местоимения: <span>бе\u0301з нас</span> [бэ\u0301з_нас] «без нас».
      
      Частица «не» + односложный/двусложный глагол: <span>не\u0301 можам</span> [нэ\u0301_можам] «не могу».
      
      Вопросительное слово + глагол: <span>што\u0301 сакаш</span> [што\u0301_сакаш] «что хочешь».
      
      Союз + знаменательная часть речи: <span>и\u0301 jас и ти\u0301</span> [и\u0301_йас_и_ти\u0301] «и я и ты».
      
      Существительное + краткая форма местоимения: <span>братуче\u0301тка ми</span> [братучэ\u0301тка_ми] «моя двоюродная сестра».
      
      Слова <span>еве, ете, ене</span> + краткая форма местоимения: <span>е\u0301ве ги</span> [э\u0301вэ_ги] «вот они».
      
      Глагол в повелительном наклонении + частица/частицы: <span>доне\u0301си го</span> [донэ\u0301си_го] «принеси его»,
      <span>донесите\u0301 ни го</span> [донесите\u0301_ни_го] «принесите нам его».
      
      Клитика (частица, не имеющая своего ударения) + знаменательная часть речи + клитика: <span>си му ре\u0301кол ли</span> [си_му_рэ\u0301кол_ли] «сказал ли ты ему».
      
      Отрицание + клитика + знаменательная часть речи: <span>не се\u0301 смеат</span> [нэ_сэ\u0301_смэат] «не смеются».
      
      Вопросительное слово + клитика + знаменательная часть речи: <span>коj ќе\u0301 оди</span> [кой_ке\u0301_оди] «кто пойдет».
      
      Знаменательная часть речи + клитика + знаменательная часть речи: <span>три\u0301 и пол</span> [три\u0301_и_пол] «три с половиной».`.trim(),
  },
};
