import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-11",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте глаголы в нужную форму аориста или имперфекта в зависимости от вида. Переведите со словарём.`,
      ],
      content: {
        sentences: [
          {
            mkd: `На три*есет и пр*ви деке*мври jас ___ (ста*не) во се*дум и поло*вина ча*сот, ___ (се истуши*ра), ___ (се о*блече) и ___ 
            (се на*шминка).`,
            answer: ["станував", "се истуширав", "се облеков", "се нашминкав"],
          },
          {
            mkd: `Не ___ (поjа*дува).`,
            answer: [`појадував`],
          },
          {
            mkd: `Во о*сум и де*сет ___ (тр*гне) на ра*бота со ко*ла.`,
            answer: [`тргнав`],
          },
          {
            mkd: `На ра*бота ___ (сти*гне) во пет до де*сет.`,
            answer: [`стигнав`],
          },
          {
            mkd: `Се ___ (по*здрави) со коле*гите и го ___ (за*почне) рабо*тниот ден.`,
            answer: [`поздравив`, `започнав`],
          },
          {
            mkd: `Во е*ден ___ (и*ма) па*уза за ру*чек.`,
            answer: [`имав`],
          },
          {
            mkd: `За вре*ме на ру*чек му ___ (се jа*ви) на мо*jот по*стар брат и ___ (по*бара) со*вет од не*го што да им по*дарам на нашите 
            роди*тели.`,
            answer: [`се јавив`, `побарав`],
          },
          {
            mkd: `О*колу пет ___ (за*врши) со ра*бота и им jа ___ (че*стита) Но*вата го*дина на си*те ко*леги.`,
            answer: [`завршив`, `честитав`],
          },
          {
            mkd: `По ра*бота ___ (вле*зе) во прода*вница и ___ (ку*пи) пода*роци.`,
            answer: [`влегов`, `купив`],
          },
          {
            mkd: `По*тоа ___ (о*тиде) каj родите*лите.`,
            answer: [`отидов`],
          },
          {
            mkd: `На ма*сата се*како ___ (и*ма) ру*ска са*лата.`,
            answer: [`имаше`],
          },
          {
            mkd: `Си*те за*едно ___ (се збо*гува) со ста*рата го*дина и jа ___ (пре*чека) Но*вата го*дина.`,
            answer: [`се збогувавме`, `пречекавме`],
          },
          {
            mkd: `Го ___ (слу*ш не) го*ворот на претседа*телот, ___ (на*здрави) со ша*мпань и ___ (гле*да) огно*мети.`,
            answer: [`слушнавме`, `наздравивме`, `гледавме`],
          },
        ],
      },
    },
  ],
};
