import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-11",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Втавьте глаголы в аорист или имперфект. Трансформируйте предложения, используя местоимения <span>jас</span>, <span>ни*е</span>,
        <span>ти*е</span>.
      
          (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span>"тоj/та*а", "jас", "ни*е", "ти*е"</span>. В центре
        показано текущее местоимение.)`,
      ],
      answerSet: {
        labels: ["Тоj/Та*а", "Jас", "Ни*е", "Ти*е"],
        pronounWords: ["ми", "му", "му", "му"],
      },
      content: {
        sentences: [
          {
            mkd: `1. За Но*ва го*дина А*танас ___ (до*бие) но*ва и*грачка.`,
            answer: [`доби/добив/добивме/добиjа`],
          },
          {
            mkd: `2. Бла*гица ___ (се со*нча) цел ден.`,
            answer: [`се сончаше/се сончав/се сончавме/се сончаа`],
          },
          {
            mkd: `3. Ве*черва Ве*нко **[[PRONOUN_WORD]]** ги ___ (по*каже) сво*ите пода*роци.`,
            answer: [`покажа/показав/покажавме/покажаа`],
          },
          {
            mkd: `4. О*лга **[[PRONOUN_WORD]]** го ___ (че*стита) роде*нденот на И*ван си*ноќа.`,
            answer: [`честиташе/честитав/честитавме/честитаа`],
          },
          {
            mkd: `5. Мина*тата го*дина Да*мjан го ___ (про*слави) роде*нденот во Будимпе*шта.`,
            answer: [`прослави/прославив/прославивме/прославиjа`],
          },
          {
            mkd: `6. По*рано О*ливер ги ___ (зна*е) си*те де*ца во ма*ало.`,
            answer: [`знаеше/знаев/знаевме/знаеjа`],
          },
          {
            mkd: `7. О*ва де*те го ___ (при*влече) внимани*ето на гледа*чите.`,
            answer: [`привлече/привлеков/привлековме/превлекоа`],
          },
          {
            mkd: `8. За*вчера мо*jата по*стара ќе*рка ги ___ (со*бере) си*те приjа*телки до*ма.`,
            answer: [`собра/собрав/собравме/собраа`],
          },
          {
            mkd: `9. Sво*нко ___ (чу*кне) на вра*та.`,
            answer: [`чукна/чукнав/чукнавме/чукнаа`],
          },
          {
            mkd: `10. Ла*ни мо*jот по*млад брат че*сто го ___ (резерви*ра) о*воj хо*тел.`,
            answer: [`резервираше/резервирав/резервиравме/резервираа`],
          },
          {
            mkd: `11. Мина*тиот вто*рник И*гор го ___ (резерви*ра) о*воj хо*тел.`,
            answer: [`резеврира/резервирав/резервиравме/резервираа`],
          },
          {
            mkd: `12. Дено*вите дире*кторот jа ___ (у*двои) пла*та.`,
            answer: [`удвои/удвоив/удвоивме/удвоиjа`],
          },
        ],
      },
    },
  ],
};
