import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-11",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Лето — любимое время года Ивана, потому что летом много солнца, тепло, можно купаться, загорать и ходить в одежде с 
        короткими рукавами. Наум больше всего любит весну, потому что ещё не жарко и всё цветёт. А Наташа любит зиму из-за зимних
        праздников. Шестого января в Македонии празднуют сочельник. Когда Наташа была маленькая, в этот день она и её брат вставали рано
        утром и вместе с другими детьми шли по домам и квартирам. Они поздравляли хозяев с сочельником, пели колядки и получали от взрослых
        грецкие орехи и конфеты. Дома они показывали друг другу, что получили. Их мама готовила постные блюда и пекла специальный хлеб, в
        который клала монетку. Вечером вся семья собиралась за столом. Их папа делил хлеб и давал каждому по кусочку. Человек, который
        получит кусочек с монеткой, будет счастлив весь следующий год. После ужина вся семья выходила на улицу. В каждом районе был костёр,
        вокруг которого собирались соседи, пили ракию, танцевали, пели и разговаривали.`,
        answer: [
          `Лето е најомилено годишно време на Иван затоа што во лето има многу сонце, топло е, може да се сонча и да се капи и да се оди по 
          кратки ракави. Наум најмногу сака пролет затоа што уште не е топло и се цути. А Наташа сака зима поради зимските празници. На
          шести јануари во Македонија се слави Бадник. Кога Наташа беше мала на овој ден таа и нејзиниот постар брат стануваа рано наутро
          и заедно со другите деца одеа по куки и станови. Им го честитаа Бадник на газдите, пееја коледарски песни и добиваа од возрасни
          ореви и бонбони. Дома си покажува кој што доби. Мајка им готвеше посни јаденьа и печеше специјален леб, погача, каде што ставаше
          паричка. Навечер целата фамилија се собираше на масата. Татко им го делеше лебот и му го даваше едно парче на секој. Човекот,
          којшто ке го добие парчето со паричката, ке биде срекен целата следна година. По вечера целата фамилија излегуваше надвор. Во
          секое маало имаше оган, околу којшто се собираа комшиите, пиеја ракија, играа, пееја и разговараа.`,
        ],
      },
    },
  ],
};
