import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-11",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Составьте предложения из данных слов, используя аорист или имперфект.`,
      ],

      content: {
        text: "<span>Сре*да, ни*е, сум, е*ден, ко*нцерт. — В сре*дата ни*е бе*вме на е*ден ко*нцерт.</span>",
        sentences: [
          {
            mkd: `1) jас, ле*гне, спи*е, по*лноќ — ___.`,
            answer: [`Jас легнав да спиjам во по*лноќ`],
          },
          {
            mkd: `2) тоj, ноќ, Го*ран, бо*ли, гла*ва — ___.`,
            answer: [`Таа ноќ Горан го болеше главата`],
          },
          {
            mkd: `3) дено*вите, слу*чаjно, ни*е, сре*тне, брат ти — ___.`,
            answer: [`Деновите случаjно ние го сретнавме брат ти`],
          },
          {
            mkd: `4) за*вчера, сум, пе*ток — ___.`,
            answer: [`Завечера беше петок`],
          },
          {
            mkd: `5) ми*нат, са*бота, Пе*ро, скр*ши, ра*ка — ___.`,
            answer: [`Минатата сабота Перо скрши рака`],
          },
          {
            mkd: `6) ка*де, ти, сум, Но*ва го*дина — ___ (?)`,
            answer: [`Каде ти беше **за / на** Нова година`],
          },
          {
            mkd: `7) то*а, се слу*чи, вто*ри, септе*мври — ___.`,
            answer: [`Тоа се случи на втори септември`],
          },
          {
            mkd: `8) ни*е, до*jде, пет, ми*нута, о*ткако, за*почне, ко*нцерт — ___.`,
            answer: [`Ние доjдовме пет минути откако започна концертот`],
          },
          {
            mkd: `9) ти, се, ро*ди, на*есен — ___(?)`,
            answer: [`Ти се роди наесен`],
          },
          {
            mkd: `10) Ру*сиjа, зи*ма, сум, ла*дно — ___.`,
            answer: [`Во Ру*сиjа **зиме / во зима** беше ладно`],
          },
          {
            mkd: `11) што, ви*е, пра*ви, вре*ме, о*дмор — ___(?)`,
            answer: [`Што вие правевте за време на одмор`],
          },
          {
            mkd: `12) ба*нка, сум, о*творен, 7, час, на*утро, 7, час, на*вечер — ___.`,
            answer: [
              `Банката беше отворена од 7 часот наутро до 7 часот навечер`,
            ],
          },
          {
            mkd: `13) го*сти, до*jде, е*ден, час, сва*дба — ___.`,
            answer: [`Гостите доjдоа еден час пред свадбата`],
          },
          {
            mkd: `14) штом, jас, сти*гне, до*ма, се истуши*ра — ___.`,
            answer: [`Штом стигнав дома се истуширав`],
          },
        ],
      },
    },
  ],
};
