import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-11",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Который час? — Сейчас половина третьего. — Ох, мы опаздываем. Поезд отправляется без пяти три. — Нет, на билете
        написано, что в двадцать минут четвёртого. У нас ещё есть время. 2. Друзья договорились встретиться тридцать первого декабря
        вечером. 3. В полночь мы поздравили друг друга с Новым годом. 4. В два часа ночи я уже спал. 5. На этой неделе у меня много
        работы. 6. В следующий вторник мы должны быть в Охриде, а в пятницу — в Кичево. 7. Мы позвоним вам на днях. 8. 8. Какой сегодня
        день недели? — Сегодня четверг. — Ох, а мне казалось, что уже пятница. 9. Вчера ночью я не мог спать, потому что соседи праздновали
        день рождения. 10. Какое сегодня число? — Восемнадцатое декабря. 11. Андрей родился 2 июля тысяча девятьсот шестьдесят четвёртого
        года. — Он выглядит старше. А сколько лет его жене? — Она на пять лет его моложе. 12. В прошлом году мы праздновали Новый год в
        Словении, в этом году хотим отпраздновать в Черногории. 13. Во время встречи дипломаты обсудили разные вопросы. 14. Осень — моё
        любимое время года, потому что осенью у меня день рождения. 15. Мы позвоним вам за десять минут до встречи. 16. Зимние праздники в
        России длятся с первого по восьмое января. 17. Мартина выпила лекарство через час после обеда. 18. Я приду через час. 19. Мы
        позвоним вам после завтрака. 20. Мы позвоним вам, после того как закончим работать.`,
        answer: [
          `1. Колку е часот? — Сега е два часот и половина. — Леле, доцниме. Возот тргнува во пет до три. — Не, на билетот пи́шува дека во
          три часот и дваесет минути. Имаме уште време. 2. Другарите се договорија да се сретнат на триесет и први декември навечер. 3. Во
          полноќ си ја честитавме Новата година. 4. Во два часот по полноќ веќе спиев. 5. Оваа недела имам многу работа. 6.
          **Наредниот / следниот** вторник треба да бидеме во Охрид, а в петок — во Кичево. 7. Ќе ви се јавиме деновиве. 8. Кој ден од
          неделата е денес? — Денес е четврток. — Леле, а мене ми се чинеше дека веќе е петок. 9. **Сношти / синоќа** не можев да спијам
          затоа што комшиите славеа роденден. 10. Кој датум сме денес? — Осумнаесетти декември. 11. Андреј се роди на втори јули илјада
          деветсто́тини осумдесет и прва година. — Изгледа постаро. А колку години има жена му? — Пет години е по́млада од него. 12. Минатата
          година (ја) славевме Нова(та) година во Словенија, оваа година сакаме да прославиме во Црна Гора. 13. За време на средбата
          дипломатите дискутираа за различни прашања. 14. Есен е мое најомилено годишно време затоа што наесен имам роденден. 15. Ќе ви се
          јавиме десет минути пред средбата. 16. Зимските празници во Русија траат од први до осми јануари. 17. Мартина го испи лекот еден
          час по ручекот. 18. Ќе дојдам за еден час. 19. Ќе ви се јавиме после појадокот. 20. Ќе ви се јавиме откако ќе завршиме со работа.
          `,
        ],
      },
    },
  ],
};
