import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-14`,
  sections: [
    {
      type: "lecture",
      subtitle: {
        ru: "ДИАЛОГ",
        mkd: "ДИЈАЛОГ",
      },
      content: {
        description: {
          mkd: `<em>На*таша и И*ван, На*ум и него*вата де*воjка Еми*лиjа го гле*даат фина*лето на Све*тското пр*венство во фу*дбал.</em>`,
          ru: `<em>Наташа и Иван, Наум и его девушка Эмилия смотрят финал чемпионата мира по футболу.</em>`,
        },
        dialogue: [
          {
            speaker: {
              id: `ivan`,
              mkd: `И*ван:`,
              ru: `Иван:`,
            },
            mkd: [
              `Не сум зна*ел дека фу*дбалот е то*лку попула*рен во Македо*ниjа. Си*те го гле*даат и ги зна*ат игра*чите.`,
              `Не сле*дам ра*комет, но сум слу*шнал за македо*нските коша*рки. Пред не*коjа го*дина осво*иjа пр*во ме*сто на е*вропско
              пр*венство.`,
              `Па, фу*дбал, ко*шарка, о*дбоjка, хо*кеj. Jас трени*рав ски*jање.`,
              `Не, го по*вредив во сообра*ќаjна не*среќа. О*ттогаш не гле*дам тр*ки на автомо*били.`,
              `Ќе шути*раат пена*ли. Аj ќе ви*диме, мо*жеби и до пена*ли ќе до*jде.`,
            ],
            ru: [
              `Я не знал, что футбол настолько популярен в Македонии. Все его смотрят, и все знают игроков.`,
              `Я не слежу за гандболом, но слышал о македонских баскетболистах. Несколько лет назад они завоевали первое место в 
              европейском чемпионате.`,
              `Ну, футбол, баскетбол, волейбол, хоккей. Я занимался горными лыжами.`,
              `Нет, я его повредил в аварии. С тех пор не смотрю автомобильные гонки.`,
              `Будут выполнять пенальти. Посмотрим, может быть, дойдёт и до пенальти`,
            ],
          },
          {
            speaker: {
              id: `naum`,
              mkd: `На*ум:`,
              ru: `Наум:`,
            },
            mkd: [
              `Да, фу*дбалот е мно*гу попула*рен, ги гле*даме и Ку*пот на УЕФА и Ли*гата на шампио*ните, но на*jмногу гле*даме 
              ра*комет. На*шата ракоме*тарска репрезента*циjа е мно*гу до*бра, и ма*шката и же*нската. Нео*дамна македо*нскиот клуб
              "Вардар" го со*влада проти*вникот во фина*лето и за пр*впат ста*на е*вропски пр*вак. Си*те нави*вавме ка*ко лу*ди`,
              `Да, ми*слам це*ла Македо*ниjа се со*бра да ги пре*чека на гла*вниот пло*штад ка*ко национа*лни хе*рои. А ко*и спо*ртови 
              се попула*рни во Молда*виjа?`,
              `А што се слу*чи? Па*дна?`,
              `Jас ни*когаш ни*што не сум трени*рал, но се*га тр*чам два-три па*ти не*делно и о*дам во вежба*лница. На*таша, а ти?`,
              `Ле*ле, ви*ди, ви*ди, што пра*ви голки*перот! За ма*лку ќе при*меше гол. А*ко при*мат гол, ќе и*ма продолже*ние.`,
            ],
            ru: [
              `Да, футбол очень популярен, мы смотрим и Кубок УЕФА, и Лигу чемпионов, но больше всего мы смотрим гандбол. Наша 
              сборная гандболистов очень хорошая, и мужская, и женская. Недавно македонский клуб "Вардар" стал европейским чемпионом.
              Мы все болели как сумашедшие.`,
              `Да, я думаю, вся Македония собралась, чтобы их встретить на главной площади как национальных героев. А какие виды спорта 
              популярны в Молдове?`,
              `А что случилось? Ты упал?`,
              `Я никогда ничем не занимался, но сейчас два-три раза в неделю бегаю и хожу в тренажёрный зал. Наташа, а ты?`,
              `Ох, смотри, смотри, что делает вратарь! Чуть было не пропустил гол. Если они получат гол, будет продолжение.`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На*таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `И*ван че*сто се ше*гува де*ка ќе бе*ше се*га шампио*н во ски*jање да не го повре*деше *р*бетот.`,
              `Jас о*дев на игроо*рна. То*а не е спорт, но ба*ра мно*гу си*ли и до*бра фи*зичка конди*циjа. И*гравме ра*злични 
              маке*донски о*ра. Че*сто пату*вавме во стра*нство. Еми*лиjа, а ти?`,
            ],
            ru: [
              `Иван часто шутит, что сейчас был бы чемпионат по горным лыжам, если бы не повредил позвоночник.`,
              `Я ходила на народные танцы. Это не спорт, но требует много сил и хорошей физической подготовки. Мы танцевали разные 
              македонские ора. Часто ездили за границу. Эмилия, а ты?`,
            ],
          },
          {
            speaker: {
              id: `еmilia`,
              mkd: `Еми*лиjа:`,
              ru: `Эмилия:`,
            },
            mkd: [
              `Ма*jка ми ме но*сеше на ба*летска шко*ла, но бр*гу ми здо*деа. Ќе до*jдев, ќе че*кав до*дека се со*берат дру*гите де*ца, 
              по*тоа ќе напра*вевме е*дна ве*жба и то*лку`,
              `А*ко за*врши нере*шено во дополни*телното вре*ме, ка*ко ќе се зна*е побе*дникот?`,
            ],
            ru: [
              `Моя мама водила меня в школу балета, но мне быстро надоело. Бывало, приду, жду, пока соберутся другие дети, потом мы 
              сделаем одно упражнение, и всё.`,
              `Если дополнительное время закончится вничью, как определят победителя?`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "naum", language: "ru", replyIndex: 0 },
          { speakerId: "naum", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },
          { speakerId: "naum", language: "ru", replyIndex: 1 },
          { speakerId: "naum", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "naum", language: "ru", replyIndex: 2 },
          { speakerId: "naum", language: "mkd", replyIndex: 2 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
          { speakerId: "naum", language: "ru", replyIndex: 3 },
          { speakerId: "naum", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "еmilia", language: "ru", replyIndex: 0 },
          { speakerId: "еmilia", language: "mkd", replyIndex: 0 },
          { speakerId: "naum", language: "ru", replyIndex: 4 },
          { speakerId: "naum", language: "mkd", replyIndex: 4 },
          { speakerId: "еmilia", language: "ru", replyIndex: 1 },
          { speakerId: "еmilia", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 4 },
          { speakerId: "ivan", language: "mkd", replyIndex: 4 },
        ],
      },
    },
  ],
};

//  ѐ
