import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-14",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "ба*ле*т",
            pron: "ба*лэ*т",
            ru: "балет",
          },
          {
            mkd: "ве*жба",
            pron: "вэ*жба",
            ru: "упражнение",
          },
          {
            mkd: "вежба*лница",
            pron: "вэжба*лница",
            ru: "тренажёрный зал",
          },
          {
            mkd: "гол",
            pron: "гол",
            ru: "гол, ворота",
          },
          {
            mkd: "го*лман",
            pron: "го*лман",
            ru: "вратарь",
          },
          {
            mkd: "е*вропски",
            pron: "э*вропски",
            ru: "европейский",
          },
          {
            mkd: "же*нски",
            pron: "жэ*нски",
            ru: "женский",
          },
          {
            mkd: "здо*дева",
            pron: "здо*дэва",
            ru: "надоедать",
          },
          {
            mkd: "здо*дее",
            pron: "здо*дээ",
            ru: "надоесть",
          },
          {
            mkd: "и*гроорен",
            pron: "и*гроорэн",
            ru: "связанный с танцами оро",
          },
          {
            mkd: "и*грач",
            pron: "и*грач",
            ru: "игрок",
          },
          {
            mkd: "клуб",
            pron: "клуб",
            ru: "клуб",
          },
          {
            mkd: "кон*диција",
            pron: "кон*дицийа",
            ru: "форма, сила",
          },
          {
            mkd: "ко*шарка",
            pron: "ко*шарка",
            ru: "баскетбол",
          },
          {
            mkd: "ко*шаркар",
            pron: "ко*шаркар",
            ru: "баскетболист",
          },
          {
            mkd: "коша*ркарка",
            pron: "коша*ркарка",
            ru: "баскетболистка",
          },
          {
            mkd: "куп",
            pron: "куп",
            ru: "кубок",
          },
          {
            mkd: "ли*га",
            pron: "ли*га",
            ru: "лига",
          },
          {
            mkd: "луд",
            pron: "лут",
            ru: "сумасшедший",
          },
          {
            mkd: "ма*шки",
            pron: "ма*шки",
            ru: "мужской",
          },
          {
            mkd: "на*вива",
            pron: "на*вива",
            ru: "болеть (за команду)",
          },
          {
            mkd: "не*делно",
            pron: "нэ*дэлно",
            ru: "в неделю",
          },
          {
            mkd: "не*решено",
            pron: "нэ*рэшэно",
            ru: "вничью",
          },
          {
            mkd: "не*среќа",
            pron: "нэ*срэк'а",
            ru: "несчастье",
          },
          {
            mkd: "о*дбојка",
            pron: "о*дбойка",
            ru: "волейбол",
          },
          {
            mkd: "о*ро",
            pron: "о*ро",
            ru: "национальный танец оро",
          },
          {
            mkd: "о*свои",
            pron: "о*свои",
            ru: "завоевать",
          },
          {
            mkd: "о*својува",
            pron: "о*свойува",
            ru: "завоёвывать",
          },
          {
            mkd: "о*ттогаш",
            pron: "о*ттогаш",
            ru: "с тех пор",
          },
          {
            mkd: "па*дне",
            pron: "па*днэ",
            ru: "упасть",
          },
          {
            mkd: "па*ѓа",
            pron: "па*г'а",
            ru: "падать",
          },
          {
            mkd: "пе*нал",
            pron: "пэ*нал",
            ru: "пенальти",
          },
          {
            mkd: "по*бедник",
            pron: "по*бэдник",
            ru: "победитель",
          },
          {
            mkd: "по*вреди",
            pron: "по*врэди",
            ru: "повредить",
          },
          {
            mkd: "повре*дува",
            pron: "поврэ*дува",
            ru: "повреждать",
          },
          {
            mkd: "попула*рен",
            pron: "попула*рэн",
            ru: "популярный",
          },
          {
            mkd: "пр*вак",
            pron: "пр*вак",
            ru: "победитель, занявший первое место, чемпион",
          },
          {
            mkd: "пр*венство",
            pron: "пр*вэнство",
            ru: "чемпионат",
          },
          {
            mkd: "при*ма",
            pron: "при*ма",
            ru: "принимать, получать",
          },
          {
            mkd: "при*ми",
            pron: "при*ми",
            ru: "принять, получить",
          },
          {
            mkd: "продолж*ение",
            pron: "продолжэ*ниэ",
            ru: "продолжение",
          },
          {
            mkd: "про*тивник",
            pron: "про*тивник",
            ru: "противник",
          },
          {
            mkd: "ра*комет",
            pron: "ра*комэт",
            ru: "гандбол",
          },
          {
            mkd: "рако*метар",
            pron: "рако*мэтар",
            ru: "гандболист",
          },
          {
            mkd: "ракоме*тарка",
            pron: "ракомэ*тарка",
            ru: "гандболистка",
          },
          {
            mkd: "*р*бетот",
            pron: "ы*рбэт",
            ru: "позвоночник",
          },
          {
            mkd: "репрезента*ција",
            pron: "рэпрэзэнта*цийа",
            ru: "сборная",
          },
          {
            mkd: "свет*ски",
            pron: "свэ*цки",
            ru: "мировой",
          },
          {
            mkd: "си*ла",
            pron: "си*ла",
            ru: "сила",
          },
          {
            mkd: "ски*јање",
            pron: "ски*йан'е",
            ru: "лыжный спорт",
          },
          {
            mkd: "сле*ди",
            pron: "слэ*ди",
            ru: "следить",
          },
          {
            mkd: "слу*шне",
            pron: "слу*шнэ",
            ru: "услышать",
          },
          {
            mkd: "со*влада",
            pron: "со*влада",
            ru: "одолеть",
          },
          {
            mkd: "сообра*ќаен",
            pron: "сообра*к'аэн",
            ru: "транспортный",
          },
          {
            mkd: "сообра*ќајна не*среќа",
            pron: "сообра*к'айнa нэ*срэк'а",
            ru: "транспортное происшествие, авария",
          },
          {
            mkd: "спорт (спор*тови)",
            pron: "спорт (спор*тови)",
            ru: "спорт (виды спорта)",
          },
          {
            mkd: "стра*нство",
            pron: "стра*нство",
            ru: "зарубежье",
          },
          {
            mkd: "трени*ра",
            pron: "трени*ра",
            ru: "тренировать, заниматься (спортом)",
          },
          {
            mkd: "тр*ка",
            pron: "тр*ка",
            ru: "гонка",
          },
          {
            mkd: "тр*ча",
            pron: "тр*ча",
            ru: "бегать, бежать",
          },
          {
            mkd: "фи*зички",
            pron: "фи*зички",
            ru: "физический",
          },
          {
            mkd: "фина*ле",
            pron: "фина*лэ",
            ru: "финал",
          },
          {
            mkd: "фу*дбал",
            pron: "фу*дбал",
            ru: "футбол",
          },
          {
            mkd: "хе*рој",
            pron: "хэ*рой",
            ru: "герой",
          },
          {
            mkd: "хо*кеј",
            pron: "хо*кэй",
            ru: "хоккей",
          },
          {
            mkd: "шампи*он",
            pron: "шампи*он",
            ru: "чемпион",
          },
          {
            mkd: "се ше*гува",
            pron: "сэ_шэ*гува",
            ru: "шутить",
          },
          {
            mkd: "шко*ла",
            pron: "шко*ла",
            ru: "школа",
          },
          {
            mkd: "шу*тира",
            pron: "шу*тира",
            ru: "ударять, ударить ногой по мячу",
          },
        ],
      },
    },
  ],
};
