import { TablesProps } from "@/types";

export const example4: TablesProps = {
  slug: "lesson-16",
  type: "example-4",
  subtitle: "ОГРАНИЧИТЕЛЬНЫЕ ПРИДАТОЧНЫЕ",
  content: {
    text: `Ограничительные придаточные предложения вводятся союзами <span>о*свен да</span> «кроме как», <span>о*свен што</span> «кроме того что», 
    <span>ме*сто да/на*место да</span> «вместо того чтобы»`,
    words: [
      {
        mkd: "Не*мам друг и*збор о*свен да се бо*рам.",
        ru: "У меня нет другого выхода, кроме как бороться.",
      },
      {
        mkd: "Сѐ е и*сто о*свен што и*маме по*малку ко*са.",
        ru: "Всё по-прежнему, только волос у нас стало меньше.",
      },
      {
        mkd: "На*место да ра*ботат по цел ден се ше*таат.",
        ru: "Вместо того чтобы работать, гуляют целыми днями.",
      },
    ],
  },
};
