import { ParagraphSectionsProps } from "@/types";

export const cardinalOrdinalNumerals: ParagraphSectionsProps = {
  type: "cardinal-ordinal-numerals",
  subtitle: "КОЛИЧЕСТВЕННЫЕ И ПОРЯДКОВЫЕ ЧИСЛИТЕЛЬНЫЕ",
  content: {
    text: `Количественные числительные обозначают количество предметов (<span>е́ден, два, три...</span>), а порядковые указывают их 
    порядковый номер в некоторой последовательности (<span>прв, втор, трет...</span>). Единицы отделяются от десятков/сотен союзом
    <span>«и»</span>: <span>три́есет и е́ден чо\u0301век</span>, <span>сто и е́ден чо\u0301век</span>, <span>три́есет и пр\u0301ви март</span>.

    Числительное <span>е́ден</span> меняется как прилагательное: <span>е́ден маж</span> «один мужчина», <span>е́дна жена</span>
    «одна женщина», <span>е́дно де\u0301те</span> «один ребёнок», <span>е́дни пантало\u0301ни</span> «одна пара брюк».

    Числительные <span>два</span>, <span>оба</span> меняются по родам, с существительными мужского рода употребляется форма
    <span>два</span>, <span>оба</span>, а с существительными женского и среднего рода — <span>две</span>, <span>обе</span>:
    <span>два авто́буса/авто́буси</span>, <span>жена</span> — <span>две же\u0301ни</span>, <span>ме\u0301сто</span> — <span>две ме\u0301ста</span>.

    Составные количественные числительные, оканчивающиеся на один и два, согласуются с определяемым существительным:
    <span>два́есет и е́ден авто́бус</span>, <span>два́есет и два авто́буса/авто́буси</span>, <span>два́есет и е́дна жена</span>,
    <span>два́есет и две же\u0301ни</span>, <span>два́есет и е́дно ме\u0301сто</span>, <span>два́есет и две ме\u0301ста</span>.

    В македонском языке есть также особые лично-мужские формы числительных, которые употребляются с названиями лиц мужского пола и групп,
    в которых есть хотя бы один мужчина: <span>два де\u0301на</span> «два дня», но <span>два́јца ма́жи</span> «двое мужчин»
    (форма <span>два ма́жи</span> возможна, но употребляется крайне редко). В основном используются следующие лично-мужские формы:
    <span>два́јца</span> «двое», <span>тро́јца</span> «трое», <span>четво́рица</span> «четверо», <span>пе́тмина</span> «пятеро»,
    <span>ше́стмина</span> «шестеро», <span>седу́ммина</span> «семеро», <span>осу́ммина</span> «восьмеро», <span>деве́тмина</span>
    «девятеро», <span>десе́тмина</span> «десятеро». Возможны, но крайне редки лично-мужские формы от других числительных.
    Образуются при помощи суффикса <span>«-мина»</span>: <span>две́сте — двесте́мина</span> , <span>две́сте и о́сум — двесте́ и осу́ммина</span>.
    `,
  },
};
