import { ParagraphSectionsProps } from "@/types";

export const finalPartCardinalOrdinalNumerals: ParagraphSectionsProps = {
  type: "final-part-cardinal-ordinal-numerals",
  content: {
    text: `Порядковые числительные с элементом <span>«-стоти»</span> и <span>«-илjадит»</span> обычно используются, когда речь идёт 
    о порядке при счёте (<span>по двестотен пат</span> «в двухсотый раз», <span>двеилјадита година</span> «двухтысячный год»),
    а с элементом <span>«-стотен»</span> и <span>«-илjаден»</span> — когда числительное характеризует объект, содержащий указанное число
    единиц (<span>50-илjадна воjска</span> войска» «50-тысячная армия»).

      В разговорной речи <span>пе́десет</span>, <span>педе́сетти</span>, <span>деве́десет</span>, <span>деведе́сетти</span>,
      <span>четиристо́тини</span>, <span>петистóтини</span>, <span>шестóтини</span>, <span>седумстóтини</span>, <span>осумстóтини</span>,
      <span>деветстóтини</span> произносятся как
      [[пэ́эсэт / пэ́эсэтти / дэвэ́эсэт / дэвэ́эсэтти / чэ́трсто / пэ́тсто / шэ́сто / сэ́думсто / о́сумсто / дэ́вэтсто]].

      При употреблении двух числительных, имеющих общую вторую часть, для обозначения приблизительного количества у первого
      числительного его общая часть сокращается: <span>пет-шéесет коли</span> — «пятьдеся́т-шестьдеся́т машин»
      (цифрами: <span>50–60 кóли</span>), <span>два-тро́jца</span> — «двое-трое».
    `,
  },
};
