import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-15",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "вест (ж.р.)",
            pron: "вэст",
            ru: "новость",
          },
          {
            mkd: "газ",
            pron: "гас",
            ru: "попа",
          },
          {
            mkd: "гас",
            pron: "гас",
            ru: "газ",
          },
          {
            mkd: "грама*тика",
            pron: "грама*тика",
            ru: "грамматика",
          },
          {
            mkd: "гре*шка",
            pron: "грэ*шка",
            ru: "ошибка",
          },
          {
            mkd: "дигита*лен",
            pron: "дигита*лэн",
            ru: "электронный, цифровой",
          },
          {
            mkd: "жи*вот",
            pron: "жи*вот",
            ru: "жизнь",
          },
          {
            mkd: "зву*чи",
            pron: "зву*чи",
            ru: "звучать",
          },
          {
            mkd: "и та*ка на*таму",
            pron: "и_та*ка_на*таму",
            ru: "и так далее",
          },
          {
            mkd: "ист",
            pron: "ист",
            ru: "такой же",
          },
          {
            mkd: "и*сто",
            pron: "и*сто",
            ru: "так же, также",
          },
          {
            mkd: "исто*рија",
            pron: "исто*рија",
            ru: "история",
          },
          {
            mkd: "книжа*рница",
            pron: "книжа*рница",
            ru: "книжный магазин",
          },
          {
            mkd: "курс",
            pron: "курс",
            ru: "курс",
          },
          {
            mkd: "на при*мер",
            pron: "на_при*мэр",
            ru: "например",
          },
          {
            mkd: "на*јде",
            pron: "на*јдэ",
            ru: "найти",
          },
          {
            mkd: "неза*висност (ж.р.)",
            pron: "нэза*висност",
            ru: "независимость",
          },
          {
            mkd: "се осамо*стои",
            pron: "сэ_осамо*стои",
            ru: "стать самостоятельным, независимым",
          },
          {
            mkd: "се осамосто*јува",
            pron: "сэ_осамосто*јува",
            ru: "становиться самостоятельным, независимым",
          },
          {
            mkd: "о*тпосле",
            pron: "о*тпослэ",
            ru: "потом, позднее, позже",
          },
          {
            mkd: "па*зи",
            pron: "па*зи",
            ru: "быть бдительным, беречь, беречься",
          },
          {
            mkd: "поне*когаш",
            pron: "понэ*когаш",
            ru: "иногда",
          },
          {
            mkd: "по*права",
            pron: "по*права",
            ru: "исправлять",
          },
          {
            mkd: "по*прави",
            pron: "по*прави",
            ru: "исправить",
          },
          {
            mkd: "се пре*сели",
            pron: "сэ_прэ*сэли",
            ru: "переехать, переселиться",
          },
          {
            mkd: "се пресе*лува",
            pron: "сэ_прэсэ*лува",
            ru: "переезжать, переселяться",
          },
          {
            mkd: "при*ватен",
            pron: "при*ватэн",
            ru: "частный",
          },
          {
            mkd: "при*мер",
            pron: "при*мэр",
            ru: "пример",
          },
          {
            mkd: "про*блем",
            pron: "про*блэм",
            ru: "проблема",
          },
          {
            mkd: "про*ток",
            pron: "про*ток",
            ru: "пролив",
          },
          {
            mkd: "ра*злика",
            pron: "ра*злика",
            ru: "различие",
          },
          {
            mkd: "ра*спад",
            pron: "ра*спад",
            ru: "распад",
          },
          {
            mkd: "ре*чник",
            pron: "рэ*чник",
            ru: "словарь",
          },
          {
            mkd: "сам",
            pron: "сам",
            ru: "сам, самостоятельно, один",
          },
          {
            mkd: "сли*чен",
            pron: "сли*чэн",
            ru: "похожий",
          },
          {
            mkd: "сли*чно",
            pron: "сли*чно",
            ru: "похоже, похожим образом",
          },
          {
            mkd: "сме*шен",
            pron: "смэ*шэн",
            ru: "смешной",
          },
          {
            mkd: "совре*мен",
            pron: "со*врэмэн",
            ru: "современный",
          },
          {
            mkd: "со*сема",
            pron: "со*сэма",
            ru: "совсем",
          },
          {
            mkd: "срам",
            pron: "срам",
            ru: "стыд",
          },
          {
            mkd: "ста*ндарден",
            pron: "ста*ндардэн",
            ru: "стандартный",
          },
          {
            mkd: "те*жок",
            pron: "те*жок",
            ru: "тяжёлый",
          },
          {
            mkd: "текст",
            pron: "тэкст",
            ru: "текст",
          },
          {
            mkd: "те*чно",
            pron: "тэ*чно",
            ru: "бегло",
          },
          {
            mkd: "те*шко",
            pron: "тэ*шко",
            ru: "тяжело",
          },
          {
            mkd: "у*чебник",
            pron: "у*чэбник",
            ru: "учебник",
          },
          {
            mkd: "фо*рма",
            pron: "фо*рма",
            ru: "форма",
          },
        ],
      },
    },
  ],
};
