import { TablesProps } from "@/types";

export const example3: TablesProps = {
  slug: "lesson-5",
  type: "example-3",
  content: {
    text: `Если прямой объект выражен неопределённой формой существительного (или его эквивалента), то он никак особо не оформляется:
    `,
    words: [
      {
        mkd: `Са*кам да чи*там кни*ги.`,
        ru: `Я люблю читать книги.`,
      },
      {
        mkd: `Се*га чи*там е*дна инте*ресна кни*га.`,
        ru: `Сейчас я читаю одну интересную книгу.`,
      },
      {
        mkd: `Купу*ваме две пи*ци.`,
        ru: `Мы покупаем две пиццы.`,
      },
    ],
  },
};
