import { TablesProps } from "@/types";

export const example7: TablesProps = {
  slug: "lesson-5",
  type: "example-7",
  content: {
    text: `После глагола <span>и*ма</span> (в личных и безличных предложениях) прямой объект обычно стоит в неопределённой форме. Если
      же контекст требует определённой формы, то прямой объект удваивается:
    `,
    words: [
      {
        mkd: `Jас jа и*мам тво*jата кни*га.`,
        ru: `Твоя книга у меня.`,
      },
      {
        mkd: `О*вие кни*ги ги и*ма са*мо о*вде.`,
        ru: `Эти книги есть только здесь.`,
      },
    ],
  },
};
