import { TablesProps } from "@/types";

export const example7: TablesProps = {
  slug: "lesson-5",
  type: "example-7",
  content: {
    text: `После глагола <span>и\u0301ма</span> (в личных и безличных предложениях) прямой объект обычно стоит в неопределённой форме. Если
      же контекст требует определённой формы, то прямой объект удваивается:
    `,
    words: [
      {
        mkd: `Jас jа и\u0301мам тво\u0301jата кни\u0301га.`,
        ru: `Твоя книга у меня.`,
      },
      {
        mkd: `О\u0301вие кни\u0301ги ги и\u0301ма са\u0301мо о\u0301вде.`,
        ru: `Эти книги есть только здесь.`,
      },
    ],
  },
};
