import { TablesProps } from "@/types";

export const example8: TablesProps = {
  slug: "lesson-5",
  type: "example-8",
  subtitle: "СОЧИНИТЕЛЬНЫЕ СОЮЗЫ",
  content: {
    subtitle: "СОЕДИНИТЕЛЬНЫЕ СОЮЗЫ",
    text: `Популярные соединительные союзы: <span>и</span> «и», <span>и\u0301сто и</span> «также и», <span>ка\u0301ко и</span> «а также»,
    <span>ни — ни</span> «ни-ни», <span>ни\u0301ту — ни\u0301ту</span> «ни-ни», <span>не са\u0301мо (што) — ту\u0301ку и</span> «не только, но и;»
    <span>па</span> «и, затем», <span>та</span> «и», <span>ем</span> «и» (последние три имеют разговорную окраску).`,
    words: [
      {
        mkd: `Пр\u0301во ќе вле\u0301зе тоj, па ти.`,
        ru: `Сначала войдет он, затем ты.`,
      },
      {
        mkd: `Де\u0301тево ни\u0301ту jа\u0301де ни\u0301ту пи\u0301е.`,
        ru: `Ребёнок ни ест, ни пьёт.`,
      },
      {
        mkd: `Ем са\u0301кам да го ви\u0301дам, ем се пла\u0301шам о\u0301д не\u0301го.`,
        ru: `И увидеть его хочу, и боюсь его.`,
      },
      {
        mkd: `Не се среќа\u0301ваат са\u0301мо со\u0301 ме\u0301не, ту\u0301ку и со дру\u0301гите.`,
        ru: `Они встречаются не только со мной, но и с другими.`,
      },
    ],
  },
};
