import { TablesProps } from "@/types";

export const example4: TablesProps = {
  slug: "lesson-5",
  type: "example-4",
  content: {
    text: `Если прямой объект выражен именем собственным, определённой формой существительного (или его эквивалента), то он удваивается —
    перед глаголом ставится краткая форма винительного падежа личных местоимений 3-го лица: <span>го</span>, <span>jа</span>,
    <span>ги</span>. Если существительное (его эквивалент) относится к мужскому или среднему роду, используется частица <span>го</span>,
    для женсокого — <span>jа</span>, для множественного числа — <span>ги</span>.
    `,
    words: [
      {
        mkd: `Го знам И*ван.`,
        ru: `Я знаю Ивана.`,
      },
      {
        mkd: `Jа знам Ма*риja.`,
        ru: `Я знаю Марию.`,
      },
      {
        mkd: `Ги знам И*ван и Ма*риja.`,
        ru: `Я знаю Ивана и Марию.`,
      },
      {
        mkd: `Го че*кам мо*jот а*втобус.`,
        ru: `Я жду мой автобус.`,
      },
      {
        mkd: `Го зна*еме то*а.`,
        ru: `Мы это знаем.`,
      },
      {
        mkd: `Са*кам да jа про*читам о*ваа кни*га.`,
        ru: `Я хочу прочитать эту книгу.`,
      },
      {
        mkd: `Му ги купу*ваме о*вие две пи*ци.`,
        ru: `Мы покупаем ему эти две пиццы.`,
      },
      {
        mkd: `Ги зна*еме си*те.`,
        ru: `Мы знаем всех.`,
      },
    ],
  },
};
