import { TablesProps } from "@/types";

export const example8: TablesProps = {
  slug: "lesson-5",
  type: "example-8",
  subtitle: "СОЧИНИТЕЛЬНЫЕ СОЮЗЫ",
  content: {
    subtitle: "СОЕДИНИТЕЛЬНЫЕ СОЮЗЫ",
    text: `Популярные соединительные союзы: <span>и</span> «и», <span>и*сто и</span> «также и», <span>ка*ко и</span> «а также»,
    <span>ни — ни</span> «ни-ни», <span>ни*ту — ни*ту</span> «ни-ни», <span>не са*мо (што) — ту*ку и</span> «не только, но и;»
    <span>па</span> «и, затем», <span>та</span> «и», <span>ем</span> «и» (последние три имеют разговорную окраску).`,
    words: [
      {
        mkd: `Пр*во ќе вле*зе тоj, па ти.`,
        ru: `Сначала войдет он, затем ты.`,
      },
      {
        mkd: `Де*тево ни*ту jа*де ни*ту пи*е.`,
        ru: `Ребёнок ни ест, ни пьёт.`,
      },
      {
        mkd: `Ем са*кам да го ви*дам, ем се пла*шам о*д не*го.`,
        ru: `И увидеть его хочу, и боюсь его.`,
      },
      {
        mkd: `Не се среќа*ваат са*мо со* ме*не, ту*ку и со дру*гите.`,
        ru: `Они встречаются не только со мной, но и с другими.`,
      },
    ],
  },
};
