import { TablesProps } from "@/types";

export const example10: TablesProps = {
  slug: "lesson-5",
  type: "example-10",
  content: {
    subtitle: "ПРОТИВИТЕЛЬНЫЕ СОЮЗЫ",
    text: `Популярные противительные союзы: <span>а</span> «а», <span>но</span> «но», <span>ту*ку</span> «но», <span>не — ту*ку</span>
    «не-а», <span>меѓу*тоа</span> «но, между тем», <span>пак</span> «а, но», <span>(а) ка*моли</span> «не то что»,
    <span>са*мо (што)</span> «только», <span>еди*нствено што</span> «только», <span>о*свен што</span> «только»,
    <span>а*ма</span> «но», <span>а*ми</span> «но», <span>а*ли</span> «но» (последние три имеют разговорную окраску).`,
    words: [
      {
        mkd: `Та*а не* са*ка да ме ви*ди, а ка*моли да ми по*могне.`,
        ru: `Она видеть меня не хочет, не то что помочь мне.`,
      },
      {
        mkd: `Ни*што не ми ка*жува, о*свен што се сме*е на мо*те збо*рови.`,
        ru: `Ничего мне не говорит, только смеётся над моими словами.`,
      },
      {
        mkd: `Не го че*каме А*цо, ту*ку те*бе.`,
        ru: `Мы ждём не Ацо, а тебя.`,
      },
    ],
  },
};
