import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-13",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Сегодня мы с Иваном пошли на пляж, потом вернулись домой, приняли душ и пошли в наше любимое кафе. Там мы выпили кофе 
        и пошли в бутик с украшениями. Я очень давно хотела купить что-нибудь с охридским жемчугом. Охридский жемчуг делается из чешуек
        рыбы уклейки и очень популярен в Македонии. Мне понравился один браслет из серебра с жемчугом. Я хотела заплатить картой, но
        оказалось, что кошелька в сумке нет. Я попросила продавщицу отложить браслет. Мы с Иваном вернулись в кафе и спросили официанта,
        не видел ли он кошелёк. Официант сказал, что за нашим столиком после нас никто не сидел и что какой-то молодой человек с тёмными
        волосами взял что-то с пола. Это точно был мой кошелёк! Я разнервничалась, потому что в кошельке были не только деньги и
        дорожный чек, но и личная карта. Иван сказал, чтобы я позвонила в банк заблокировать карточку. Потом мы поехали в полицию, чтобы
        зарегистрировать, что у меня украли деньги, карточку и дорожный чек.`,
        answer: [
          `Денес со Иван отидовме на плажа, потоа се вративме дома, се истуширавме, јадевме и отидовме во нашето омилено кафуле. Таму 
          испивме кафе и отидовме во еден бутик со накит. Многу одамна сакав да купам нешто со охридски бисер. Охридскиот бисер се прави
          од крлушките на рибата плашичка и е многу популарен во Македонија. Ми се допадна една белезица од сребро со бисер. Сакав да
          платам со картичка, но излезе дека паричникот го нема во чантата. Ја замолив продавачката да ја тргне белезицата настрана. Се
          вративме со Иван во кафулето и го прашавме келнерот дали го видел паричникот. Келнерот кажа дека на нашата маса никој не седел
          по нас и дека некој млад човек со темна коса зел нешто од подот. Тоа сигурно бил мојот паричник! Се изнервирав затоа што во
          паричникот немаше само пари и патен чек, туку и лична карта. Иван кажа да се јавам во банката да ја блокирам картичката. Потоа
          отидовме во полиција да пријавиме дека ми ги украле личната карта, картичката и патниот чек.`,
        ],
      },
    },
  ],
};
