import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Поставьте глаголы в нужную форму. Переведите со словарём.`],
      content: {
        sentences: [
          {
            mkd: `Ни*когаш не ___ (фа*рба, jас) коса, но пред не*колку де*на ___ (забе*лежи) не*колку бе*ли влакна и ___ (ре*ши) 
                де*ка вре*ме е да по*чнам.`,
            answer: [`сум фарбала`, `забележав`, `решив`],
          },
          {
            mkd: `Вче*ра ___ (о*тиде) на фри*зер.`,
            answer: [`отидов`],
          },
          {
            mkd: `Фризе*рката ми пре*дложи да jа и*сфарбам ко*сата цр*вена. Jа ___ (за*моли, jас) да о*дбере не*коjа бо*jа по*блиска 
            до мо*jата косте*нлива ко*са.`,
            answer: [`замолив`],
          },
          {
            mkd: `Фризе*рката ми jа ___ (и*змие) ко*сата, ___ (ста*ви) бо*jа и ___ (ка*же) де*ка тре*ба да по*чекам ма*лку.`,
            answer: [`изми`, `стави`, `кажа`],
          },
          {
            mkd: `Во меѓу*време ми ги ___ (сре*ди) ве*ѓите и но*ктите, ___ (ста*ви) лак.`,
            answer: [`среди`, `стави`],
          },
          {
            mkd: `По*тоа пак ми jа ___ (и*змие) ко*сата, ма*лку jа ___ (скра*ти), jа ___ (и*суши) и jа ___ (фени*ра).`,
            answer: [`изми`, `скрати`, `исуши`, `фенираше`],
          },
          {
            mkd: `___ (о*стане, jас) задо*волна.`,
            answer: [`Останав`],
          },
        ],
      },
    },
  ],
};
