import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения по образцу.`],
      content: {
        text: "<span>Ни*е го резерви*равме хо*телот. — И*ван ка*жа де*ка ни*е сме го резерви*рале хо*телот.</span>",

        sentences: [
          {
            mkd: `1. Анаста*сиjа се ра*зведе од сво*jот втор маж ___.`,
            answer: [`Иван кажа дека Анастасиjа се развела од своjот втор маж`],
          },
          {
            mkd: `2. Ко*га Жи*вко и*маше 16 го*дини бе*ше мно*гу де*бел ___.`,
            answer: [
              `Иван кажа дека кого Живко имал 16 години бил многу дебел`,
            ],
          },
          {
            mkd: `3. На*шата сметководи*телка jа и*сфарба ко*сата цр*на ___.`,
            answer: [
              `Иван кажа дека нашата сметководителка jа исфарбала косата црна`,
            ],
          },
          {
            mkd: `4. Ни*е не му се jа*вивме на раководи*телот ___.`,
            answer: [`Иван кажа дека ние не му се jавиле на раководителот`],
          },
          {
            mkd: `5. Ви*е се изнерви*равте по*ради кра*жбата ___.`,
            answer: [`Иван кажа дека вие се изнервирале поради кражбата`],
          },
          {
            mkd: `6. Ве*сна и Ри*сте се зе*доа ___.`,
            answer: [`Иван кажа дека Весна и Ристе се зеле`],
          },
          {
            mkd: `7. Ти се о*жени ___.`,
            answer: [`Иван каже дека ти се оженил`],
          },
          {
            mkd: `8. Ви*е се ома*живте ___.`,
            answer: [`Иван каже дека вие се омажеле`],
          },
          {
            mkd: `9. Анѓа не*маше па*ри за пода*роци ___.`,
            answer: [`Иван каже дека Анѓа немала пари за подароци`],
          },
          {
            mkd: `10. Во продавни*цата не*маше та*кви панта*лони ___.`,
            answer: [`Иван каже дека во продавницата немало такви панталони`],
          },
          {
            mkd: `11. Сна*а ми се изнерви*ра по*ради мо*ите со*вети ___.`,
            answer: [
              `Иван каже дека снаа ми се изнервирала поради моите совети`,
            ],
          },
          {
            mkd: `12. Ма*рко те при*jави во поли*циjа за*тоа што ти му jа о*тру ма*чката ___.`,
            answer: [
              `Иван каже дека Марко те приjавил во полициjа затоа што ти му jа отрул мачката`,
            ],
          },
        ],
      },
    },
  ],
};
