import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-13",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Я всю неделю улаживаю проблемы нашей компании. — Чьи проблемы? — Нашей компании. 2. На следующей неделе я буду 
        улаживать разные проблемы. 3. Я не буду улаживать твои проблемы. 4. Когда я улажу все проблемы, я позвоню нашим клиентам. 5. Если
        я не буду улаживать проблемы нашей компании, счета компании заблокируют. 6. Если я не улажу все проблемы до пятницы, я попрошу
        тебя помочь мне. 7. Я никогда не улаживал его проблемы. 8. В прошлый вторник весь день я улаживал проблемы своих племянников.
        9. Дядя сказал, что я никогда не улаживал свои проблемы! Это неправда!`,
        answer: [
          `1. Цела недела ги средувам проблемите на нашата компанија. — Чии проблеми? — На нашата компанија. 2. Наредната недела ќе
          средувам различни проблеми. 3. Нема да ги средувам твоите проблеми. 4. Кога ќе ги средам сите проблеми, ќе им се јавам на
          нашите клиенти. 5. Ако не ги средувам проблемите на нашата компанија, сметките на компанијата ќе ги блокираат. 6. Ако не ги
          средам сите проблеми до петокот, ќе те замолам да ми помогнеш. 7. Никогаш не сум ги средувал неговите проблеми. 8. Минатиот
          вторник цел ден ги средував проблемите на моите внуци. 9. Чичко ми кажа дека никогаш не сум ги средувал **моите / своите**
          проблеми! Тоа не е вистина!`,
        ],
      },
    },
  ],
};
