import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Соедините два предложения, используя союз <span>и*ако</span>.`],
      content: {
        text: "<span>Сла*вица до*jде. Не jа пока*нивме. — Сла*вица до*jде и*ако не jа пока*нивме.</span>",

        sentences: [
          {
            mkd: `1. И*лиjа по*беди на ко*нцертот. Не се чувству*ваше до*бро. ___`,
            answer: [`Илиjа победи на концертот иако не се чувствуваше добро`],
          },
          {
            mkd: `2. Фризе*рката не*маше мно*гу и*скуство. Ми на*прави мно*гу у*бава фризу*ра. ___`,
            answer: [
              `Иако фризерката немаше многу искуство, ми направи многу убава фризура`,
            ],
          },
          {
            mkd: `3. Ни*што не мо*жам да про*читам. Но*сам ле*ќи. ___`,
            answer: [`Ништо не можам да прочитам иако носам леќи`],
          },
          {
            mkd: `4. Ѓо*рѓи на*прави тетова*жа. Ма*jка му бе*ше про*тив. ___`,
            answer: [`Ѓорѓи направи тетоважа иако маjка му беше против`],
          },
          {
            mkd: `5. О*воj лосио*н за по бри*чење е мно*гу скап. Ма*рjан го ку*пи. ___`,
            answer: [
              `Иако овоj лосион за по бричење е многу скап, Марjан го купи`,
            ],
          },
          {
            mkd: `6. Дире*кторот не бе*ше задо*волен. Ги сре*дивме си*те докуме*нти. ___`,
            answer: [
              `Директорот не беше задоволен иако ги средивме сите документи`,
            ],
          },
          {
            mkd: `7. На*шиот програме*р и*ма че*шел. Ќе*лав е. ___`,
            answer: [`Нашиот програмер има чешел иако ќелав е`],
          },
          {
            mkd: `8. О*воj пат забо*равив до зе*мам че*тка за за*би. Се*когаш jа зе*мам. ___`,
            answer: [
              `Овоj пат заборавив до земам четка за заби иако секогаш jа земам`,
            ],
          },
        ],
      },
    },
  ],
};
