import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Составьте предложения из данных слов, используя би-конструкцию.`,
      ],

      content: {
        text: "<span>Ко*лку, чи*ни, тоj, беле*зица? — Ко*лку би чи*нела та*а биле*зица?</span>",
        sentences: [
          {
            mkd: `1) Jас, пла*ти, ка*ричка — ___.`,
            answer: [`Jас би **платил / платила** со картичка`],
          },
          {
            mkd: `2) Ви*е, мо*же, ни*е, по*могне — ___.`,
            answer: [`Вие би можеле да ни помогнете`],
          },
          {
            mkd: `3) На*скоро, jас, се вра*ти — ___.`,
            answer: [`Jас наскоро би се **вратил / вратила**`],
          },
          {
            mkd: `4) Ду*ри, се*стра ми, но*си, о*воj, здо*лниште — ___.`,
            answer: [`Дури сестра ми би го носела ова здолниште`],
          },
          {
            mkd: `5) Наш, роди*тели, не, се*ди, о*воj, слатка*рница — ___.`,
            answer: [`Нашите родители не би седеле во оваа слаткарница`],
          },
          {
            mkd: `6) Ба*нка, блоки*ра, не*гов, ка*ртичка — ___.`,
            answer: [`Банката би jа блокирала неговата картичка`],
          },
          {
            mkd: `7) Ка*ко, ти, иско*ристи, тоj, па*ри — ___(?)`,
            answer: [`Како ти би ги **искористил / искористила** тие пари`],
          },
          {
            mkd: `8) Ни*е, при*jави, кра*жба, поли*циjа — ___.`,
            answer: [`Ние би jа приjавиле кражбата во полициjа`],
          },
          {
            mkd: `9) Коj, у*краде, ту*ка, твоj, па*ричник — ___(?)`,
            answer: [`Коj би го украл тука твоjот паричник`],
          },
          {
            mkd: `10) Ке*лнер, не, у*спее, ни*што, забе*лежи — ___.`,
            answer: [`Келнерот не би успеал ништо да забележи`],
          },
          {
            mkd: `11) Ни*е, са*ка, по*могне, твоj, роди*тели — ___.`,
            answer: [`Ние би сакале да им помогнеме на твоите родители`],
          },
          {
            mkd: `12) Пра*вник, про*вери, о*воj, докуме*нт, у*ште е*днаш — ___.`,
            answer: [`Правникот би го проверил овоj документ уште еднаш`],
          },
        ],
      },
    },
  ],
};
