import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте данные слова в подходящее место:
        
        <span>**ви*ткана, блу*за, си*ни, пла*чи**</span>
        
        (Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
      проверить свою работу нажав на кнопку "Проверить мою работу".)`,
      ],
      content: {
        sentences: [
          {
            mkd: `— Де*воjче, зошто плачеш? — Jа и*згубив ма*jка ми. — А ка*ко и*згледа тво*jата ма*jка? — И*ма го*леми о*чи ___ ка*ко 
            не*бо и до*лга ___ цр*на коса. И бе*нка над у*стата. — А ка*ко бе*ше обле*чена? — Jа но*сеше мо*jата оми*лена ___ со Ми*ки
            Ма*ус и фа*рмерки. — А ка*ко се ви*ка? — Ма*ма. — А ка*ко се ви*каш ти? — Е*лена. — До*бро, Е*лена, не ___, се*га ќе jа
            на*jдеме тво*jата ма*jка`,
            answer: [`сини`, `виткана`, `блуза`, `плачи`],
          },
        ],
      },
    },
  ],
};
