import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте подходящее словосочетание:
        
        <span>**ду*ри и да, ко*лку и да, коj и да, што и да, ко*га и да**</span>
        
        (Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
      проверить свою работу нажав на кнопку "Проверить мою работу".)`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. Мо*же да до*jдеш ___ по*сакаш.`,
            answer: [`кога и да`],
          },
          {
            mkd: `2. ___ не сте љу*бител на фу*дбал, со задо*волство ќе jа гле*дате о*ваа сни*мка.`,
            answer: [`дури и да`],
          },
          {
            mkd: `3.  ___ jа запо*знае на*шата секрета*рка, ѝ се восхи*тува.`,
            answer: [`коj и да`],
          },
          {
            mkd: `4.  ___ ти ка*жа Jа*не не сме*еш да реаги*раш ва*ка.`,
            answer: [`што и да`],
          },
          {
            mkd: `5. ___ си млад тре*ба да ги па*метиш ти*е на*стани.`,
            answer: [`колку и да`],
          },
        ],
      },
    },
  ],
};
