import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-13",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения по образцу.`],
      content: {
        text: "<span>Да*ли ќе го ку*пите о*воj ма*нтил? — Да*ли би го ку*пиле о*воj ма*нтил?</span>",

        sentences: [
          {
            mkd: `1. Да*ли са*каш да jа по*каниш И*скра ___?`,
            answer: [`Дали би **сакал / сакала** да jа поканиш Искра`],
          },
          {
            mkd: `2. На*дица не*ма да те препо*знае ___.`,
            answer: [`Надица не би те препознала`],
          },
          {
            mkd: `3. Ќе им ка*жете за кра*жбата ___?`,
            answer: [`Вие би им кажале за кражбата`],
          },
          {
            mkd: `4. Дра*ган ќе се на*пие ка*фе ___.`,
            answer: [`Драган би се напил кафе`],
          },
          {
            mkd: `5. Ни*е ќе jа зе*меме Са*ња со нас ___.`,
            answer: [`Ние би jа зеле Сања со нас`],
          },
          {
            mkd: `6. Не*ма да ви по*могнам во та*ква ситуа*циjа ___.`,
            answer: [`Тие не би ви помогнале во таква ситуациjа`],
          },
          {
            mkd: `7. Де*тето ќе пла*че ___.`,
            answer: [`Де*тето би плачело`],
          },
          {
            mkd: `8. Не*ма да се со*гласам на та*кво не*што ___.`,
            answer: [`Jас не си се **согласил / согласила** на такво нешто`],
          },
          {
            mkd: `9. Ќе го пра*шам чи*чко ти ___.`,
            answer: [`Jас би го **прашал / прашала** чичко ти`],
          },
          {
            mkd: `10. Тре*ба да по*чнат прего*вори ___.`,
            answer: [`Би требало да почнат преговори`],
          },
          {
            mkd: `11. Не*ма да о*тидам без те*бе ___.`,
            answer: [`Jас не би **отишол / отишла**`],
          },
          {
            mkd: `12. Да*ли са*кате да ви на*правам маники*р ___?`,
            answer: [`Дали би сакале да ви направам маникир`],
          },
        ],
      },
    },
  ],
};
