import { TablesProps } from "@/types";

export const example3: TablesProps = {
  slug: "lesson-15",
  type: "example-3",
  content: {
    text: `Порядок частиц: 1) отрицательная частица <span>не</span>, 2) краткое местоимение в форме дательного падежа, 3) краткое 
    местоимение в форме винительного падежа или возвратное местоимение <span>се</span>, 4) вспомагательный глагол «быть» в форме
    прошедшего времени: <span>не се бе*а разде*лиле</span> «они не разделились», <span>му се бе*ше jа*вил</span> «он ему позвонил».
    Отметим, что в художественной литературе встречаются примеры и с другим порядком слов:`,
    words: [
      {
        mkd: "Што бе*ше се за*борчил за ку*ќата, вра*тил.",
        ru: "Он вернул то, что взял в долг на дом.",
      },
    ],
  },
};
