import { TablesProps } from "@/types";

export const example5: TablesProps = {
  slug: "lesson-14",
  type: "example-5",
  subtitle: `ПРИДАТОЧНЫЕ СРАВНЕНИЯ`,
  content: {
    text: `Придаточные предложения со значением сравнения вводятся союзами <span>ка*ко да</span>, <span>не*баре</span>, 
    <span>ка*ко бо*жем</span>, <span>бо*жем</span> «словно», «как будто».`,
    words: [
      {
        mkd: "Се пра*ви ка*ко да не ме гле*да.",
        ru: "Он делает вид, как будто меня не видит.",
      },
      {
        mkd: "Ги ка*ра не*баре се ти*е де*ца.",
        ru: "Он их ругает, словно они дети.",
      },
      {
        mkd: "Ва*квиот о*дговор сугери*ра ка*ко не*баре ни*што да не мо*жело да се на*прави.",
        ru: "Такой ответ подразумевает, что будто бы ничего нельзя было сделать.",
      },
      {
        mkd: "Се пре*права, бо*жем ни*што не зна*е.",
        ru: "Он делает вид, как будто ничего не знает.",
      },
      {
        mkd: "Се на*веда ка*ко бо*жем ќе по*права не*што.",
        ru: "Он нагнулся так, словно собрался что-то ремонтировать.",
      },
    ],
  },
};

//     <span></span> «» ѐ
