import { TablesProps } from "@/types";

export const example2: TablesProps = {
  slug: "lesson-15",
  type: "example-2",
  content: {
    text: `Плюсквамперфект также употребляется для выражения предположения на основе имеющихся данных о действии, которое произошло до 
    некоторого момента в прошлом.`,
    words: [
      {
        mkd: "Сти*гнавме на стани*цата, та*му бе*ше пра*зно. Во*зот бе*ше за*минал.",
        ru: "Мы приехали на вокзал, там было пусто. Поезд ушёл.",
      },
    ],
  },
};
