import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-4`,
  sections: [
    {
      type: "lecture",
      subtitle: [`ДИАЛОГ`, `<span>ДИЈАЛОГ</span>`],
      content: {
        description: {
          mkd: `По ка\u0301фето со приjате\u0301лите На\u0301таша и И\u0301ван ше\u0301таат. Пр\u0301во о\u0301дат по ке\u0301jот
          по\u0301краj Ва\u0301рдар до Каме\u0301ниот мост. Мо\u0301стот е си\u0301мбол на Ско\u0301пjе. Примину\u0301ваат пре\u0301ку
          не\u0301го и разгледу\u0301ваат на о\u0301колу. На\u0301таша ве\u0301ли де\u0301ка и\u0301ма мно\u0301гу но\u0301ви и\u0301згради.
          Пр\u0301впат ги гле\u0301да.`,
          ru: `После кофе с приятелями Наташа и Иван гуляют. Сначала они идут по набережной вдоль Вардара до Каменного моста. Мост —
          символ Скопье. Они переходят через него и осматриваются вокруг. Наташа говорит, что очень много новых зданий. Она впервые их видит.`,
        },
        dialogue: [
          {
            speaker: {
              id: `passerby`,
              mkd: `Мину\u0301вачот:`,
              ru: `Прохожий:`,
            },
            mkd: [
              `Од ле\u0301вата стра\u0301на се згра\u0301дите на Музе\u0301jот на македо\u0301нската бо\u0301рба и Музе\u0301jот на
              холока\u0301устот, а од де\u0301сната е Археоло\u0301шкиот му\u0301зеj на Македо\u0301ниjа.`,
            ],
            ru: [
              `Слева — здания Музея македонской борьбы и Музея холокоста, а справа — Археологический музей Македонии.`,
            ],
          },
          {
            speaker: {
              id: `ivan`,
              mkd: `И\u0301ван:`,
              ru: `И\u0301ван:`,
            },
            mkd: [
              `У\u0301тре мо\u0301же да до\u0301jдеме ту\u0301ка. Са\u0301кам да ви\u0301дам што и\u0301ма вна\u0301тре.`,
              `А\u0301ко и\u0301маме вре\u0301ме, задолжи\u0301телно ќе jа посе\u0301тиме. А\u0301jде да о\u0301диме пона\u0301таму.`,
              `Ми се до\u0301паѓа пла\u0301нот. По ру\u0301чекот мо\u0301же да се вра\u0301тиме на пло\u0301штадот Македо\u0301ниjа и да се
              проше\u0301таме да Ста\u0301рата желе\u0301зничка ста\u0301ница. Знам де\u0301ка е спо\u0301меник на стра\u0301шниот
              зе\u0301мjотрес во Ско\u0301пjе во 1963 го\u0301дина.`,
              `А ка\u0301ко ќе о\u0301диме?`,
            ],
            ru: [
              `Завтра можем прийти сюда. Я хочу увидеть, что внутри.`,
              `Если у нас будет время, обязательно её посетим. Давай пойдем дальше.`,
              `Мне нравится план. После обеда мы можем вернутся на площадь Македонии прогуляться до старого железнодорожного вокзала. Я знаю,
              что это памятник ужасному землетрясению в Скопье в 1963 году.`,
              `А как поедем?`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На\u0301таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Изви\u0301ните, да\u0301ли зна\u0301ете што се о\u0301вие згра\u0301ди?`,
              `Ви благо\u0301дарам.`,
              `Ва\u0301жи. А\u0301jде да ви\u0301диме ко\u0301га ра\u0301ботат. Отво\u0301рени се од 10 ча\u0301сот.`,
              `А\u0301мам зна\u0301чи ба\u0301ња, та\u0301ка изгле\u0301даат ту\u0301рските ба\u0301њи од ста\u0301ро вре\u0301ме. 
              Но се\u0301га ту\u0301ка се на\u0301оѓа Национа\u0301лната галере\u0301jа на Македо\u0301ниjа.`,
              `Ле\u0301ле, ко\u0301лку но\u0301ви кафу\u0301лиња и\u0301ма! По\u0301тоа мо\u0301же да се\u0301днеме ту\u0301ка, но пр\u0301во
              са\u0301кам да те про\u0301шетам низ чарши\u0301jата. Се\u0301га ќе о\u0301диме ле\u0301во и ќе сти\u0301гнеме до цр\u0301квата
              Све\u0301ти Спас, по\u0301тоа ќе свр\u0301тиме де\u0301сно и ќе о\u0301диме во Му\u0301рат-паши\u0301ната џа\u0301миjа,
              Чи\u0301фте а\u0301мам, Су\u0301лиан, Му\u0301стафа-паши\u0301ната џа\u0301миjа и, се\u0301како, на Ка\u0301ле. От та\u0301му
              се о\u0301твора мно\u0301гу у\u0301бав по\u0301глед. А по\u0301тоа ќе се\u0301днеме на ру\u0301чек во е\u0301ден у\u0301бав
              ре\u0301сторан со маке\u0301донски специjали\u0301тети во Ка\u0301пан ан од ⅩⅤ век.`,
              `Се\u0301како, догово\u0301рено! А за\u0301дутре, а\u0301ко вре\u0301мето би\u0301де у\u0301баво, ќе о\u0301диме во
              анти\u0301чкиот град Ску\u0301пи, мно\u0301гу бли\u0301зу до Ско\u0301пjе и во ка\u0301њонот Ма\u0301тка коj се на\u0301оѓа на
              17 кило\u0301метри од Ско\u0301пjе.`,
              `Со та\u0301кси.`,
            ],
            ru: [
              `Извените, вы не знаете, что это за здание?`,
              `Спасибо.`,
              `Хорошо. Давай посмотрим когда они работают. Открыты с 10 часов.`,
              `Слово "Амам" значит "баня", так выглядят старинные турецкие бани. Но сейчас тут находится Национальная галерея Македонии.`,
              `Ох, сколько новых кафе! Мы можем потом тут сесть, но сначала я хочу провести тебя по Чаршии. Сейчас мы пойдем налево и дойдем
              до церкви святого Спаса, потом повернем направо и пойдем в мечеть Мурат-паши, баню Чифте, Сулиан, мечеть Мустафы-паши и, конечно
              же, в крепость Кале. От туда открывается очень красивый вид. А потом сядем пообедаем в одном хорошем ресторане в македонскими
              блюдами в Капан-ане ⅩⅤ века.`,
              `Конечно, договорились! А послезавтра, если будет хорошая погода, мы поедем в античный город Скупи, совсем рядом со Скопье, и в 
              каньон Матку, находящийся в 17 километрах от Скопье.`,
              `На такси.`,
            ],
          },
          {
            speaker: {
              id: `description`,
            },
            mkd: [
              `<em>На\u0301таша и И\u0301ван продолжу\u0301ваат пра\u0301во. Помину\u0301ваат по\u0301краj цр\u0301квата Све\u0301ти
              Дими\u0301триjа и застану\u0301ваат пред Да\u0301ут-Паши\u0301ниот а\u0301мам, е\u0301дна у\u0301бава згра\u0301да од ⅩⅤ век.</em>`,
              `<em>На\u0301таша и И\u0301ван премену\u0301ваат пре\u0301ку мо\u0301стот над буле\u0301варот Го\u0301це Де\u0301лчев и
              влегу\u0301ваат во Ста\u0301ра ско\u0301пска ча\u0301ршиjа.</em>`,
            ],
            ru: [
              `<em>Наташа и Иван продолжают идти прямо. Проходят мимо церкви святого Димитрия и останавливаются перед баней Даут-паши,
              красивым зданием ⅩⅤ века.</em>`,
              `<em>Наташа и Иван переходят через мост над бульваром Гоце Делчева и входят в старый торгово-ремесленный район Скопье Чаршию.</em>`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "passerby", language: "ru", replyIndex: 0 },
          { speakerId: "passerby", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },

          { speakerId: "description", language: "ru", replyIndex: 0 },
          { speakerId: "description", language: "mkd", replyIndex: 0 },

          { speakerId: "natasha", language: "ru", replyIndex: 3 },
          { speakerId: "natasha", language: "mkd", replyIndex: 3 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },

          { speakerId: "description", language: "ru", replyIndex: 1 },
          { speakerId: "description", language: "mkd", replyIndex: 1 },

          { speakerId: "natasha", language: "ru", replyIndex: 4 },
          { speakerId: "natasha", language: "mkd", replyIndex: 4 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "natasha", language: "ru", replyIndex: 5 },
          { speakerId: "natasha", language: "mkd", replyIndex: 5 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 6 },
          { speakerId: "natasha", language: "mkd", replyIndex: 6 },
        ],
      },
    },
  ],
};
