import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-4`,
  sections: [
    {
      type: "lecture",
      subtitle: [`ДИАЛОГ`, `<span>ДИЈАЛОГ</span>`],
      content: {
        description: {
          mkd: `По ка\u0301фето со приjате\u0301лите На\u0301таша и И\u0301ван ше\u0301таат. Пр\u0301во о\u0301дат по ке\u0301jот
          по\u0301краj Ва\u0301рдар до Каме\u0301ниот мост. Мо\u0301стот е си\u0301мбол на Ско\u0301пjе. Примину\u0301ваат пре\u0301ку
          не\u0301го и разгледу\u0301ваат на о\u0301колу. На\u0301таша ве\u0301ли де\u0301ка и\u0301ма мно\u0301гу но\u0301ви и\u0301згради.
          Пр\u0301впат ги гле\u0301да.`,
          ru: `После кофе с приятелями Наташа и Иван гуляют. Сначала они идут по набережной вдоль Вардара до Каменного моста. Мост —
          символ Скопье. Они переходят через него и осматриваются вокруг. Наташа говорит, что очень много новых зданий. Она впервые их видит.`,
        },
        dialogue: [
          {
            speaker: {
              id: `passerby`,
              mkd: `Мину\u0301вачот:`,
              ru: `Прохожий:`,
            },
            mkd: [
              `Од левата страна се зградите на Музеjот на македонската борба и Музеjот на холокаустот, а од десната е Археолошкиот музеj на 
              Македониjа.`,
            ],
            ru: [
              `Слева — здания Музея македонской борьбы и Музея холокоста, а справа — Археологический музей Македонии.`,
            ],
          },
          {
            speaker: {
              id: `ivan`,
              mkd: `И\u0301ван:`,
              ru: `И\u0301ван:`,
            },
            mkd: [
              `Утре може да доjдеме тука. Сакам да видам што има внатре.`,
              `Ако имаме време, задолжително ќе jа посетиме. Аjде да одиме понатаму.`,
              `Ми се допаѓа планот. По ручекот може да се вратиме на плоштадот Македониjа и да се прошетаме да Старата железничка станица.
              Знам дека е споменик на страшниот земjотрес во Скопjе во 1963 година.`,
              `А како ќе одиме?`,
            ],
            ru: [
              `Завтра можем прийти сюда. Я хочу увидеть, что внутри.`,
              `Если у нас будет время, обязательно её посетим. Давай пойдем дальше.`,
              `Мне нравится план. После обеда мы можем вернутся на площадь Македонии прогуляться до старого железнодорожного вокзала. Я знаю,
              что это памятник ужасному землетрясению в Скопье в 1963 году.`,
              `А как поедем?`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На\u0301таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Извините, дали знаете што се овие згради?`,
              `Ви благодарам.`,
              `Важи. Аjде да видиме кога работат. Отворени се од 10 часот.`,
              `Амам значи бања, така изгледаат турските бањи од старо време. Но сега тука се наоѓа Националната галереjа на Македониjа.`,
              `Леле, колку нови кафулиња има! Потоа може да седнеме тука, но прво сакам да те прошетам низ чаршиjата. Сега ќе одиме лево
              и ќе стигнеме до црквата Свети Спас, потоа ќе свртиме десно и ќе одиме во Мурат-пашината џамиjа, Чифте амам, Сулиан, Мустафа-пашината
              џамиjа и, секако, на Кале. От таму се отвора многу убав поглед. А потоа ќе седнеме на ручек во еден убав ресторан со македонски
              специjалитети во Капан ан од ⅩⅤ век.`,
              `Секако, договорено! А задутре, ако времето биде убаво, ќе одиме во античкиот град Скупи, многу близу до Скопjе и во кањонот
              Матка коj се наоѓа на 17 километри од Скопjе.`,
              `Со такси.`,
            ],
            ru: [
              `Извените, вы не знаете, что это за здание?`,
              `Спасибо.`,
              `Хорошо. Давай посмотрим когда они работают. Открыты с 10 часов.`,
              `Слово "Амам" значит "баня", так выглядят старинные турецкие бани. Но сейчас тут находится Национальная галерея Македонии.`,
              `Ох, сколько новых кафе! Мы можем потом тут сесть, но сначала я хочу провести тебя по Чаршии. Сейчас мы пойдем налево и дойдем
              до церкви святого Спаса, потом повернем направо и пойдем в мечеть Мурат-паши, баню Чифте, Сулиан, мечеть Мустафы-паши и, конечно
              же, в крепость Кале. От туда открывается очень красивый вид. А потом сядем пообедаем в одном хорошем ресторане в македонскими
              блюдами в Капан-ане ⅩⅤ века.`,
              `Конечно, договорились! А послезавтра, если будет хорошая погода, мы поедем в античный город Скупи, совсем рядом со Скопье, и в 
              каньон Матку, находящийся в 17 километрах от Скопье.`,
              `На такси.`,
            ],
          },
          {
            speaker: {
              id: `description`,
            },
            mkd: [
              `<em>Наташа и Иван продолжуваат право. Поминуваат покраj црквата Свети Димитриjа и застануваат пред Даут-Пашиниот амам,
              една убава зграда од ⅩⅤ век.</em>`,
              `<em>Наташа и Иван пременуваат преку мостот над булеварот Гоце Делчев и влегуваат во Старат скопска чаршиjа.</em>`,
            ],
            ru: [
              `<em>Наташа и Иван продолжают идти прямо. Проходят мимо церкви святого Димитрия и останавливаются перед баней Даут-паши,
              красивым зданием ⅩⅤ века.</em>`,
              `<em>Наташа и Иван переходят через мост над бульваром Гоце Делчева и входят в старый торгово-ремесленный район Скопье Чаршию.</em>`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "passerby", language: "ru", replyIndex: 0 },
          { speakerId: "passerby", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },

          { speakerId: "description", language: "ru", replyIndex: 0 },
          { speakerId: "description", language: "mkd", replyIndex: 0 },

          { speakerId: "natasha", language: "ru", replyIndex: 3 },
          { speakerId: "natasha", language: "mkd", replyIndex: 3 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },

          { speakerId: "description", language: "ru", replyIndex: 1 },
          { speakerId: "description", language: "mkd", replyIndex: 1 },

          { speakerId: "natasha", language: "ru", replyIndex: 4 },
          { speakerId: "natasha", language: "mkd", replyIndex: 4 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "natasha", language: "ru", replyIndex: 5 },
          { speakerId: "natasha", language: "mkd", replyIndex: 5 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 6 },
          { speakerId: "natasha", language: "mkd", replyIndex: 6 },
        ],
      },
    },
  ],
};
