import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-4`,
  sections: [
    {
      type: "lecture",
      subtitle: {
        ru: "ДИАЛОГ",
        mkd: "ДИЈАЛОГ",
      },
      content: {
        description: {
          mkd: `По ка*фето со приjате*лите На*таша и И*ван ше*таат. Пр*во о*дат по ке*jот по*краj Ва*рдар до Каме*ниот мост. Мо*стот е си*мбол
          на Ско*пjе. Примину*ваат пре*ку не*го и разгледу*ваат на о*колу. На*таша ве*ли де*ка и*ма мно*гу но*ви и*згради. Пр*впат ги гле*да.`,
          ru: `После кофе с приятелями Наташа и Иван гуляют. Сначала они идут по набережной вдоль Вардара до Каменного моста. Мост —
          символ Скопье. Они переходят через него и осматриваются вокруг. Наташа говорит, что очень много новых зданий. Она впервые их видит.`,
        },
        dialogue: [
          {
            speaker: {
              id: `passerby`,
              mkd: `Мину*вачот:`,
              ru: `Прохожий:`,
            },
            mkd: [
              `Од ле*вата стра*на се згра*дите на Музе*jот на македо*нската бо*рба и Музе*jот на холока*устот, а од де*сната е Археоло*шкиот
              му*зеj на Македо*ниjа.`,
            ],
            ru: [
              `Слева — здания Музея македонской борьбы и Музея холокоста, а справа — Археологический музей Македонии.`,
            ],
          },
          {
            speaker: {
              id: `ivan`,
              mkd: `И*ван:`,
              ru: `Иван:`,
            },
            mkd: [
              `У*тре мо*же да до*jдеме ту*ка. Са*кам да ви*дам што и*ма вна*тре.`,
              `А*ко и*маме вре*ме, задолжи*телно ќе jа посе*тиме. А*jде да о*диме пона*таму.`,
              `Ми се до*паѓа пла*нот. По ру*чекот мо*же да се вра*тиме на пло*штадот Македо*ниjа и да се
              проше*таме да Ста*рата желе*зничка ста*ница. Знам де*ка е спо*меник на стра*шниот
              зе*мjотрес во Ско*пjе во 1963 го*дина.`,
              `А ка*ко ќе о*диме?`,
            ],
            ru: [
              `Завтра можем прийти сюда. Я хочу увидеть, что внутри.`,
              `Если у нас будет время, обязательно её посетим. Давай пойдем дальше.`,
              `Мне нравится план. После обеда мы можем вернутся на площадь Македонии прогуляться до старого железнодорожного вокзала. Я знаю,
              что это памятник ужасному землетрясению в Скопье в 1963 году.`,
              `А как поедем?`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На*таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Изви*ните, да*ли зна*ете што се о*вие згра*ди?`,
              `Ви благо*дарам.`,
              `Ва*жи. А*jде да ви*диме ко*га ра*ботат. Отво*рени се од 10 ча*сот.`,
              `А*мам зна*чи ба*ња, та*ка изгле*даат ту*рските ба*њи од ста*ро вре*ме. 
              Но се*га ту*ка се на*оѓа Национа*лната галере*jа на Македо*ниjа.`,
              `Ле*ле, ко*лку но*ви кафу*лиња и*ма! По*тоа мо*же да се*днеме ту*ка, но пр*во
              са*кам да те про*шетам низ чарши*jата. Се*га ќе о*диме ле*во и ќе сти*гнеме до цр*квата
              Све*ти Спас, по*тоа ќе свр*тиме де*сно и ќе о*диме во Му*рат-паши*ната џа*миjа,
              Чи*фте а*мам, Су*лиан, Му*стафа-паши*ната џа*миjа и, се*како, на Ка*ле. О*ттаму
              се о*твора мно*гу у*бав по*глед. А по*тоа ќе се*днеме на ру*чек во е*ден у*бав
              ре*сторан со маке*донски специjали*тети во Ка*пан ан од ⅩⅤ век.`,
              `Се*како, догово*рено! А за*дутре, а*ко вре*мето би*де у*баво, ќе о*диме во
              анти*чкиот град Ску*пи, мно*гу бли*зу до Ско*пjе и во ка*њонот Ма*тка коj се на*оѓа на
              17 кило*метри од Ско*пjе.`,
              `Со та*кси.`,
            ],
            ru: [
              `Извените, вы не знаете, что это за здание?`,
              `Спасибо.`,
              `Хорошо. Давай посмотрим когда они работают. Открыты с 10 часов.`,
              `Слово "Амам" значит "баня", так выглядят старинные турецкие бани. Но сейчас тут находится Национальная галерея Македонии.`,
              `Ох, сколько новых кафе! Мы можем потом тут сесть, но сначала я хочу провести тебя по Чаршии. Сейчас мы пойдем налево и дойдем
              до церкви святого Спаса, потом повернем направо и пойдем в мечеть Мурат-паши, баню Чифте, Сулиан, мечеть Мустафы-паши и, конечно
              же, в крепость Кале. От туда открывается очень красивый вид. А потом сядем пообедаем в одном хорошем ресторане в македонскими
              блюдами в Капан-ане ⅩⅤ века.`,
              `Конечно, договорились! А послезавтра, если будет хорошая погода, мы поедем в античный город Скупи, совсем рядом со Скопье, и в 
              каньон Матку, находящийся в 17 километрах от Скопье.`,
              `На такси.`,
            ],
          },
          {
            speaker: {
              id: `description`,
            },
            mkd: [
              `<em>На*таша и И*ван продолжу*ваат пра*во. Помину*ваат по*краj цр*квата Све*ти
              Дими*триjа и застану*ваат пред Да*ут-Паши*ниот а*мам, е*дна у*бава згра*да од ⅩⅤ век.</em>`,
              `<em>На*таша и И*ван премену*ваат пре*ку мо*стот над буле*варот Го*це Де*лчев и
              влегу*ваат во Ста*ра ско*пска ча*ршиjа.</em>`,
            ],
            ru: [
              `<em>Наташа и Иван продолжают идти прямо. Проходят мимо церкви святого Димитрия и останавливаются перед баней Даут-паши,
              красивым зданием ⅩⅤ века.</em>`,
              `<em>Наташа и Иван переходят через мост над бульваром Гоце Делчева и входят в старый торгово-ремесленный район Скопье Чаршию.</em>`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "passerby", language: "ru", replyIndex: 0 },
          { speakerId: "passerby", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },

          { speakerId: "description", language: "ru", replyIndex: 0 },
          { speakerId: "description", language: "mkd", replyIndex: 0 },

          { speakerId: "natasha", language: "ru", replyIndex: 3 },
          { speakerId: "natasha", language: "mkd", replyIndex: 3 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },

          { speakerId: "description", language: "ru", replyIndex: 1 },
          { speakerId: "description", language: "mkd", replyIndex: 1 },

          { speakerId: "natasha", language: "ru", replyIndex: 4 },
          { speakerId: "natasha", language: "mkd", replyIndex: 4 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "natasha", language: "ru", replyIndex: 5 },
          { speakerId: "natasha", language: "mkd", replyIndex: 5 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 6 },
          { speakerId: "natasha", language: "mkd", replyIndex: 6 },
        ],
      },
    },
  ],
};
