import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-7",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>му</span>, <span>ѝ</span>, <span>им</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. Ко*му ___ се jа*вуваш?`,
            answer: [`му`],
          },
          {
            mkd: `2. Сакаме да ___ се заблагода*риме на на*шите коле*ги.`,
            answer: [`им`],
          },
          {
            mkd: `3. О*вие кни*ги тре*ба да ___ ги вра*тиш на Зо*ра.`,
            answer: [`ѝ`],
          },
          {
            mkd: `4. На Жа*ре ___ се спи*е.`,
            answer: [`му`],
          },
          {
            mkd: `5. Не са*кам да ___ по*магам на Го*це и на Са*шка.`,
            answer: [`им`],
          },
          {
            mkd: `6. Да*ли на де*до ви ___ се до*паѓа во Ско*пjе.`,
            answer: [`му`],
          },
          {
            mkd: `7. Тре*ба да ___ се jа*вам на е*дна дру*гарка.`,
            answer: [`ѝ`],
          },
          {
            mkd: `8. Што мо*жете да ___ препора*чате на стра*нците во Македо*ниjа?`,
            answer: [`им`],
          },
          {
            mkd: `9. На о*ва де*те мно*гу ___ му се jа*де.`,
            answer: [`му`],
          },
          {
            mkd: `10. Са*кам да ___ го про*читам о*ва пи*смо на се*стра ти.`,
            answer: [`ѝ`],
          },
          {
            mkd: `11. На ко*го са*каш да ___ го да*деш о*воj по*дарок?`,
            answer: [`му`],
          },
          {
            mkd: `12. На Би*серка не ___ се ра*боти.`,
            answer: [`ѝ`],
          },
        ],
      },
    },
  ],
};
