import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-7",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте глаголы в скобках в форму имперфекта. Переведите со словарём. Трансформируйте текст используя местоимения <span>jас</span>,
        <span>ние</span>, <span>тие</span>.
        
        (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span>"Же*на ми", "Jас", "Ние", "Тие"</span>. В центре
        показано текущее местоимение.)`,
      ],
      answerSet: {
        labels: ["Же*на ми", "Jас", "Ние", "Тие"],
      },
      content: {
        sentences: [
          {
            mkd: `Же*на ми цел ден ___ (го*тви).`,
            answer: [`готвеше/готвев/готвевме/готвеа`],
          },
          {
            mkd: `Пр*во ___ (пра*ви) по*лнети пи*перки со ме*лено сви*нско ме*со и по*сни са*рми со о*риз.`,
            answer: [`правеше/правев/правевме/правеа`],
          },
          {
            mkd: `По*тоа ___ (пе*че) ко*мпири, пи*ти со спа*наќ, ___ (се*че) до*мати, краста*вици и кро*мид за шо*пска салата и ___ 
            (ре*нда) си*рење.`,
            answer: [
              `перчеше/печев/печевме/печеа`,
              `сечеше/сечев/сечевме/сечеа`,
              `рендаше/рендав/рендавме/рендаа`,
            ],
          },
          {
            mkd: ` ___ (про*бува) и ___ (до*дава) сол, би*бер, зе*jтин и ма*лку о*цет.`,
            answer: [
              `Пробуваше/Пробував/Пробувавме/Пробуваа`,
              `додаваше/додавав/додававме/додаваа`,
            ],
          },
        ],
      },
    },
  ],
};
