import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-7",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте существительные: 
        
        а) в определённую форму, используя артикль с согласным <span>-т-</span>;
        
        б) в неопределённую форму множественного числа;
        
        в) в определённую форму множественного числа с артиклем <span>-т-</span>.
        
        (Подсказка: используйте кнопки ниже, чтобы переключать режимы выполнения задания а), б), в). В центре показано текущий режим.)`,
      ],
      answerSet: {
        labels: ["а)", "б)", "в)"],
      },
      content: {
        sentences: [
          {
            mkd: `зае*дничко ве*це ___ ,`,
            answer: [`заедничкото веце/заеднички вециња/заедничките вециња`],
          },
          {
            mkd: `по*себен го*стин ___ ,`,
            answer: [`посебниот гостин/посебни гости/посебните гости`],
          },
          {
            mkd: `дво*катна ку*ќа ___ ,`,
            answer: [`двокатната куќа/двокатни куќи/двокатните куќи`],
          },
          {
            mkd: `ска*па ле*жалка ___ ,`,
            answer: [`скапата лежалка/скапи лежалки/скапите лежалки`],
          },
          {
            mkd: `на*реден о*брок ___ ,`,
            answer: [`наредниот оброк/наредни оброци/наредните оброци`],
          },
          {
            mkd: `ма*ло пре*тсобjе ___ ,`,
            answer: [`малото претсобjе/мали претсобjа/малите претсобjа`],
          },
          {
            mkd: `дво*собен стан ___ ,`,
            answer: [`двособниот стан/двособни станови/двособните станови`],
          },
          {
            mkd: `е*втин фрижиде*р ___ ,`,
            answer: [`евтиниот фрижидер/евтини фрижидери/евтините фрижидери`],
          },
        ],
      },
    },
  ],
};
