import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-7",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Кому ты помагаешь? — Я помагаю маме. 2. Когда я был маленьким, я часто помагал маме. — Кому ты помагал? — Маме.
        3. Завтра я буду помагать маме весь день. 4. Я не буду помагать маме. 5. Если ты помагаешь маме, ты хороший человек. 6. Если ты
        будешь помагать нашей маме, я буду помагать тебе. 7. Я помогу маме завтра. 8. Я должен помочь маме. 9. Я хочу помочь маме. — Кому
        ты хочешь помочь? — Маме. 10. Я хочу, чтобы ты помог нашей маме. 11. Кому вы звоните? — Мы звоним Бояну и Зорице. 12. Вчера мы
        весь день звонили Бояну и Зорице. — Кому вы звонили? — Бояну и Зорице. 13. Затра мы весь день будем звонить Бояну и Зорице. 14. Мы
        не будем звонить Бояну и Зорице. 15. Почему вы думаете, что мы не позвоним Бояну и Зорице? 16. Почему вы думаете, что мы позвоним
        Бояну и Зорице? 17. Мы должны позвонить Бояну и Зорице. 18. Мы хотим позвонить Бояну и Зорице. — Кому вы хотите позвонить? — Бояну
        и Зорице. 19. Мы хотим, чтобы Деян позвонил Бояну и Зорице. 20. Ирена часто читает книги своему брату. — Кому она читает книги? —
        Брату. 21. Раньше Ирена часто читала книги своему брату. — Кому она читала? — Брату. 22. Завтра Ирена весь день будет читать книги
        своему брату. 23. Завтра Ирена не будет читать книги своему брату. 24. Ирена должна читать книги своему брату. 25. Ирена любит
        читать книги своему брату. 26. Ирена хочет, чтобы и мы читали книги её брату. 27. Ирене хочется спать. 28. Мне хочется спать. 29.
        Мальчику хочется спать. 30. Нам хочется есть и пить.`,
        answer: [
          `1. На **кого / кому** му помагаш? — Ѝ помагам на маjка ми. 2. Кога бев мал, често ѝ помагав на маjка ми. — На **кого / кому**
          му помагаше? — На маjка ми. 3. Утре ќе ѝ помагам на маjка ми цел ден. 4. Нема да ѝ помагам на маjка ми. 5. Ако ѝ помагаш на
          маjка ти, си добар човек. 6. Ако ѝ помагаш на маjка ни, jас ќе ти помагам тебе. 7. Ќе ѝ помагам на маjка ми утре. 8. Треба да ѝ
          помагнам на маjка ми. 9. Сакам да ѝ помагам на маjка ми. — На **кого / кому** сакаш да му помогнеш? — На маjка ми. 10. Сакам да
          ѝ помогнеш на маjка ни. 11. На **кого / кому** му се jавувате? — Им се jавуваме на Боjан и (на) Зорица. 12. Вчера цел ден им се
          jавувавме на Боjан и (на) Зорица. — На **кого / кому** му се jавувавте? — На Боjан и (на) Зорица. 13. Утре цел ден ќе им се
          jавуваме на Боjан и (на) Зорица. 14. Нема да им се jавуваме на Боjан и (на) Зорица. 15. Зошто мислите дека нема да им се jавиме
          на Боjан и (на) Зорица? 16. Зошто мислите дека ќе им се jавиме на Боjан и (на) Зорица? 17. Треба им се jавиме на Боjан и (на)
          Зорица. 18. Сакаме да им се jавиме на Боjан и (на) Зорица. — На **кого / кому** сакате да му се jавите? — На Боjан и (на)
          Зорица. 19. Сакаме Деjан да им се jави на Боjан и (на) Зорица. 20. Ирена често му чита книги на брат ѝ. — На **кого / кому** му
          чита книги? — На брат ѝ. 21. Порано Ирена често му читаше книги на брат ѝ. — На **кого / кому** му читаше? — На брат ѝ. 22.
          Утре Ирена цел ден ќе му чита кники на брат ѝ. 23. Утре Ирена нема да му чита книги на брат ѝ. 24. Ирена треба да му чита на
          брат ѝ. 25. Ирена сака да му чита книги на брат ѝ. 26. Ирена сака да му читаме книги на брат ѝ. 27. На Ирена ѝ се спие. 28. Ми
          се спие. 29. На детето му се спие. 30. Ни се јаде и ни се пие.`,
        ],
      },
    },
  ],
};
