import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-7",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения, следуя образцу.`],

      content: {
        text: "<span>Тре*ба да одгово*рите бр*зо. — Тре*ба да одгово*рите ко*лку што е мо*жно по*брзо.</span>",
        sentences: [
          {
            mkd: `1. Са*кам да ку*пам стан е*втино. — ___.`,
            answer: [`Сакам да купам стан колку што е можно поевтино`],
          },
          {
            mkd: `2. Са*кам друга*рите да жи*веат бли*зку до ме*не. — ___.`,
            answer: [
              `Сакам другарите да живеат колку што е можно поблиску до мене`,
            ],
          },
          {
            mkd: `3. Тре*ба да преве*дуваш до*бро. — ___.`,
            answer: [`Треба да преведуваш колку што е можно подобро`],
          },
          {
            mkd: `4. Са*каме да пату*вате бе*збедно. — ___.`,
            answer: [`Сакаме да патувате колку што е можно побезбедно`],
          },
          {
            mkd: `5. Во о*ваа со*ба тре*ба да би*де ла*дно. — ___.`,
            answer: [`Во оваа соба треба да биде колку што е можно поладно`],
          },
          {
            mkd: `6. Са*кам на*двор да би*де то*пло. — ___.`,
            answer: [`Сакам надвор да биде колку што е можно потопло`],
          },
          {
            mkd: `7. Тре*ба да тро*шат ма*лку па*ри. — ___.`,
            answer: [`Треба да трошат колку што е можно помалку пари`],
          },
        ],
      },
    },
  ],
};
