import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-7",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, используя указанные слова и частицы <span>му</span>, <span>ѝ</span>, <span>им</span>.
        
        (Обратите внимание: некоторые пледложения могут иметь более одного правильного ответа.)`,
      ],

      content: {
        text: "<span>И*вана, чи*та, е*дна, кни*га, Де*jан. — И*вана му чи*та е*дна кни*га на Де*jан.</span>",
        sentences: [
          {
            mkd: `1. Jас, чи*та, е*дна, кни*га, И*вана. — ___.`,
            answer: [`Jас ѝ читам една книга на Ивана`],
          },
          {
            mkd: `2. Ти*е, раска*жува, на*шите го*сти, за О*хрид. — ___.`,
            answer: [`Тие им раскажуваат на нашите гости за Охрид`],
          },
          {
            mkd: `3. Ма*риjа, се до*паѓа, Зо*ран и Љу*бе. — ___.`,
            answer: [
              `На Марија ѝ се допаѓаат Зоран и Љубе / Марија им се допаѓа Зоран и (на) Љубе`,
            ],
          },
          {
            mkd: `4. Зо*ран и Љу*бе, се до*паѓа, Ма*риjа. — ___.`,
            answer: [
              `На Зоран и (на) Љубе им се допаѓа Марија / Зоран и Љубе ѝ се допаѓаат на Марија`,
            ],
          },
          {
            mkd: `5. Де*тето, благо*дари, та*тко му. — ___.`,
            answer: [`Детето му благодари на татко му`],
          },
          {
            mkd: `6. Ни*е, ни*што, не забра*нува, де*цата. — ___.`,
            answer: [`Ние ништо не им забрануваме на децата`],
          },
          {
            mkd: `7. Ти, че*сто, пи*шува, ме*jлови, тво*jата профе*сорка. — ___.`,
            answer: [`Ти често ѝ пишуваш меjлови на твоjата професорка`],
          },
          {
            mkd: `8. Jас, поне*когаш, по*мага, е*ден коле*га, со пре*води. — ___.`,
            answer: [`Jас понекогаш му помагам на еден колега со преводи`],
          },
          {
            mkd: `9. Зо*што, ви*е, ни*што. не, пока*жува, брат ми? — ___.`,
            answer: [`Зошто вие ништо не му покажувате на брат ми?`],
          },
        ],
      },
    },
  ],
};
