import { TablesProps } from "@/types";

export const example1: TablesProps = {
  slug: "lesson-9",
  type: "example-1",
  subtitle:
    "СОЮЗЫ <span>КАДЕ ШТО, КАКО ШТО, КОЛКУ ШТО, КАКОВ ШТО, КОЛКАВ ШТО</span>",
  content: {
    text: `Союзы <span>ка*де што</span>, <span>ка*ко што</span>, <span>ко*лку што</span>, <span>ка*ков што</span> и <span>ко*лкав што</span>
    пишутся раздельно.`,
    words: [
      {
        mkd: "О*ва е ме*сто ка*де што жи*веам.",
        ru: "Это место, где они живут.",
      },
      {
        mkd: "Ра*ботам та*ка ка*ко што мо*жам.",
        ru: "Я работаю так, как могу.",
      },
      {
        mkd: "Ко*лку што знам жи*веам ту*ка.",
        ru: "Насколько я знаю, они живут здесь.",
      },
      {
        mkd: "И*маат пла*та ка*ква што заслужу*ваат.",
        ru: "У них зароботная плата, какую они заслуживают.",
      },
      {
        mkd: "До*лгот е ист ко*лкав што бе*ше.",
        ru: "Долг такой же, каким был.",
      },
    ],
  },
};
