import { TablesProps } from "@/types";

export const oSubtype1: TablesProps = {
  type: `o-subtype-1`,
  slug: "lesson-10",
  subtitle: `2. О-подтип`,
  text: `В глаголах, оканчивающихся на <span>-се</span>, <span>-де</span>, происходит чередование гласной <span>е</span> на <span>о</span>
  в форме мн.ч. и 1 л. ед.ч. Сюда же относится глагол <span>зе*ме</span> «взять», у которого меняется основа.`,
  content: {
    subtitle: [" ", "о*днесе", "до*jде", "зе*ме"],
    rows: [
      {
        person: "јас",
        forms: ["о*днесо-в", "до*jдо-в", "зе*до-в"],
      },
      {
        person: "ти",
        forms: ["о*днесе", "до*jде", "зе*де"],
      },
      {
        person: "тој, та*а, то*а",
        forms: ["о*днесе", "до*jде", "зе*де"],
      },
      {
        person: "ни*е",
        forms: ["одне*со-вме", "до*jдо-вме", "зе*до-вме"],
      },
      {
        person: "ви*е",
        forms: ["одне*со-вте", "до*jдо-вте", "зе*до-вте"],
      },
      {
        person: "ти*е",
        forms: ["одне*со-а", "до*jдо-а", "зе*до-а"],
      },
    ],
  },
};
