import { TablesProps } from "@/types";

export const clothingAccessories: TablesProps = {
  slug: "lesson-9",
  type: "clothing-accessories",
  title: {
    ru: `ОДЕЖДА И АКСЕССУАРЫ`,
    mkd: `<span>ОБЛЕКА И АКСЕСОАРИ</span>`,
  },
  content: {
    subtitle: [`Македонский язык`, `Русский язык`],
    words: [
      {
        mkd: "а*ктовка",
        ru: "портфель",
      },
      {
        mkd: "апосто*лки",
        ru: "шлёпанцы",
      },
      {
        mkd: "блу*за",
        ru: "блузка",
      },
      {
        mkd: "виоле*тов",
        ru: "фиолетовый",
      },
      {
        mkd: "во*лнен",
        ru: "шерстяной",
      },
      {
        mkd: "врато*врска",
        ru: "галстук",
      },
      {
        mkd: "га*ќи",
        ru: "трусы",
      },
      {
        mkd: "гра*дник",
        ru: "бюстгальтер",
      },
      {
        mkd: "долг",
        ru: "длинный, долгий",
      },
      {
        mkd: "дрес",
        ru: "спортивный костюм",
      },
      {
        mkd: "ѓе*рдан",
        ru: "ожерелье",
      },
      {
        mkd: "е*лек",
        ru: "жилет",
      },
      {
        mkd: "здо*лниште",
        ru: "юбка",
      },
      {
        mkd: "ја*кна",
        ru: "куртка",
      },
      {
        mkd: "ка*иш",
        ru: "ремень",
      },
      {
        mkd: "ка*па",
        ru: "шапка",
      },
      {
        mkd: "ка*пут",
        ru: "длинное пальто",
      },
      {
        mkd: "кафе*ав",
        ru: "коричневый",
      },
      {
        mkd: "ко*жен",
        ru: "кожаный",
      },
      {
        mkd: "ко*стим",
        ru: "костюм",
      },
      {
        mkd: "ко*стим за пли*вање",
        ru: "купальник",
      },
      {
        mkd: "ку*с",
        ru: "короткий (об одежде)",
      },
      {
        mkd: "ма*ица",
        ru: "майка, футболка",
      },
      {
        mkd: "ма*нтил",
        ru: "плащ",
      },
      {
        mkd: "ма*рама",
        ru: "платок",
      },
      {
        mkd: "о*беткa",
        ru: "серёжка",
      },
      {
        mkd: "па*лто",
        ru: "короткое пальто",
      },
      {
        mkd: "па*мучен",
        ru: "хлопчатобумажный",
      },
      {
        mkd: "пантало*ни",
        ru: "брюки",
      },
      {
        mkd: "па*пучи",
        ru: "тапочки",
      },
      {
        mkd: "па*ричник",
        ru: "бумажник",
      },
      {
        mkd: "па*тики",
        ru: "кроссовки",
      },
      {
        mkd: "по*рта*калов",
        ru: "оранжевый",
      },
      {
        mkd: "п*рстен",
        ru: "кольцо",
      },
      {
        mkd: "рака*вици",
        ru: "рукавицы",
      },
      {
        mkd: "ра*нец",
        ru: "рюкзак",
      },
      {
        mkd: "ро*зов",
        ru: "розовый",
      },
      {
        mkd: "ро*лка",
        ru: "водолазка",
      },
      {
        mkd: "са*ко",
        ru: "пиджак",
      },
      {
        mkd: "са*ндали",
        ru: "сандалии",
      },
      {
        mkd: "све*тол",
        ru: "светлый",
      },
      {
        mkd: "си*в",
        ru: "серый",
      },
      {
        mkd: "сви*лен",
        ru: "шёлковый",
      },
      {
        mkd: "те*тет",
        ru: "тёмно-синий (об одежде)",
      },
      {
        mkd: "те*мен",
        ru: "тёмный",
      },
      {
        mkd: "те*сен",
        ru: "узкий, тесный",
      },
      {
        mkd: "то*рба",
        ru: "большая сумка",
      },
      {
        mkd: "фа*рмерки",
        ru: "джинсы",
      },
      {
        mkd: "фу*стан",
        ru: "платье",
      },
      {
        mkd: "хулахо*пки",
        ru: "колготки",
      },
      {
        mkd: "ча*дор",
        ru: "зонт",
      },
      {
        mkd: "ча*нта",
        ru: "сумка",
      },
      {
        mkd: "ча*совник",
        ru: "часы",
      },
      {
        mkd: "че*вли",
        ru: "туфли",
      },
      {
        mkd: "чи*зми",
        ru: "сапоги",
      },
      {
        mkd: "чо*рап",
        ru: "носок",
      },
      {
        mkd: "шал",
        ru: "шарф",
      },
      {
        mkd: "ши*рок",
        ru: "широкий",
      },
      {
        mkd: "шо*рцеви",
        ru: "шорты",
      },
    ],
  },
};
