import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-12",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения в перфект.`],
      content: {
        text: "<span>Ни*е го резерви*равме хо*телот. — Ни*е сме го резерви*рале хо*телот</span>",

        sentences: [
          {
            mkd: `1. Не бев на ки*но ___.`,
            answer: [`Не сум бил на кино`],
          },
          {
            mkd: `2. Е*ва не го про*ба фу*станот ___.`,
            answer: [`Ева не го пробала фустанот`],
          },
          {
            mkd: `3. Да*ли му се jа*вивте на Де*jан ___?`,
            answer: [`Дали сте му се jавиле на Деjан`],
          },
          {
            mkd: `4. Зо*што де*цата не нау*чиjа ни*што ___?`,
            answer: [`Зошто децата не научиле ништо`],
          },
          {
            mkd: `5. Да*ли ти се ми*еше ___?`,
            answer: [`Дали ми си се **миел / миела**`],
          },
          {
            mkd: `6. Студе*нтите ги вра*тиjа кни*гите во библиоте*ката ___.`,
            answer: [`Студентите ги вратиле книгите во библиотеката`],
          },
          {
            mkd: `7. Ни*е го одне*совме О*ливер на ки*но ___.`,
            answer: [`Ние сме го однеле Оливер на кино`],
          },
          {
            mkd: `8. Ма*ртин ги и*зеде си*те бонбо*ни ___.`,
            answer: [`Мартин ги изел сите бонбони`],
          },
          {
            mkd: `9. Мо*jот внук за*мина за Австра*лиjа ___.`,
            answer: [`Моjот внук заминал за Австралиjа`],
          },
          {
            mkd: `10. Ма*jа, да*ли му го по*кажа про*ектот на профе*сорот ___?`,
            answer: [`Маjа, дали си му го покажала проектот на професорот`],
          },
          {
            mkd: `11. Jас не им се jа*вував на тво*ите ку*мови ___.`,
            answer: [
              `Jас не сум им се **jавувал / jавувала** на твоите кумови`,
            ],
          },
          {
            mkd: `12. Бе*ти ку*пи у*бава сви*лена ко*шула за зет ѝ ___.`,
            answer: [`Бети купила убава свилена кошула за зет ѝ`],
          },
          {
            mkd: `13. Да*ли jа запо*знавте мо*jата сна*а ___?`,
            answer: [`Дали сте jа запознале моjата снаа`],
          },
          {
            mkd: `14. Не на*jдовме ни*што инте*ресно во о*вие прода*вници ___.`,
            answer: [`Не сме нашле ништо интересно во овие продавници`],
          },
          {
            mkd: `15. Во ти*е зе*мjи не*маше та*кви згра*ди ___.`,
            answer: [`Во тие земjи немало такви згради`],
          },
        ],
      },
    },
  ],
};
