import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-12",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте данные причастия в нужные места:
        
        <span>**забра*нето, ски*нато, до*jден, непи*шано, испла*шено, jа*ден, и*злезен, раси*пани,
        пе*чени, обле*чена, напи*шана**</span>`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. И*спитот не по*чнува. Профе*сорот у*ште не е ___.`,
            answer: [`доjден`],
          },
          {
            mkd: `2. Сè у*ште jа пи*шувам кни*гата? — Ве*ќе е ___`,
            answer: [`напишана`],
          },
          {
            mkd: `3. Ги фр*лив си*те ___ до*мати.`,
            answer: [`расипани`],
          },
          {
            mkd: `4. Ту*ка ни*коj не пу*ши. Пуше*њето е ___.`,
            answer: [`забрането`],
          },
          {
            mkd: `5. Ми се jа*де ___ ко*мпири.`,
            answer: [`печени`],
          },
          {
            mkd: `6. Да*ли jа зна*еш о*ваа у*баво ___ де*војка?`,
            answer: [`облечена`],
          },
          {
            mkd: `7. Дире*кторот не е ту*ка. ___ е.`,
            answer: [`Излезен`],
          },
          {
            mkd: `8. И*ван, jа*де ли? — Не, у*ште не сум ___.`,
            answer: [`jаден`],
          },
          {
            mkd: `9. Дево*jчето е ___ за*тоа пла*че.`,
            answer: [`исплашено`],
          },
          {
            mkd: `10. Тре*ба да го сме*ниш о*ва ___ ко*пче.`,
            answer: [`скинато`],
          },
        ],
      },
    },
  ],
};
