import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-12",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Составьтете предложения из данных слов, образуя причастия от выделенных глаголов.`,
      ],

      content: {
        text: "<span>Кни*га, <em>вра*ти</em>, во библиоте*ка. — Кни*гата е вра*тена во библиоте*ка.</span>",
        sentences: [
          {
            mkd: `1) О*дговор, ве*ќе, <em>до*бие</em> — ___.`,
            answer: [`Одговорот е веќе добиен`],
          },
          {
            mkd: `2) Си*те, па*ри, <em>по*троши</em> — ___.`,
            answer: [`Сите пари се потрошени`],
          },
          {
            mkd: `3) Jас, <em>ро*ди</em>, на*пролет — ___.`,
            answer: [`Jас сум роден напролет`],
          },
          {
            mkd: `4) Ка*де, моj, <em>на*рача</em>, ка*фе — ___(?)`,
            answer: [`Каде е моето нарачано кафе`],
          },
          {
            mkd: `5) Зо*што, ку*фер, не, <em>спа*кува</em> — ___(?)`,
            answer: [`Зошто куферот не е спакуван`],
          },
          {
            mkd: `6) <em>Скр*ши</em>, ра*ка, бо*ли, ма*jка ми — ___.`,
            answer: [`Скршената рака jа боли маjка ми`],
          },
          {
            mkd: `7) Ко*ла, <em>ра*сипе</em> — ___.`,
            answer: [`Колата е расипана`],
          },
          {
            mkd: `8) Ни*е, це*ни, вре*ме, <em>по*мине</em>, со, ви*е — ___.`,
            answer: [`Ние го цениме времето поминато со вас`],
          },
          {
            mkd: `9) <em>О*здрави</em>, де*те, се сме*е — ___.`,
            answer: [`Оздравеното дете се смее`],
          },
          {
            mkd: `10) Хо*тел, ве*ќе, <em>резерви*ра</em> — ___.`,
            answer: [`Хотелот е веќе резервиран`],
          },
        ],
      },
    },
  ],
};
