import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-12",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык, используя перфект.`],
      content: {
        original: `1. Вы когда-нибудь встречали этого человека? 2. Я никогда не влюблялся с первого взгляда. 3. Мы написали два письма.
        4. Симон не узнал Елену. 5. Мы давно не виделись. 6. Все уехали. 7. Никто не спрашивал этого человека о его семье. 8. В этой
        библиотеке никогда не было таких книг. 9. Елена приехала в гости. 10. Ненад и Теа развелись.`,
        answer: [
          `1. Дали некогаш сте го сретнале овој човек? 2. Никогаш не сум се вљубувал на прв поглед. 3. Сме напишале две писма.
        4. Симон не ја препознал Елена. 5. Одамна не сме се виделе. 6. Сите заминале. 7. Никој не го прашал овој човек за неговата
        фамилија. 8. Во оваа библиотека никогаш немало такви книги. 9. Елена дошла на гости. 10. Ненад и Теа се развеле.`,
        ],
      },
    },
  ],
};
