import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-12",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте причастия от данных глаголов, переведите их на русский язык:`,
      ],

      content: {
        sentences: [
          {
            mkd: `ба*кне ___ (переклад) ___,`,
            answer: [`бакнат`, `ударенный`],
          },
          {
            mkd: `вра*ти ___ (переклад) ___,`,
            answer: [`вратен`, `возвращённый`],
          },
          {
            mkd: `до*бие ___ (переклад) ___,`,
            answer: [`добиен`, `добытый`],
          },
          {
            mkd: `дого*вори ___ (переклад) ___,`,
            answer: [`договорен`, `договорённый`],
          },
          {
            mkd: `за*стане ___ (переклад) ___,`,
            answer: [`застанат`, `застигнутый`],
          },
          {
            mkd: `ми*е ___ (переклад) ___,`,
            answer: [`миен`, `мытый`],
          },
          {
            mkd: `по*дели ___ (переклад) ___,`,
            answer: [`поделен`, `разделённый`],
          },
          {
            mkd: `по*дигне ___ (переклад) ___,`,
            answer: [`подигнат`, `поднятый`],
          },
          {
            mkd: `по*каже ___ (переклад) ___,`,
            answer: [`покажан`, `показанный`],
          },
          {
            mkd: `по*троши ___ (переклад) ___,`,
            answer: [`потрошен`, `потраченный`],
          },
          {
            mkd: `про*ба ___ (переклад) ___,`,
            answer: [`пробан`, `испытанный`],
          },
          {
            mkd: `про*должи ___ (переклад) ___,`,
            answer: [`продолжен`, `продолженный`],
          },
          {
            mkd: `ра*збере ___ (переклад) ___,`,
            answer: [`**разбран / разберен**`, `разобранный`],
          },
          {
            mkd: `ро*ди ___ (переклад) ___,`,
            answer: [`роден`, `рождённый`],
          },
          {
            mkd: `свр*ти ___ (переклад) ___,`,
            answer: [`свртен`, `повёрнутый`],
          },
          {
            mkd: `се*дне ___ (переклад) ___,`,
            answer: [`седнат`, `**севший / посаженный**`],
          },
          {
            mkd: `ста*ви ___ (переклад) ___,`,
            answer: [`ставен`, `поставленный`],
          },
          {
            mkd: `ста*не ___ (переклад) ___,`,
            answer: [`станат`, `ставший`],
          },
          {
            mkd: `фа*ти ___ (переклад) ___,`,
            answer: [`фатен`, `схваченный`],
          },
        ],
      },
    },
  ],
};
