import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-12",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Когда Иван и Наташа гуляли по набережной, к ним подошла одна женщина. Это была Елена Ивановска, бывшая соседка Наташи.
        Они не виделись более 10 лет. Сейчас Елена живёт в Австралии. Она вышла замуж за Джона, у которого брала уроки тенниса. Однажды
        Джон пригласил её на свидание, и они начали встречаться. Сейчас Елена в Македонии, потому что она приглашена на свадьбу своего
        двоюродного брата. Друзья встретились с Джоном в кафе-мороженом. Джон узнал, что Наташа и Иван познакомились в Болгарии на
        отдыхе. Иван влюбился с первого взгляда и сразу же сделал Наташе предложение. Наташа не согласилась, потому что ничего не знала
        о нём. Один год они общались по скайпу и социальным сетям, потом Иван приехал в гости в Македонию, затем Наташа — в Россию.
        Наташа узнала, что её брат Ненад был первой любовью Елены. Елена узнала, что Ненад женился десять лет назад, у него родилась
        дочь, но сейчас он развёлся. Дочь осталась жить с бывшей женой, но он часто видится с ней. Дочери вскоре исполнится шесть лет.`,
        answer: [
          `Додека Иван и Наташа шетаа по кеј, им пријде една жена. Тоа беше Елена Ивановска, бившата комшика на Наташа. Не се виделе
        повеќе од десет години. Сега Елена живее во Австралија. Се омажи за Џон кај кого одеше на часови по тенис. Еднаш Џон ја покани
        на состанок и така почнаа да излегуваат. Сега Елена е во Македонија затоа што е поканета на свадбата на нејзиниот (прв)
        братучед. Пријателите се сретнаа со Џон во една слаткарница. Џон дозна дека Наташа и Иван се запознале на одмор во Бугарија.
        Иван се заљуби на прв поглед и веднаш ја побара Наташа за жена. Наташа не се согласи затоа што ништо не знаеше за него. Една
        година комуницираа преку Скајп и социјалните мрежи. Потоа Иван дојде на гости во Македонија, па Наташа во Русија. Наташа дозна
        дека нејзиниот брат Ненад и беше прва љубов на Елена. Елена дозна дека Ненад се оженил пред десет години, му се роди ќерка, но
        сега се разведе. Ќерката остана да живее со бившата жена, но тој често се гледа со неа. Ќерката наскоро ќе наполни шест години.`,
        ],
      },
    },
  ],
};
