import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-12",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Вставьте подходящие по смыслу слова.`],

      content: {
        text: "<span>Та*мара се о*мажи за брат ми. Та*а ми е «сна*а».</span>",
        sentences: [
          {
            mkd: `1) Ни*кола е брат на же*на ми. Тоj ми е ___.`,
            answer: [`шура`],
          },
          {
            mkd: `2) Зла*тко е та*тко на маж ми. Тоj ми е ___.`,
            answer: [`свекор`],
          },
          {
            mkd: `3) Го*ко е брат на ма*jка ми. Тоj ми е ___. Анто*ниjа е же*на му на Го*ко. Та*а ми е ___.`,
            answer: [`вуjко`, `вуjна`],
          },
          {
            mkd: `4) Та*тко ми и ма*jка ми се разве*доа. Та*тко ми се о*жени со И*рена. Тоj ми е ___. Им се ро*ди Е*мил. Тоj ми е ___.`,
            answer: [`маќеа`, `полубрат`],
          },
          {
            mkd: `5) Не*да е се*стра на та*тко ми. Та*а ми е ___.`,
            answer: [`тетка`],
          },
          {
            mkd: `6) Са*шка и Пе*тре се де*ца на брат ми. Ти*е ми се ___.`,
            answer: [`внуци`],
          },
          {
            mkd: `7) Си*мон е маж на ќе*рка ми. Тоj ми е ___. Него*вата ма*jка ми е ___, а него*виот та*тко ми е ___.`,
            answer: [`зет`, `сваќа`, `сват`],
          },
          {
            mkd: `8) Фи*лип го кр*сти син ми. Тоj ми е ___.`,
            answer: [`кум`],
          },
        ],
      },
    },
  ],
};
