import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-3",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "аге\u0301нциjа",
            pron: "агэ\u0301нцийа",
            ru: "агентство",
          },
          {
            mkd: "го\u0301дина",
            pron: "го\u0301дина",
            ru: "год",
          },
          {
            mkd: "го\u0301лем",
            pron: "го\u0301лэм",
            ru: "большой",
          },
          {
            mkd: "де\u0301ка",
            pron: "дэ\u0301ка",
            ru: "что",
          },
          {
            mkd: "се дого\u0301вара",
            pron: "сэ_дого\u0301вара",
            ru: "договариваться",
          },
          {
            mkd: "се дого\u0301вори",
            pron: "сэ_дого\u0301вори",
            ru: "договориться",
          },
          {
            mkd: "се до\u0301паѓа",
            pron: "сэ_до\u0301паг'а",
            ru: "нравиться",
          },
          {
            mkd: "се до\u0301падне",
            pron: "сэ_до\u0301паднэ",
            ru: "понравиться",
          },
          {
            mkd: "дру\u0301гар",
            pron: "дру\u0301гар",
            ru: "друг",
          },
          {
            mkd: "дру\u0301гарка",
            pron: "дру\u0301гарка",
            ru: "подруга",
          },
          {
            mkd: "дру\u0301штво",
            pron: "дру\u0301штво",
            ru: "компания, общество",
          },
          {
            mkd: "се зани\u0301мава",
            pron: "сэ_зани\u0301мава",
            ru: "заниматься",
          },
          {
            mkd: "запо\u0301знава",
            pron: "запо\u0301знава",
            ru: "знакомить",
          },
          {
            mkd: "запо\u0301знае",
            pron: "запо\u0301знаэ",
            ru: "познакомить",
          },
          {
            mkd: "збо\u0301рува",
            pron: "збо\u0301рува",
            ru: "говорить",
          },
          {
            mkd: "зна\u0301е",
            pron: "зна\u0301э",
            ru: "знать; уметь",
          },
          {
            mkd: "и\u0301наку",
            pron: "и\u0301наку",
            ru: "иначе, вообще-то",
          },
          {
            mkd: "се истуши\u0301ра",
            pron: "сэ_истуши\u0301ра",
            ru: "принять душ",
          },
          {
            mkd: "се \u0301јави",
            pron: "сэ_\u0301йави",
            ru: "дать о себе знать; позвонить",
          },
          {
            mkd: "се \u0301јавува",
            pron: "сэ_\u0301йавува",
            ru: "давать о себе знать; звонить",
          },
          {
            mkd: "jа\u0301зик",
            pron: "йа\u0301зик",
            ru: "язык",
          },
          {
            mkd: "ка\u0301фуле",
            pron: "ка\u0301фулэ",
            ru: "кафе",
          },
          {
            mkd: "компа\u0301ниjа",
            pron: "компа\u0301нийа",
            ru: "компания",
          },
          {
            mkd: "ко\u0301мшиjа",
            pron: "ко\u0301мшийа",
            ru: "сосед (по дому)",
          },
          {
            mkd: "ко\u0301мшиjка",
            pron: "ко\u0301мшийка",
            ru: "соседка (по дому)",
          },
          {
            mkd: "ми\u0301сли",
            pron: "ми\u0301сли",
            ru: "думать",
          },
          {
            mkd: "мо\u0301же",
            pron: "мо\u0301жэ",
            ru: "мочь; можно",
          },
          {
            mkd: "нави\u0301стина",
            pron: "нави\u0301стина",
            ru: "на самом деле, правда",
          },
          {
            mkd: "на не\u0301коj на\u0301чин",
            pron: "на_нэ\u0301кой_на\u0301чин",
            ru: "каким-то образом",
          },
          {
            mkd: "на\u0301учи",
            pron: "на\u0301учи",
            ru: "научить; выучить",
          },
          {
            mkd: "на\u0301чин",
            pron: "на\u0301чин",
            ru: "способ",
          },
          {
            mkd: "национа\u0301лност",
            pron: "национа\u0301лност",
            ru: "национальность",
          },
          {
            mkd: "не\u0301коj",
            pron: "нэ\u0301кой",
            ru: "некто, кто-то, кто-нибудь; некий, какой-то, какой-нибудь",
          },
          {
            mkd: "се обле́кува",
            pron: "сэ_облэ\u0301кува",
            ru: "одеваться",
          },
          {
            mkd: "се о\u0301блече",
            pron: "сэ_о\u0301блэчэ",
            ru: "одеться",
          },
          {
            mkd: "образова́ние",
            pron: "образова́ниэ",
            ru: "образование",
          },
          {
            mkd: "о́длично",
            pron: "о́длично",
            ru: "отлично",
          },
          {
            mkd: "о́дмора",
            pron: "о́дмора",
            ru: "отдыхать",
          },
          {
            mkd: "о́дмори",
            pron: "о́дмори",
            ru: "отдохнуть",
          },
          {
            mkd: "плани́ра",
            pron: "плани́ра",
            ru: "планировать, спланировать",
          },
          {
            mkd: "по поте́кло",
            pron: "по_потэ\u0301кло",
            ru: "родом, по происхождению",
          },
          {
            mkd: "по́веќе",
            pron: "по́вэк'э",
            ru: "больше",
          },
          {
            mkd: "по\u0301текло",
            pron: "потэ\u0301кло",
            ru: "происхождение",
          },
          {
            mkd: "пра́ша",
            pron: "пра́ша",
            ru: "спросить",
          },
          {
            mkd: "пра́шува",
            pron: "пра́шува",
            ru: "спрашивать",
          },
          {
            mkd: "професионáлен",
            pron: "профэсионáлэн",
            ru: "профессиональный",
          },
          {
            mkd: "про\u0301шета",
            pron: "про\u0301шэта",
            ru: "прогуляться",
          },
          {
            mkd: "ра́боти",
            pron: "ра́боти",
            ru: "работать",
          },
          {
            mkd: "ра́боти ка́ко ко́ј",
            pron: "ра́боти_ка́ко_ко́й",
            ru: "работать кем",
          },
          {
            mkd: "ра\u0301скаже",
            pron: "ра\u0301скажэ",
            ru: "рассказать",
          },
          {
            mkd: "раска́жува",
            pron: "раска́жува",
            ru: "рассказывать",
          },
          {
            mkd: "са́ка",
            pron: "са́ка",
            ru: "любить; хотеть",
          },
          {
            mkd: "све́т",
            pron: "свэ\u0301т",
            ru: "мир",
          },
          {
            mkd: "се́",
            pron: "сэ",
            ru: "всё",
          },
          {
            mkd: "се́га",
            pron: "сэ\u0301га",
            ru: "сейчас",
          },
          {
            mkd: "се́кој",
            pron: "сэ\u0301кой",
            ru: "каждый, всякий, любой",
          },
          {
            mkd: "си́гурно",
            pron: "си́гурно",
            ru: "наверняка, точно",
          },
          {
            mkd: "се сме\u0301сти",
            pron: "сэ_смэ\u0301сти",
            ru: "разместиться",
          },
          {
            mkd: "се сме́стува",
            pron: "сэ_смэ\u0301стува",
            ru: "размещаться",
          },
          {
            mkd: "сре́ден",
            pron: "срэ\u0301дэн",
            ru: "средний",
          },
          {
            mkd: "се сре́тне",
            pron: "сэ_срэ\u0301тнэ",
            ru: "встретиться",
          },
          {
            mkd: "се сре́тнува",
            pron: "сэ_срэ\u0301тнува",
            ru: "встречаться",
          },
          {
            mkd: "трѐба",
            pron: "трэ\u0301ба",
            ru: "нужно; быть необходимым",
          },
          {
            mkd: "тури́стички",
            pron: "тури́стички",
            ru: "туристический",
          },
          {
            mkd: "се туши́ра",
            pron: "сэ_туши́ра",
            ru: "принимать душ",
          },
          {
            mkd: "у́бав",
            pron: "у́бав",
            ru: "красивый; хороший",
          },
          {
            mkd: "у́чи",
            pron: "у́чи",
            ru: "учить",
          },
          {
            mkd: "учи́лиште",
            pron: "учи́лиште",
            ru: "школа",
          },
          {
            mkd: "фами́лиjа",
            pron: "фами́лийа",
            ru: "семья",
          },
          {
            mkd: "ше́та",
            pron: "шэ\u0301та",
            ru: "гулять",
          },
          {
            mkd: "Што сте по национа́лност?",
            pron: "Што_стэ_по_национа́лност?",
            ru: "Кто вы по национальности?",
          },
          {
            mkd: "Што сте по профе́сиjа?",
            pron: "Што_стэ_по_профэ\u0301сийа?",
            ru: "Кто вы по профессии?",
          },
          {
            mkd: "Што рабо\u0301тите?",
            pron: "Што_рабо\u0301титэ?",
            ru: "Чем вы занимаетесь?",
          },
        ],
      },
    },
  ],
};
