import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-3",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "аге*нциjа",
            pron: "агэ*нцийа",
            ru: "агентство",
          },
          {
            mkd: "го*дина",
            pron: "го*дина",
            ru: "год",
          },
          {
            mkd: "го*лем",
            pron: "го*лэм",
            ru: "большой",
          },
          {
            mkd: "де*ка",
            pron: "дэ*ка",
            ru: "что",
          },
          {
            mkd: "се дого*вара",
            pron: "сэ_дого*вара",
            ru: "договариваться",
          },
          {
            mkd: "се дого*вори",
            pron: "сэ_дого*вори",
            ru: "договориться",
          },
          {
            mkd: "се до*паѓа",
            pron: "сэ_до*паг'а",
            ru: "нравиться",
          },
          {
            mkd: "се до*падне",
            pron: "сэ_до*паднэ",
            ru: "понравиться",
          },
          {
            mkd: "дру*гар",
            pron: "дру*гар",
            ru: "друг",
          },
          {
            mkd: "дру*гарка",
            pron: "дру*гарка",
            ru: "подруга",
          },
          {
            mkd: "дру*штво",
            pron: "дру*штво",
            ru: "компания, общество",
          },
          {
            mkd: "се зани*мава",
            pron: "сэ_зани*мава",
            ru: "заниматься",
          },
          {
            mkd: "запо*знава",
            pron: "запо*знава",
            ru: "знакомить",
          },
          {
            mkd: "запо*знае",
            pron: "запо*знаэ",
            ru: "познакомить",
          },
          {
            mkd: "збо*рува",
            pron: "збо*рува",
            ru: "говорить",
          },
          {
            mkd: "зна*е",
            pron: "зна*э",
            ru: "знать; уметь",
          },
          {
            mkd: "и*наку",
            pron: "и*наку",
            ru: "иначе, вообще-то",
          },
          {
            mkd: "се истуши*ра",
            pron: "сэ_истуши*ра",
            ru: "принять душ",
          },
          {
            mkd: "се *јави",
            pron: "сэ_*йави",
            ru: "дать о себе знать; позвонить",
          },
          {
            mkd: "се *јавува",
            pron: "сэ_*йавува",
            ru: "давать о себе знать; звонить",
          },
          {
            mkd: "jа*зик",
            pron: "йа*зик",
            ru: "язык",
          },
          {
            mkd: "ка*фуле",
            pron: "ка*фулэ",
            ru: "кафе",
          },
          {
            mkd: "компа*ниjа",
            pron: "компа*нийа",
            ru: "компания",
          },
          {
            mkd: "ко*мшиjа",
            pron: "ко*мшийа",
            ru: "сосед (по дому)",
          },
          {
            mkd: "ко*мшиjка",
            pron: "ко*мшийка",
            ru: "соседка (по дому)",
          },
          {
            mkd: "ми*сли",
            pron: "ми*сли",
            ru: "думать",
          },
          {
            mkd: "мо*же",
            pron: "мо*жэ",
            ru: "мочь; можно",
          },
          {
            mkd: "нави*стина",
            pron: "нави*стина",
            ru: "на самом деле, правда",
          },
          {
            mkd: "на не*коj на*чин",
            pron: "на_нэ*кой_на*чин",
            ru: "каким-то образом",
          },
          {
            mkd: "на*учи",
            pron: "на*учи",
            ru: "научить; выучить",
          },
          {
            mkd: "на*чин",
            pron: "на*чин",
            ru: "способ",
          },
          {
            mkd: "национа*лност",
            pron: "национа*лност",
            ru: "национальность",
          },
          {
            mkd: "не*коj",
            pron: "нэ*кой",
            ru: "некто, кто-то, кто-нибудь; некий, какой-то, какой-нибудь",
          },
          {
            mkd: "се обле́кува",
            pron: "сэ_облэ*кува",
            ru: "одеваться",
          },
          {
            mkd: "се о*блече",
            pron: "сэ_о*блэчэ",
            ru: "одеться",
          },
          {
            mkd: "образова́ние",
            pron: "образова́ниэ",
            ru: "образование",
          },
          {
            mkd: "о́длично",
            pron: "о́длично",
            ru: "отлично",
          },
          {
            mkd: "о́дмора",
            pron: "о́дмора",
            ru: "отдыхать",
          },
          {
            mkd: "о́дмори",
            pron: "о́дмори",
            ru: "отдохнуть",
          },
          {
            mkd: "плани́ра",
            pron: "плани́ра",
            ru: "планировать, спланировать",
          },
          {
            mkd: "по поте́кло",
            pron: "по_потэ*кло",
            ru: "родом, по происхождению",
          },
          {
            mkd: "по́веќе",
            pron: "по́вэк'э",
            ru: "больше",
          },
          {
            mkd: "по*текло",
            pron: "потэ*кло",
            ru: "происхождение",
          },
          {
            mkd: "пра́ша",
            pron: "пра́ша",
            ru: "спросить",
          },
          {
            mkd: "пра́шува",
            pron: "пра́шува",
            ru: "спрашивать",
          },
          {
            mkd: "професионáлен",
            pron: "профэсионáлэн",
            ru: "профессиональный",
          },
          {
            mkd: "про*шета",
            pron: "про*шэта",
            ru: "прогуляться",
          },
          {
            mkd: "ра́боти",
            pron: "ра́боти",
            ru: "работать",
          },
          {
            mkd: "ра́боти ка́ко ко́ј",
            pron: "ра́боти_ка́ко_ко́й",
            ru: "работать кем",
          },
          {
            mkd: "ра*скаже",
            pron: "ра*скажэ",
            ru: "рассказать",
          },
          {
            mkd: "раска́жува",
            pron: "раска́жува",
            ru: "рассказывать",
          },
          {
            mkd: "са́ка",
            pron: "са́ка",
            ru: "любить; хотеть",
          },
          {
            mkd: "све́т",
            pron: "свэ*т",
            ru: "мир",
          },
          {
            mkd: "се́",
            pron: "сэ",
            ru: "всё",
          },
          {
            mkd: "се́га",
            pron: "сэ*га",
            ru: "сейчас",
          },
          {
            mkd: "се́кој",
            pron: "сэ*кой",
            ru: "каждый, всякий, любой",
          },
          {
            mkd: "си́гурно",
            pron: "си́гурно",
            ru: "наверняка, точно",
          },
          {
            mkd: "се сме*сти",
            pron: "сэ_смэ*сти",
            ru: "разместиться",
          },
          {
            mkd: "се сме́стува",
            pron: "сэ_смэ*стува",
            ru: "размещаться",
          },
          {
            mkd: "сре́ден",
            pron: "срэ*дэн",
            ru: "средний",
          },
          {
            mkd: "се сре́тне",
            pron: "сэ_срэ*тнэ",
            ru: "встретиться",
          },
          {
            mkd: "се сре́тнува",
            pron: "сэ_срэ*тнува",
            ru: "встречаться",
          },
          {
            mkd: "трѐба",
            pron: "трэ*ба",
            ru: "нужно; быть необходимым",
          },
          {
            mkd: "тури́стички",
            pron: "тури́стички",
            ru: "туристический",
          },
          {
            mkd: "се туши́ра",
            pron: "сэ_туши́ра",
            ru: "принимать душ",
          },
          {
            mkd: "у́бав",
            pron: "у́бав",
            ru: "красивый; хороший",
          },
          {
            mkd: "у́чи",
            pron: "у́чи",
            ru: "учить",
          },
          {
            mkd: "учи́лиште",
            pron: "учи́лиште",
            ru: "школа",
          },
          {
            mkd: "фами́лиjа",
            pron: "фами́лийа",
            ru: "семья",
          },
          {
            mkd: "ше́та",
            pron: "шэ*та",
            ru: "гулять",
          },
          {
            mkd: "Што сте по национа́лност?",
            pron: "Што_стэ_по_национа́лност?",
            ru: "Кто вы по национальности?",
          },
          {
            mkd: "Што сте по профе́сиjа?",
            pron: "Што_стэ_по_профэ*сийа?",
            ru: "Кто вы по профессии?",
          },
          {
            mkd: "Што рабо*тите?",
            pron: "Што_рабо*титэ?",
            ru: "Чем вы занимаетесь?",
          },
        ],
      },
    },
  ],
};
