import { ExercisesProps } from "@/types";

export const exercise10: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 10",
  slug: "lesson-9",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Иван хочет купить свитер, потому что вечером в Охриде свежо. Он входит в один бутик и спрашивает продавщицу, какие 
        свитеры есть. Продавщица ему показывает свитеры и предлагает померять. Ивану нравится тёплый синий свитер. Он его меряет, но
        свитер ему мал. Иван просит продавщицу принести ему свитер на размер больше. Этот ему как раз и он очень идёт, но у него
        оторвалась кнопка. Иван просит сделать скидку, но продавщица приносит другой и рассказывает об акции. Можно купить две вещи и
        получить скидку 10%. Наташа хочет купить солнцезащитные очки, потому что её сломались. Иван хочет заплатить карточкой, но не
        может, потому что аппарат сломался. Он платит наличными.`,
        answer: [
          `Иван сака да купи џемпер затоа што во Охрид е свежо навечер. Влегува во еден бутик и ја прашува продавачката какви џемпери
          имаат. Продавачката му ги покажува џемперите и предлага да ги проба. На Иван му се допаѓа еден син топол џемпер. Го пробува,
          но џемперот му е мал. Иван ја замолува продавачката да му донесе џемпер поголем за еден број. Овој му е таман, но има скинато
          копче. Иван замолува за попуст, но продавачката му донесува друг џемпер и раскажува за акција. Може да се купат две работи и да
          се добие 10% попуст. Наташа сака да купи очила за сонце затоа што нејзините се скршиле. Иван сака да плати со картичка, но не
          може затоа што апаратот се расипа. Плаќа во готово.`,
        ],
      },
    },
  ],
};
