import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, соединив два предложения в одно, исплользуя союзы <span>ко*лкав</span> или <span>ко*лкав што</span>.`,
      ],

      content: {
        text: `<span>Са*ња ме пра*ша. Ко*лкава пла*та и*ма маж ти? — Са*ња ме пра*ша ко*лкава пла*та и*ма маж ми.</span>
              
          <span>Са*ња зе*ма пла*та. То*лкава пла*та и*ма маж ми. — Са*ња зе*ма пла*та ко*лкава што и*ма маж ми.</span>`,
        sentences: [
          {
            mkd: `1. Исе*чи си то*лкаво па*рче. То*лкаво па*рче са*каш. — ___.`,
            answer: [`Исечи си толкаво парче колкаво сакаш`],
          },
          {
            mkd: `2. Ба*бата ме пра*ша. Ко*лкаво па*рче са*каш? — ___.`,
            answer: [`Бабата ме праша колкаво парче сакам`],
          },
          {
            mkd: `3. Приjате*лите jа прашу*ваат Го*рдана. Ко*лкав пр*стен до*би? — ___.`,
            answer: [`Пријателите ја прашуваат Гордана колкав прстен доби`],
          },
          {
            mkd: `4. Го*рдана до*би то*лкав пр*стен. То*лкав пр*стен ни*коj не*ма. — ___.`,
            answer: [`Гордана доби толкав прстен колкав никој нема`],
          },
        ],
      },
    },
  ],
};
