import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте по образцу предложения из данных слов, используя аорист.`,
      ],

      content: {
        text: "<span>Ни*е, вра*ти, па*ри, Го*ран и Зо*ра. — Ни*е им вра*тивме па*рите на Го*ран и Зо*ра.</span>",
        sentences: [
          {
            mkd: `1. Jас, бр*зо, се истуши*ра. — ___.`,
            answer: [`Jас брзо се истуширав`],
          },
          {
            mkd: `2. Го*ран, ни*е, ви*ди. — ___.`,
            answer: [`Горан нè виде`],
          },
          {
            mkd: `3. Ти, слу*чаjно, скр*ши, о*чила? — ___?`,
            answer: [`Ти случаjно ги скрши очилата`],
          },
          {
            mkd: `4. Ви*е, про*должи, пра*во? — ___?`,
            answer: [`Вие продолживте право`],
          },
          {
            mkd: `5. Ни*е, свр*ти, де*сно. — ___.`,
            answer: [`Ние свртивме десно`],
          },
          {
            mkd: `6. Ми*ле, се заблаго*дари, роди*тели. — ___.`,
            answer: [`Миле им се заблагодари на родителите`],
          },
          {
            mkd: `7. Ка*де, ти, ста*ви, ку*фер? — ___?`,
            answer: [`Каде ти го стави куферот`],
          },
          {
            mkd: `8. Дру*гари, по*брза. — ___.`,
            answer: [`Другарите побрзаа`],
          },
          {
            mkd: `9. Jас, вче*ра, се о*мажи. — ___.`,
            answer: [`Jас вчера се омажив`],
          },
          {
            mkd: `10. Ни*е, по*чека, два, час. — ___.`,
            answer: [`Ние почекавме два часа`],
          },
          {
            mkd: `11. Ти, про*ба, ва*ков, фу*стан, во, цр*вена, бо*jа. — ___.`,
            answer: [`Ти проба ваков фустан во црвена боjа`],
          },
        ],
      },
    },
  ],
};
