import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, соединив два предложения в одно, исплользуя союзы <span>ка*ков</span> или <span>ка*ков што</span>.`,
      ],

      content: {
        text: `<span>Са*ња ме пра*шува. Ка*ква то*рта пра*виш? — Са*ња ме пра*шува ка*ква то*рта пра*вам.</span>
              
          <span>Са*ња са*ка да зго*тви та*ква то*рта. Маjка ѝ го*тви та*ква. — Са*ња са*ка да на*прави та*ква то*рта ка*ква што пра*ви
          маjка ѝ.</span>`,
        sentences: [
          {
            mkd: `1. Сто*jан не е та*ков. Та*ков бе*ше по*рано. — ___.`,
            answer: [`Стојан не е таков како што беше порано`],
          },
          {
            mkd: `2. Си*те пра*шуваат. Ка*ков бе*ше Сто*jан по*рано? — ___.`,
            answer: [`Сите ме прашуваат каков беше Стојан порано`],
          },
          {
            mkd: `3. Приjате*лите го прашу*ваат Го*ран. Ка*кви у*слови и*маш на но*вата ра*бота? — ___.`,
            answer: [
              `Пријателите го прашуваат Горан какви услови има на новата работа`,
            ],
          },
          {
            mkd: `4. Ни*коj не*ма та*кви у*слови. Та*кви у*слови и*ма Го*ран на но*вата ра*бота. — ___.`,
            answer: [
              `Никој нема такви услови какви има Горан на новата работа`,
            ],
          },
        ],
      },
    },
  ],
};
