import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, соединив два предложения в одно, исплользуя союзы <span>ко*лку</span> или <span>ко*лку што</span>.`,
      ],

      content: {
        text: `<span>Са*ња ме пра*ша. Ко*лку jа*болка и*маш? — Са*ња ме пра*ша ко*лку jа*болка и*мам.</span>
              
          <span>Са*ња да*де то*лку jа*болка. То*лку ги и*ма. — Са*ња да*де то*лку jа*болка ко*лку што ги и*ма.</span>`,
        sentences: [
          {
            mkd: `1. Ни*коj не*ма то*лку па*ри. То*лку па*ри и*ма Ла*зар. — ___.`,
            answer: [`Никој нема толку пари колку што има Лазар`],
          },
          {
            mkd: `2. Си*те се прашу*ваат. Ко*лку па*ри и*ма Ла*зар? — ___.`,
            answer: [`Сите се прашуваат колку пари има Лазар`],
          },
          {
            mkd: `3. Мо*же да зе*меш то*лку бонбо*ни. То*лку бонбо*ни са*каш. — ___.`,
            answer: [`Може да земеш толку бонбони колку што сакаш`],
          },
          {
            mkd: `4. Де*тето ме пра*ша. Ко*лку бонбо*ни и*мате? — ___.`,
            answer: [`Детето ме праша колку бонбони имаме`],
          },
        ],
      },
    },
  ],
};
