import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-9",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Трпе принял душ и приготовил завтрак. 2. Мы зарегистрировались на рейс. 3. Кого вы спросите? Петре? — Да, его.
        4. Кого ты попросил тебе помочь? Наде? — Да, её. 5. Кому вы позвонили? Петре? — Да, ему. 6. Кому ты вернул те зонты? Наде? — Да,
        ей. 7. Официант разменял нам 500 динар по 100. 8. Друзья потратили все деньги. 9. Я предложил коллегам пойти в кино. 10. Кого ты
        благодаришь? — Я благодарю свою коллегу.`,
        answer: [
          `1. Трпе се истушира и зготви поjадок. 2. Се чекиравме за летот. 3. Кого го прававте? Петре? — Да, него. 4. Кого го замоли да 
          ти помогне? Наде? — Да, неа. 5. На **кого / кому** му се jавивте? на Петре? — Да, на **него / нему**. 6. На **кого / кому** му
          ги вративте оние чадори? На Наде? — Да, на **неа / неjзе**. 7. Келнерот ни раситни 500 денари по 100. 8. Другарите ги потрошиjа
          сите пари. 9. Им предложив на колегите да одиме во кино. 10. На **кого / кому** му благодариш? — Ѝ благодарам на моjата колешка.`,
        ],
      },
    },
  ],
};
