import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, соединив два предложения в одно, исплользуя союзы <span>ка*ко</span> или <span>ка*ко што</span>.`,
      ],

      content: {
        text: `<span>Са*ња ме пра*ша. Ка*ко jа пра*виш то*ртата? — Са*ња ме пра*ша ка*ко jа пра*виш то*ртата.</span>
              
          <span>Са*ња са*ка да на*прави то*рта. Маjка ѝ пра*ви то*рта та*ка. — Са*ња са*ка да на*прави то*рта та*ка ка*ко што пра*ви маjка
          ѝ.</span>`,
        sentences: [
          {
            mkd: `1. Пра*виме та*ка. Та*ка се догово*ривме. — ___.`,
            answer: [`Правиме така како што се договоривме`],
          },
          {
            mkd: `2. Си*те ме прашу*ваат. Ка*ко се догово*ривте? — ___.`,
            answer: [`Сите ме прашуваат како се договоривме`],
          },
          {
            mkd: `3. Бла*же на*прави сè та*ка. Та*ка го у*чеше та*тко му. — ___.`,
            answer: [`Блаже направи сè така како што го учеше татко му`],
          },
          {
            mkd: `4. Ире*на го пра*ша Бла*же. Ка*ко те у*чеше та*тко ти? — ___.`,
            answer: [`Ирена го праша Блаже како го учеше татко ти`],
          },
        ],
      },
    },
  ],
};
