import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, соединив два предложения в одно, исплользуя союзы <span>ка*де</span> или <span>ка*де што</span>.`,
      ],

      content: {
        text: `<span>Са*ња ме пра*ша. Ка*де го ку*пи фу*станот? — Са*ња ме пра*ша ка*де го ку*пив фу*станот.</span>
              
          <span>О*ва е прода*вница. Ту*ка си ку*пив е*ден у*бав фу*стан. — О*ва е прода*вница ка*де што си ку*пив е*ден у*бав фу*стан.</span>`,
        sentences: [
          {
            mkd: `1. Го пра*шаме коле*гата. Ка*де одмо*рате? — ___.`,
            answer: [`Го прашавме колегата каде одмораат`],
          },
          {
            mkd: `2. Са*каме да го ви*диме ме*стото. Та*му че*сто одмо*рате. — ___.`,
            answer: [`Сакаме да го видиме местото каде што често одморате`],
          },
          {
            mkd: `3. Вче*ра бе*вме во е*ден у*бав рестора*н. Та*му ќе пра*виме сва*дба. — ___.`,
            answer: [
              `Вчера бевме во еден убав ресторан каде што ќе правиме свадба`,
            ],
          },
          {
            mkd: `4. Си*те нè прашу*ваат. Ка*де ќе пра*вите сва*дба? — ___.`,
            answer: [`Сите нè прашуваат каде ќе правите свадба`],
          },
        ],
      },
    },
  ],
};
