import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-9",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте глаголы в аорист. Трансформируйте предложения, используя местоимения <span>jас</span>, <span>ни*е</span>, <span>ти*е</span>.
      
          (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span>"тоj", "jас", "ни*е", "ти*е"</span>. В центре
        показано текущее местоимение.)`,
      ],
      answerSet: {
        labels: ["Тоj", "Jас", "Ни*е", "Ти*е"],
        pronounWords: ["слу*шне", "слу*шнам", "слу*шнеме", "слу*шнат"],
      },
      content: {
        sentences: [
          {
            mkd: `1. Ко*му Зла*те му ___ (се заблаго*дари)?`,
            answer: [
              `се заблагодари/се заблагодарив/се заблагодаривме/се заблагодарија`,
            ],
          },
          {
            mkd: `2. Мари*на ___ (о*држи) не*колку сре*дби.`,
            answer: [`одржа/одржав/одржавме/одржаа`],
          },
          {
            mkd: `3. Сло*бодан jа ___ (за*врши) сре*дбата мно*гу бр*зо.`,
            answer: [`заврши/завршив/завршивме/завршиjа`],
          },
          {
            mkd: `4. Еми*лиjа мно*гу ги ___ (заинтереси*ра) коле*гите.`,
            answer: [
              `заинтересира/заинтересирав/заинтересиравме/заинтересираа`,
            ],
          },
          {
            mkd: `5. Фро*сина ___ (свр*ти) ле*во.`,
            answer: [`сврте/свртев/свртевме/свртеа`],
          },
          {
            mkd: `6. Ве*сна ко*нечно ___ (о*здрави).`,
            answer: [`оздраве/оздравев/оздравевме/оздравеа`],
          },
          {
            mkd: `7. Ма*рко ___ (се ка*чи) во воз.`,
            answer: [`се качи/се качив/се качивме/се качија`],
          },
          {
            mkd: `8. Па*вле ___ (на*рача) ка*фе.`,
            answer: [`нарача/нарачав/нарачавме/нарачаа`],
          },
          {
            mkd: `9. У*бавка ги ___ (пре*брои) па*рите у*ште е*днаш.`,
            answer: [`преброи/преброив/преброивме/преброија`],
          },
          {
            mkd: `10. Ко*га И*лиjа ги ___ (ви*ди) по*следен пат?.`,
            answer: [`виде/видов/видовме/видоа`],
          },
          {
            mkd: `11. А*нѓела го ___ (про*ба) здолни*штето.`,
            answer: [`проба/пробав/пробавме/пробаа`],
          },
          {
            mkd: `12. Jо*рдан не ___ (до*седи) да **[[PRONOUN_WORD]]** ка*ко пе*е Кароли*на.`,
            answer: [`доседе/доседов/доседовме/доседоа`],
          },
          {
            mkd: `13. Не*над ___ (скр*ши) ра*ка.`,
            answer: [`скрши/скршив/скршивме/скршија`],
          },
          {
            mkd: `14. А*нѓел ___ (и*згори) на сонце.`,
            answer: [`изгоре/изгорев/изгоревме/изгореа`],
          },
          {
            mkd: `15. На*де ги ___ (и*згори) пи*смата.`,
            answer: [`изгори/изгорив/изгоривме/изгорија`],
          },
          {
            mkd: `16. Зо*ран ги ___ (про*ба) пантало*ните во цр*на бо*jа.`,
            answer: [`проба/пробав/пробавме/пробаа`],
          },
        ],
      },
    },
  ],
};
