import { TablesProps } from "@/types";

export const occupationTable: TablesProps = {
  slug: "lesson-3",
  type: "occupation-table",
  title: {
    ru: `РОД ДЕЯТЕЛЬНОСТИ`,
    mkd: `<span>ЗИНИМАЊЕ</span>`,
  },
  content: {
    subtitle: [`Македонский язык`, `Русский язык`],
    words: [
      {
        mkd: "администа*тор/ка",
        ru: "администратор",
      },
      {
        mkd: "а*тер/ка",
        ru: "актёр/актриса",
      },
      {
        mkd: "амбаса*дор/ка",
        ru: "посол",
      },
      {
        mkd: "би*знисмен",
        ru: "бизнесмен",
      },
      {
        mkd: "во*дич",
        ru: "экскурсовод",
      },
      {
        mkd: "во*зач",
        ru: "водитель",
      },
      {
        mkd: "диплома*т",
        ru: "дипломат",
      },
      {
        mkd: "ди*ректор/дире*кторка",
        ru: "директор",
      },
      {
        mkd: "економи*ст/ка",
        ru: "экономист",
      },
      {
        mkd: "инжене*р",
        ru: "инженер",
      },
      {
        mkd: "ке*лнер/ка",
        ru: "официант/ка",
      },
      {
        mkd: "ле*кар/ка",
        ru: "врач",
      },
      {
        mkd: "ме*наџер/мена*џерка",
        ru: "менеджер",
      },
      {
        mkd: "ми*нистер/мини*стеркa",
        ru: "министр",
      },
      {
        mkd: "но*винар/нови*нарка",
        ru: "журналист/ка",
      },
      {
        mkd: "пензионе*р/ка",
        ru: "пенсионер/ка",
      },
      {
        mkd: "полица*ец",
        ru: "полицейский",
      },
      {
        mkd: "поли*тичар/полити*чарка",
        ru: "политик",
      },
      {
        mkd: "пра*вник",
        ru: "юрист",
      },
      {
        mkd: "преве*дувач/преведу*вачка",
        ru: "переводчик/ца",
      },
      {
        mkd: "програме*р",
        ru: "программист",
      },
      {
        mkd: "про*давач/продавачка",
        ru: "продавец/продавщица",
      },
      {
        mkd: "про*фесор/профе*сорка",
        ru: "преподаватель/ница, профессор",
      },
      {
        mkd: "ра*ботник",
        ru: "рабочий",
      },
      {
        mkd: "раково*дител/раководи*телка",
        ru: "руководитель/ница",
      },
      {
        mkd: "сметково*дител/сметководи*телка",
        ru: "бухгалтер",
      },
      {
        mkd: "со*бaрка",
        ru: "горничная",
      },
      {
        mkd: "специ*jалист/ка",
        ru: "специалист/ка",
      },
      {
        mkd: "споти*ст/ка",
        ru: "спотрсмен/ка",
      },
      {
        mkd: "слу*жбеник/службе*ничка",
        ru: "служащий/служащая",
      },
      {
        mkd: "студе*нт/ка",
        ru: "студент/ка",
      },
      {
        mkd: "у*чител/учи*телка",
        ru: "учитель/ница",
      },
      {
        mkd: "фри*зер/ка",
        ru: "парикхмахер",
      },
      {
        mkd: "чи*стач/ка",
        ru: "уборщик/уборщица",
      },
      {
        mkd: "чу*вар/ка",
        ru: "охранник/охранница",
      },
      {
        mkd: "шо*фер",
        ru: "шофёр",
      },
    ],
  },
};
