// import { GlossaryTableBlock } from "@/types";
import { TablesProps } from "@/types";

export const occupationTable: TablesProps = {
  slug: "lesson-3",
  type: "occupation-table",
  title: {
    ru: `РОД ДЕЯТЕЛЬНОСТИ`,
    mkd: `<span>ЗИНИМАЊЕ</span>`,
  },
  content: {
    subtitle: [`Македонский язык`, `Русский язык`],
    words: [
      {
        mkd: "администа\u0301тор/ка",
        ru: "администратор",
      },
      {
        mkd: "а\u0301тер/ка",
        ru: "актёр/актриса",
      },
      {
        mkd: "амбаса\u0301дор/ка",
        ru: "посол",
      },
      {
        mkd: "би\u0301знисмен",
        ru: "бизнесмен",
      },
      {
        mkd: "во\u0301дич",
        ru: "экскурсовод",
      },
      {
        mkd: "во\u0301зач",
        ru: "водитель",
      },
      {
        mkd: "диплома\u0301т",
        ru: "дипломат",
      },
      {
        mkd: "ди\u0301ректор/дире\u0301кторка",
        ru: "директор",
      },
      {
        mkd: "економи\u0301ст/ка",
        ru: "экономист",
      },
      {
        mkd: "инжене\u0301р",
        ru: "инженер",
      },
      {
        mkd: "ке\u0301лнер/ка",
        ru: "официант/ка",
      },
      {
        mkd: "ле\u0301кар/ка",
        ru: "врач",
      },
      {
        mkd: "ме\u0301наџер/мена\u0301џерка",
        ru: "менеджер",
      },
      {
        mkd: "ми\u0301нистер/мини\u0301стеркa",
        ru: "министр",
      },
      {
        mkd: "но\u0301винар/нови\u0301нарка",
        ru: "журналист/ка",
      },
      {
        mkd: "пензионе\u0301р/ка",
        ru: "пенсионер/ка",
      },
      {
        mkd: "полица\u0301ец",
        ru: "полицейский",
      },
      {
        mkd: "поли\u0301тичар/полити\u0301чарка",
        ru: "политик",
      },
      {
        mkd: "пра\u0301вник",
        ru: "юрист",
      },
      {
        mkd: "преве\u0301дувач/преведу\u0301вачка",
        ru: "переводчик/ца",
      },
      {
        mkd: "програме\u0301р",
        ru: "программист",
      },
      {
        mkd: "про\u0301давач/продавачка",
        ru: "продавец/продавщица",
      },
      {
        mkd: "про\u0301фесор/профе\u0301сорка",
        ru: "преподаватель/ница, профессор",
      },
      {
        mkd: "ра\u0301ботник",
        ru: "рабочий",
      },
      {
        mkd: "раково\u0301дител/раководи\u0301телка",
        ru: "руководитель/ница",
      },
      {
        mkd: "сметково\u0301дител/сметководи\u0301телка",
        ru: "бухгалтер",
      },
      {
        mkd: "со\u0301бaрка",
        ru: "горничная",
      },
      {
        mkd: "специ\u0301jалист/ка",
        ru: "специалист/ка",
      },
      {
        mkd: "споти\u0301ст/ка",
        ru: "спотрсмен/ка",
      },
      {
        mkd: "слу\u0301жбеник/службе\u0301ничка",
        ru: "служащий/служащая",
      },
      {
        mkd: "студе\u0301нт/ка",
        ru: "студент/ка",
      },
      {
        mkd: "у\u0301чител/учи\u0301телка",
        ru: "учитель/ница",
      },
      {
        mkd: "фри\u0301зер/ка",
        ru: "парикхмахер",
      },
      {
        mkd: "чи\u0301стач/ка",
        ru: "уборщик/уборщица",
      },
      {
        mkd: "чу\u0301вар/ка",
        ru: "охранник/охранница",
      },
      {
        mkd: "шо\u0301фер",
        ru: "шофёр",
      },
    ],
  },
};
