import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Переведите со словарём.

        (Подсказка: Вы можете перетащить и вставить слово в нужное пустое поле в предложении, также вы можете просто напечатать его и
        проверить свою работу нажав на кнопку "Проверить мою работу".)

        Вставьте данные слова в подходящее место:
        
        <span>**го*дина, амбаса*дор, со*држи, вла*шки, не*среќа, а*лбум, свеќи**</span>`,
      ],

      content: {
        sentences: [
          {
            mkd: `То*ше Про*ески е по*знат маке*донски пе*jач и го*лема sве*зда на балка*нската му*зична сце*на. Се ро*ди во 1981 ___ во При*леп.`,
            answer: [`го*дина`],
          },
          {
            mkd: `Него*вите роди*тели се од Кру*шево. Во 1992 го*дина наста*пува на де*тскиот фестива*л "Зла*тно Сла*веjче" со пе*сна на ___ 
            jа*зик`,
            answer: [`вла*шки`],
          },
          {
            mkd: `Него*вата карие*ра запо*чнува во 1997 го*дина ко*га побе*дува на фестива*лот "Ме*лфест" со пе*сната Yesterday од Би*тлси. Во 
            1999 го и*здава сво*jот ___ "Не*каде во но*ќта" со едина*есет пе*сни.`,
            answer: [`а*лбум`],
          },
          {
            mkd: `Ср*пската проду*кциска гру*па ги отку*пува пра*вата за изда*вање на него*виот сле*ден а*лбум на про*сторот на пора*нешна 
            Jугосла*виjа. То*ше Про*ески ста*нува мно*гу попула*рен. Тре*тиот а*лбум, "А*ко ме по*гледнеш, во о*чи" ___ пе*сни на маке*донски 
            и ср*пски jа*зик.`,
            answer: [`со*држи`],
          },
          {
            mkd: `По*ради го*лем броj хуманита*рни ко*нцерти, То*ше Про*ески jа до*бива хуманита*рната на*града "Ма*jка Тере*за" и ста*нува 
            региона*лен ___ на УНИЦЕФ.`,
            answer: [`амбаса*дор`],
          },
          {
            mkd: `Во 2004 го*дина наста*пува на "Еврови*зиjа" ка*ко пре*тставник на Маке*донија. На прес-конференци*ите ги импресиони*ра 
            новина*рите со сво*ите о*перски спосо*бности. И*стата го*дина е име*нуван за Амбаса*дор на до*бра во*лjа на УНИЦЕФ. По*краj
            попула*рна му*зика То*ше Про*ески пе*е на*родни маке*донски пе*сни што резулти*ра со а*лбумот "Бо*жилак". По*ради добротво*рната
            де*jност, прекра*сниот глас и скро*мноста лу*ѓето го ви*каат пе*jачот "а*нгел".`,
            answer: [``],
          },
          {
            mkd: `Него*вата смрт во сообраќа*jната ___ во 2007 го*дина предизви*кува шок и го*лема та*га низ Маке*донија и поши*роко.`,
            answer: [`не*среќа`],
          },
          {
            mkd: `До ден-де*нес Македо*нците го спомну*ваат со со*лзи, а на него*виот гроб во Кру*шево се*когаш се па*лат ___.`,
            answer: [`све*ќи`],
          },
        ],
      },
    },
  ],
};
