import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Образуйте деепричастия от следующих глаголов.`],
      content: {
        sentences: [
          {
            mkd: `ве*тува ___,`,
            answer: [`ветува*јќи`],
          },
          {
            mkd: `се бри*чи — ___,`,
            answer: [`бриче*јќи`],
          },
          {
            mkd: `вле*гува — ___,`,
            answer: [`влегува*јќи`],
          },
          {
            mkd: `вли*jае — ___,`,
            answer: [`влијае*јќи`],
          },
          {
            mkd: `се ми*е — ___,`,
            answer: [`мие*јќи се`],
          },
          {
            mkd: `мо*ли — ___,`,
            answer: [`моле*јќи`],
          },
          {
            mkd: `на*вива — ___,`,
            answer: [`навива*јќи`],
          },
          {
            mkd: `се нерви*ра — ___,`,
            answer: [`нервира*јќи се`],
          },
          {
            mkd: `но*си — ___,`,
            answer: [`носе*јќи`],
          },
          {
            mkd: `пе*е — ___,`,
            answer: [`пее*јќи`],
          },
          {
            mkd: `пи*е — ___,`,
            answer: [`пие*јќи`],
          },
          {
            mkd: `се пла*ши — ___,`,
            answer: [`плаше*јќи се`],
          },
          {
            mkd: `пра*ви — ___,`,
            answer: [`праве*јќи`],
          },
          {
            mkd: `пра*шува — ___,`,
            answer: [`прашува*јќи`],
          },
          {
            mkd: `тро*ши — ___,`,
            answer: [`троше*јќи`],
          },
          {
            mkd: `се*ди — ___,`,
            answer: [`седе*јќи`],
          },
          {
            mkd: `се*днува — ___,`,
            answer: [`седнува*јќи`],
          },
          {
            mkd: `се чеки*ра — ___,`,
            answer: [`чекира*јќи се`],
          },
          {
            mkd: `се чу*ди — ___.`,
            answer: [`чуде*јќи се`],
          },
        ],
      },
    },
  ],
};
