import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте предложения по образцу, используя союз <span>на*место да</span>.`,
      ],

      content: {
        text: `<span>Ма*риjа не*ма да и*злезе во град со друга*рите. Ќе у*чи. — На*место да и*злезе во град со друга*рките Ма*риjа ќе у*чи.</span>`,
        sentences: [
          {
            mkd: `1. Зо*што ти не ми по*магна? Ми пре*чеше. — ___?`,
            answer: [`Зо*што на*место да ми по*магнеш ти ми пре*чеше`],
          },
          {
            mkd: `2. Просе*чната пла*та не*ма да ра*сте. Ќе се нама*лува. — ___.`,
            answer: [`Просе*чната пла*та на*место да ра*сте ќе се нама*лува`],
          },
          {
            mkd: `3. Не нѐ ра*дува. Ни пра*ви про*блеми. — ___.`,
            answer: [`На*место да нѐ ра*дува ни пра*ви про*блеми`],
          },
          {
            mkd: `4. Не спи*jам. Ра*ботам. — ___.`,
            answer: [`На*место да спи*jам ра*ботам`],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
