import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте предложения по образцу, используя союз <span>о*свен што</span>.`,
      ],

      content: {
        text: `<span>О*воj пи*jалак е здрав. По*мага да осла*бнете. — О*воj пи*jалак о*свен што е здрав по*мага да осла*бнете.</span>`,
        sentences: [
          {
            mkd: `1. Капите*нот е до*бар фудбале*р. И до*бро глу*ми. — ___.`,
            answer: [`Капите*нот о*свен што е до*бар фудбале*р до*бро глу*ми`],
          },
          {
            mkd: `2. Година*ва не*ма ви*шни. И не*ма коj да ги бе*ре. — ___.`,
            answer: [`Година*ва о*свен што не*ма ви*шни не*ма коj да ги бе*ре`],
          },
          {
            mkd: `3. Доби*вате по*брз и*нтернет. Доби*вате нов сма*ртфон. — ___.`,
            answer: [
              `О*свен што доби*вате по*брз и*нтернет доби*вате нов сма*ртфон`,
            ],
          },
          {
            mkd: `4. Тоj бил го*лем на*учник. Бил по*ет, пи*сател, кри*тичар, преве*дувач, акаде*мик и про*фесор. — ___.`,
            answer: [
              `Тоj о*свен што бил го*лем на*учник бил по*ет, пи*сател, кри*тичар, преве*дувач, акаде*мик и про*фесор`,
            ],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
