import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте предложения по образцу, используя союз <span>о*свен да</span>.`,
      ],

      content: {
        text: `<span>И*маш вре*ме за сѐ, не не у*чиш. — И*маш вре*ме за сѐ о*свен да у*чиш.</span>`,
        sentences: [
          {
            mkd: `1. Не ти оста*нува ни*што дру*го. Тре*ба да го о*ткажеш ко*нцертот. — ___.`,
            answer: [
              `Не ти оста*нува ни*што дру*го о*свен да го о*ткажеш ко*нцертот`,
            ],
          },
          {
            mkd: `2. Не са*кам ни*што по*веќе. Са*кам да се ви*дам со мо*ите роди*тели. — ___.`,
            answer: [
              `Не са*кам ни*што по*веќе о*свен да се ви*дам со мо*ите роди*тели`,
            ],
          },
          {
            mkd: `3. Не*маме дру*га цел. Са*каме да го доне*семе о*воj виолини*ст во Македо*нија. — ___.`,
            answer: [
              `Не*маме дру*га цел о*свен да го доне*семе о*воj виолини*ст во Македо*нија`,
            ],
          },
          {
            mkd: `4. Не*маат друг и*збор. Тре*ба да у*чат. — ___.`,
            answer: [`Не*маат друг и*збор о*свен да у*чат`],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
