import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Трансформируйте предложения по образцу.`],

      content: {
        text: `<span>Ко*га jа [чи*тав] тво*jата кни*га ни*што не забеле*жував. — Чита*jќи jа тво*jата кни*га ни*што не забеле*жував.</span>`,
        sentences: [
          {
            mkd: `1. Фабри*ката ра*боти и негати*вно [вли*jае] врз околи*ната. — ___.`,
            answer: [`Фабри*ката ра*боти негативно влиjае*јќи врз околи*ната`],
          },
          {
            mkd: `2. [Забеле*жуваш] са*мо е*ден де*таљ и jа ре*шаваш детекти*вската за*дача. — ___.`,
            answer: [
              `Забележува*jќи са*мо е*ден де*таљ jа ре*шаваш детекти*вската за*дача`,
            ],
          },
          {
            mkd: `3. Коле*гите се споде*лиjа со сво*ето и*скуство ко*га [збору*ваа] за ра*злични про*екти. — ___.`,
            answer: [
              `Колегите се споде*лиjа со сво*ето и*скуство зборува*јќи за ра*злични про*екти`,
            ],
          },
          {
            mkd: `4. Ќе [се ли*згаш] по замрзна*то е*зеро и ќе сти*гнеш до це*лта. — ___.`,
            answer: [`Лизга*јќи се по замрзна*то е*зеро ќе сти*гнеш до це*лта`],
          },
          {
            mkd: `5. Ко*га [сведо*чеме] за на*станот изjа*вивме де*ка презе*маме одго*ворност. — ___.`,
            answer: [
              `Сведоче*јќи за на*станот изjа*вивме де*ка презе*маме одго*ворност`,
            ],
          },
          {
            mkd: `6. Настра*давте ко*га [пра*вевте] акроба*ции на мо*торот? — ___?`,
            answer: [`Настра*давте праве*јќи акроба*ции на мо*торот`],
          },
          {
            mkd: `7. [Кра*тев] непродукти*вни тро*шоци и за*штедив 200 е*вра. — ___.`,
            answer: [`Крате*јќи непродукти*вни тро*шоци за*штедив 200 е*вра`],
          },
          {
            mkd: `8. Води*телот наjаву*ваше се*коjа пе*сна и [се шегу*ваше] на сво*jа сме*тка. — ___.`,
            answer: [
              `Води*телот наjаву*ваше се*коjа пе*сна шегува*јќи се на сво*jа сме*тка`,
            ],
          },
          {
            mkd: `9. [Уди*раат] со ко*ла во о*воj sид и загину*ваат. — ___.`,
            answer: [`Удира*јќи со ко*ла во о*воj sид загину*ваат`],
          },
          {
            mkd: `10. О*воj ден христиjа*нските ве*рници о*дат во цр*ква и [се сеќа*ваат] на сво*ите пре*дци. — ___.`,
            answer: [
              `О*воj ден христиjа*нските ве*рници о*дат во цр*ква сеќава*јќи се на сво*ите пре*дци`,
            ],
          },
          {
            mkd: `11. Го [по*знавам] но*виот ди*ректор и знам што нѐ че*ка. — ___.`,
            answer: [`Познава*јќи го но*виот ди*ректор знам што нѐ че*ка`],
          },
          {
            mkd: `12. Ко*га ќе го [помину*ваме] мо*стот ќе ти се jа*виме. — ___.`,
            answer: [`Поминува*јќи го мо*стот ќе ти се jа*виме`],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
