import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-16",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Переделайте предожение по образцу.`],

      content: {
        text: `<span>Го сме*нив телефо*нот. Не ги и*згубив подато*ците. — Го сме*нив телефо*нот без да ги и*збубам подато*ците.</span>`,
        sentences: [
          {
            mkd: `1. Сли*карот ги и*зрази сво*ите чу*вства. Не кажа ни*ту е*ден збор. — ___.`,
            answer: [
              `Сли*карот ги и*зрази сво*ите чу*вства без да каже ни*ту е*ден збор`,
            ],
          },
          {
            mkd: `2. Зо*што изле*говте? Не се поздра*вивте со го*стите. — ___?`,
            answer: [`Зо*што изле*говте без да се поз*дравите со го*стите`],
          },
          {
            mkd: `3. Го тро*шиш вре*мето. Не го забе*лежа то*а? — ___.`,
            answer: [`Го тро*шиш вре*мето без да го забе*лежиш то*а`],
          },
          {
            mkd: `4. Програме*рите го имплементи*раа о*воj си*стем. Не ги пра*шаа клие*нтите. — ___.`,
            answer: [
              `Програме*рите го имплементи*раа о*воj си*стем без да ги пра*шаат клие*нтите`,
            ],
          },
          {
            mkd: `5. Не ку*пувам о*блека. Не jа про*бам. — ___.`,
            answer: [`Не ку*пувам о*блека без да jа про*бам`],
          },
          {
            mkd: `6. Раскину*ваат дого*вори. Не пла*ќаат пе*нали. — ___?`,
            answer: [`Раскину*ваат дого*вори без да пла*ќаат пе*нали`],
          },
          {
            mkd: `7. Тинеjџе*рите избе*гаа од рестора*нот. Не jа пла*тиjа сме*тката. — ___.`,
            answer: [
              `Тинеjџе*рите избе*гаа од рестора*нот без да jа пла*тат сме*тката`,
            ],
          },
          {
            mkd: `8. Ка*ко ќе jа о*твориш вра*тата? Не*ма да го ко*ристиш клу*чот? — ___?`,
            answer: [
              `Ка*ко ќе jа о*твориш вра*тата без да го ко*ристиш клу*чот`,
            ],
          },
          {
            mkd: `9. О*длично поми*навме на о*дмор. Не потро*шивме мно*гу па*ри. — ___.`,
            answer: [
              `О*длично поми*навме на о*дморот без да потро*шиме мно*гу па*ри`,
            ],
          },
          {
            mkd: `10. Градонача*лникот до*несе о*длука. Не ги слу*ша експе*ртите. — ___.`,
            answer: [
              `Градонача*лникот до*несе о*длука без да ги слу*шне експе*ртите`,
            ],
          },
        ],
      },
    },
  ],
};

// «»  []  ѐ
