import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-16",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Сегодня мы встречались с Наумом и Эмилией. Я заметила объявление о том, что в субботу в церкви святой Софии будет концерт 
        классической музыки. Мы с Иваном очень давно хотели её посетить, поэтому сразу же решили пойти на концерт. Иван читал об исполнителе,
        это очень известный пианист Симон Трпчевски. Он будет исполнять произведения Генделя, Моцарта, Бетховена, Чайковского. Мы предложили
        Эмилии и Науму пойти вместе с нами. Эмилия согласилась и сказала, что пригласит ещё своего брата. Её брат играет на скрипке. Он
        закончил музыкальную школу и посещает все концерты в рамках фестиваля "Охридское лето". Это очень популярный фестиваль в Македонии.
        Каждый год организаторам удаётся пригласить известных музыкантов, при этом цены доступные. Наум отказался. Оказывается, он не выносит
        классическую музыку и слушает только рок. Он пригласил нас в клуб, где будет выступать новая македонская группа. Мы согласились,
        потому что любим всякую музыку, и классическую, и народную, и рок. Иван спросил, где он мог бы послушать народную музыку. Я ответила,
        что мы пойдём на выступление ансамбля "Танец". Они исполняют народные песни и танцуют оро в народных костюмах. Моя подруга обещала
        мне места в первом ряду. А Наум посоветовал Ивану пойти в национальный ресторан, где вечером музыканты играют на кавале, гайде,
        зурне, аккордеоне и барабане, а посетители поют песни и танцуют оро.`,
        answer: [
          `Денес се сретнавме со Наум и Емилија. Го забележав огласот дека в сабота во црквата Света Софија ќе има концерт на класична музика. 
          Ние со Иван многу одамна сакавме да ја посетиме затоа веднаш одлучивме да одиме на концертот. Иван читал за изведувачот, тоа е
          познатиот пијанист Симон Трпчевски. Ќе изведува дела на Хендл, Моцарт, Бетовен, Чајковски. Им предложивме на Емилија и (на) Наум да
          одат заедно со нас. Емилија се согласи и кажа дека ќе го **покани / викне** нејзиниот брат. Брат ѝ свири виолина. Заврши музичко училиште
          и ги посетува сите концерти во рамките на фестивалот "Охридско лето". Тоа е многу популарен фестивал во Македонија. Секоја година
          организаторите успеваат да **донесат / поканат** неколку големи **имиња / познати** музичари, а при тоа цените се пристапни. Наум се
          откажа. **Излезе / Се** покажа дека не поднесува класична музика и слуша само рок. Нè покани во клуб каде што ќе настапува еден нов
          македонски бенд. Се согласивме затоа што сакаме секаква музика, и класична, и народна, и рок. Иван праша каде би можел да слушне
          народна музика. Му одговорив дека ќе одиме на настапот на ансамблот "Танец". Изведуваат народни песни и играат ора во традиционални
          носии. Другарка ми ми вети билети во првиот ред. А Наум му препорача на Иван да оди во кафеана каде што навечер музичарите свират
          кавал, гајда, зурла, хармоника и тапан, а гостите пеат песни и играат ора.`,
        ],
      },
    },
  ],
};
