import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-16",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Кто выступает? — Наш любимый певец. 2. На фестивале будут выступать разные музыкальные группы. 3. Наши ученики не будут 
        выступать на этом концерте. 4. Пожалуйста, не выступайте на этом фестивале. 5. Пусть танцоры не выступают. 6. Мы никогда раньше не
        выступали с этими произведениями. 7. Журналист сказал, что эти музыканты выступали с этими произведениями много раз. 8. Если бы он не
        выступал в Америке, о нём бы никто не говорил.`,
        answer: [
          `1. Кој настапува? — Нашиот омилен пејач. 2. На фестивалот ќе настапуваат различни музички бендови. 3. Нашите ученици нема да 
          настапуваат на овој концерт. 4. Ве молам, не настапувајте на овој фестивал. 5. Танчарите нека не настапуваат. 6. Никогаш порано не
          сме настапувале со овие дела. 7. Новинарот кажа дека музичарите многупати настапувале со овие дела. 8. **Да не настапуваше во Америка
          никој немаше да зборува за него. / Да не настапуваше во Америка никој не би зборувал за него.**`,
        ],
      },
    },
  ],
};
