import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-4",
  sections: [
    {
      type: "paragraph-exercise",
      singleInput: true,
      prompt: [`Поставьте предложение в будущее время.`],
      content: {
        original: `<span>Ѓо\u0301рѓи ве\u0301ќе е во Ско\u0301пjе. Се ка\u0301чува во та\u0301кси и о\u0301ди до "Хо\u0301лидеj Инн".
        Сти\u0301гнува за поло\u0301вина час, Пл\u0301аќа и вле\u0301гува во хо\u0301телот. И\u0301ма резерва\u0301циjа за
        еднокре\u0301ветна со\u0301ба за две но\u0301ќи на него\u0301вото пре\u0301зиме. Пла\u0301ќа во го\u0301тово и се ка\u0301чува
        на ше\u0301сти кат. По\u0301тоа о\u0301ди во ре\u0301сторан и пи\u0301е ка\u0301фе.</span>
        `,
        answer: [
          `Цела недела нема да имам слободно време. Ќе станувам многу рано, ќе се туширам, ќе пиjам кафе, но нема да поjадувам,ќе се облекувам
          и ќе одам на работа. На работа ќе пишувам меjлови и ќе разговарам со клиентите преку телефон. Во еден ќе одам на ручек со колегите
          во еден убав италиjански ресторан. Ќе jадеме и ќе разговараме за нашите планови. Потоа ќе се враќаме на работа. Со работа ќе завршувам
          во шест, но нема да се враќам дома. Ќе се сретнувам со моите приjатели од Македониjа. Заедно ќе вечераме во некоj ресторан. Ако времето
          биде убаво ќе шетаме низ Битола. Во десет другарите ќе одат дома, а jас ќе одам во продавница. Ќе купувам се што ќе ми треба и ќе се
          враќам дома. Дома веднаш ќе легнувам да спиjам.`,
        ],
      },
    },
  ],
};
