import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-4",
  sections: [
    {
      type: "paragraph-exercise",
      singleInput: true,
      prompt: [`Поставьте предложение в будущее время.`],
      content: {
        original: `<span>
          Це\u0301ла не\u0301дела не\u0301мам сло\u0301бодно вре\u0301ме. Ста\u0301нувам мно\u0301гу ра\u0301но, се
          туши\u0301рам, пи\u0301jам ка\u0301фе, но не поjа\u0301дувам, се обле\u0301кувам и о\u0301дам на ра\u0301бота. На ра\u0301бота
          пи\u0301шувам ме\u0301jлови и разго\u0301варам со клие\u0301нтите пре\u0301ку телефо\u0301н. Во е\u0301ден о\u0301дам на ру\u0301чек
          со коле\u0301гите во е\u0301ден у\u0301бав италиjа\u0301нски ре\u0301сторан. Jа\u0301деме и разгова\u0301раме за на\u0301шите
          пла\u0301нови. По\u0301тоа се вра\u0301ќаме на ра\u0301бота. Со ра\u0301бота завр\u0301шувам во шест, но не се вра\u0301ќам
          до\u0301ма. Се сре\u0301тнувам со мо\u0301ите приjа\u0301тели од Македо\u0301ниjа. За\u0301едно вече\u0301раме во не\u0301коj
          ре\u0301сторан. А\u0301ко вре\u0301мето е у\u0301баво ше\u0301таме низ Би\u0301тола. Во де\u0301сет друга\u0301рите о\u0301дат
          до\u0301ма, а jас о\u0301дам во прода\u0301вница. Ку\u0301пувам се што ми тре\u0301ба и се вра\u0301ќам до\u0301ма. До\u0301ма
          ве\u0301днаш ле\u0301гнувам да спи\u0301jам.
          </span>
        `,
        answer: [
          `Цела недела нема да имам слободно време. Ќе станувам многу рано, ќе се туширам, ќе пиjам кафе, но нема да поjадувам,ќе се облекувам
          и ќе одам на работа. На работа ќе пишувам меjлови и ќе разговарам со клиентите преку телефон. Во еден ќе одам на ручек со колегите
          во еден убав италиjански ресторан. Ќе jадеме и ќе разговараме за нашите планови. Потоа ќе се враќаме на работа. Со работа ќе завршувам
          во шест, но нема да се враќам дома. Ќе се сретнувам со моите приjатели од Македониjа. Заедно ќе вечераме во некоj ресторан. Ако времето
          биде убаво ќе шетаме низ Битола. Во десет другарите ќе одат дома, а jас ќе одам во продавница. Ќе купувам се што ќе ми треба и ќе се
          враќам дома. Дома веднаш ќе легнувам да спиjам.`,
        ],
      },
    },
  ],
};
