import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-4",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте предлоги <span>за</span>, <span>зад</span>, <span>ме\u0301ѓу</span>, <span>над</span>, <span>по</span>, <span>под</span>, 
        <span>пред</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. То\u0301а се подаро\u0301ците ___ родни\u0301ните. 2. Тре\u0301ба да о\u0301дите ___ о\u0301ваа у\u0301лица и ќе
            сти\u0301гнете до хо\u0301телот. 3. ___ згра\u0301дата ле\u0301таат пти\u0301ци. 4. Ме\u0301трото се на\u0301оѓа ___ зе\u0301мjата.
            5. Ни\u0301што не гле\u0301дам за\u0301тоа што ___ ме\u0301не се\u0301ди е\u0301ден мно\u0301гу ви\u0301сок чо\u0301век.
            6. Де\u0301тето се кри\u0301е ___ др\u0301вото. 7. Хо\u0301телот се на\u0301оѓа ___ цр\u0301квата и мо\u0301стот.
            `,
            answer: [`за`, `по`, `Над`, `под`, `пред`, `зад`, `меѓу`],
          },
        ],
      },
    },
  ],
};
