import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-4",
  sections: [
    {
      type: "paragraph-exercise",
      singleInput: true,
      prompt: [`Поставьте предложение в будущее время.`],
      content: {
        original: `<span>
          Це*ла не*дела не*мам сло*бодно вре*ме. Ста*нувам мно*гу ра*но, се
          туши*рам, пи*jам ка*фе, но не поjа*дувам, се обле*кувам и о*дам на ра*бота. На ра*бота
          пи*шувам ме*jлови и разго*варам со клие*нтите пре*ку телефо*н. Во е*ден о*дам на ру*чек
          со коле*гите во е*ден у*бав италиjа*нски ре*сторан. Jа*деме и разгова*раме за на*шите
          пла*нови. По*тоа се вра*ќаме на ра*бота. Со ра*бота завр*шувам во шест, но не се вра*ќам
          до*ма. Се сре*тнувам со мо*ите приjа*тели од Македо*ниjа. За*едно вече*раме во не*коj
          ре*сторан. А*ко вре*мето е у*баво ше*таме низ Би*тола. Во де*сет друга*рите о*дат
          до*ма, а jас о*дам во прода*вница. Ку*пувам се што ми тре*ба и се вра*ќам до*ма. До*ма
          ве*днаш ле*гнувам да спи*jам.
          </span>
        `,
        answer: [
          `Цела недела нема да имам слободно време. Ќе станувам многу рано, ќе се туширам, ќе пиjам кафе, но нема да поjадувам,ќе се облекувам
          и ќе одам на работа. На работа ќе пишувам меjлови и ќе разговарам со клиентите преку телефон. Во еден ќе одам на ручек со колегите
          во еден убав италиjански ресторан. Ќе jадеме и ќе разговараме за нашите планови. Потоа ќе се враќаме на работа. Со работа ќе завршувам
          во шест, но нема да се враќам дома. Ќе се сретнувам со моите приjатели од Македониjа. Заедно ќе вечераме во некоj ресторан. Ако времето
          биде убаво ќе шетаме низ Битола. Во десет другарите ќе одат дома, а jас ќе одам во продавница. Ќе купувам се што ќе ми треба и ќе се
          враќам дома. Дома веднаш ќе легнувам да спиjам.`,
        ],
      },
    },
  ],
};
