import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-4",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Если музей открыт с 10 часов, ты туда пойдешь? 2. Если музей открыт с 10 часов, вы туда пойдете? 3. Если музей открыт
        не с 10 часов, наши друзья туда не пойдут? 4. Если музей не будет открыт с 10 часов, мы туда не пойдем? 5. Если вы пойдете на прогулку
        с нами, вы увидите интересные места. 6. У тебя есть деньги? 7. У тебя будут деньги послезавтра? 8. В этом городе есть старые мечети,
        церкви, бани и постоялые дворы. 9. В нашем городе нет железнодорожного вокзала. 10. Здесь есть гостиница? — Нет, здесь нет гостиницы.
        11. Гостиница здесь? — Нет, гостиница не здесь. 12. Давайте пойдем в музей македонской борьбы завтра. 13. Давай повернем направо и
        вернёмся в нашу гостиницу.
        `,
        answer: [
          `1. Ако музеjот е отворен од 10 часот дали ќе одиш таму? 2. Ако музеjот биде отворен од 10 часот дали ќе одите таму?
          3. Ако музеjот не е отворен од 10 часот нашите приjатели нема да одат таму. 4. Ако музеjот не биде отворен од 10 часот
          нем да одиме таму. 5. Ако одите на прошетка со нас ќе видите интересни места. 6. Дали имаш пари? 7. Дали ќе имаш пари задутре?
          8. Во овоj град има стари џамии, цркви, амами и анови. 9. Во нашиот град нема железничка станица. 10. Дали тука има хотел? — Не,
          тука нема хотел. 11. Хотелот е тука? — Не, хотелот не е тука. 12. Аjде да одиме во музеjот на македонската борба утре. 13. Аjде да
          свртиме десно и ќе се вратиме во нашиот хотел.`,
        ],
      },
    },
  ],
};
