import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-4",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `Завтра Наташа и её муж встанут очень рано, примут душ, оденутся, позавтракают в ресторане и пойдут гулять по городу.
        Сначала они дойдут до площади Македонии вдоль Вардара, потом перейдут по Каменному мосту и пойдут дальше. Они пройдут мимо церкви
        святого Димитрия и остановятся перед баней Даут-паши 15 века. Сейчас здесь находится Национальная галерея Македонии. Если у Наташи
        и её мужа будет время, они обязательно её посетят. Потом они перейдут по мосту над бульваром Гоце Делчева и войдут в старый торгово-
        ремесленный район Чаршию. Они пойдут направо, дойдут до Капан-ана, продолжат идти прямо до мечети Мурат-паши и повернут налево. Потом
        Наташа и её муж сядут в кафе и выпьют кофе. Если будет хорошая погода, они поедут в античный город Скупи, который находится в 5
        км от центра. После Скупи они вернутся в гостиницу. 
        `,
        answer: [
          `Утре Наташа и маж ѝ ќе станат многу рано, ќе се истушираат, ќе се облечат, ќе поjадуваат во еден ресторан и ќе одат да шетаат низ 
          град. Прво ќе доjдат до праштодот Македониjа покраj Вардар, потоа преминат по Камениот мост и ќе продолжат просто. Ќе поминат покраj
          црквата Свети Димитриjа и ќе застанат пред Даут-Пашиниот амам од 15 век. Сега тука се наоѓа Националната галериjа на Македониjа.
          Ако Наташа и неjзиниот маж ќе имаат време, задолжително ќе jа посетат. Потоа ќе преминат преку мостот над булеварот Гоце Делчев и
          ќе влезат во Старата скопска чаршиjа. Ќе одат десно, ќе доjдат до Капан ан, ќе продолжат право до Мурат-пашината џамиjа и ќе свртат
          лево. Потоа Наташа и маж ѝ ќе седнат во некое кафуле и ќе се напиjат кафе. Ако времето биде убаво, ќе одат во античкиот град Скупи,
          коj е наоѓа на 5 км од центарот. По Скупи ќе се вратат во хотелот.`,
        ],
      },
    },
  ],
};
