import { TablesProps } from "@/types";

export const imperfect: TablesProps = {
  type: `grammar-imperfect-table`,
  slug: "lesson-6",
  title: {
    ru: "ГРАММАТИКА",
    mkd: "ГРАМАТИКА",
  },
  subtitle: "ИМПЕРФЕКТ",
  text: `Имперфект от глаголов несовершённого вида (отвечают на вопрос <em>что делать?</em>) используется для повествования о прошлом,
    свидетелем которого был говорящий. При образовании имперфекта у глаголов и-класса <span>и</span> чередуется с <span>е</span>
    (<span>о*ди</span>, <span>бро*и</span>). У глаголов е-класса и и-класса, оканчивающихся на две гласных (<span>пи*е</span>,
    <span>бро*и</span>), в форме 3-го л. мн. ч. появляется <span>j</span>.`,
  content: {
    subtitle: [" ", "чита", "јаде", "пие", "оди", "брои"],
    rows: [
      {
        person: "јас",
        forms: ["чита-в", "јаде-в", "пие-в", "оде-в", "брое-в"],
      },
      {
        person: "ти",
        forms: ["чита-ше", "јаде-ше", "пие-ше", "оде-ше", "брое-ше"],
      },
      {
        person: "тој, таа, тоа",
        forms: ["чита-ше", "јаде-ше", "пие-ше", "оде-ше", "брое-ше"],
      },
      {
        person: "ние",
        forms: ["чита-вме", "јаде-вме", "пие-вме", "оде-вме", "брое-вме"],
      },
      {
        person: "вие",
        forms: ["чита-вте", "јаде-вте", "пие-вте", "оде-вте", "брое-вте"],
      },
      {
        person: "тие",
        forms: ["чита-а", "јаде-а", "пие-ја", "оде-а", "брое-ја"],
      },
    ],
  },
};
