import { ParagraphSectionsProps } from "@/types";

export const countablePlural: ParagraphSectionsProps = {
  type: "grammar-countable-plural",
  slug: "lesson-2",
  content: {
    subtitle: "СЧЁТНОЕ МНОЖЕСТВЕННОЕ",
    text: `Если числительное употребляется с существительным мужского рода, то это существительное может стоять в счётной форме, которая
    образуется прибавлением окончания <span>«-а»</span> к основе единственного числа: <span>фи*лм</span> - <span>два фи*лма</span>,
    <span>а*втобус</span> - <span>два авто*буса</span>. Форма обычного множественного числа также возможна. Счётная форма более частотна при
    отсутствии других определений (<span>два фи*лма</span> «два фильма» и <span>два но*ви фи*лма/фи*лмови</span> «два новых фильма») для
    односложных, чем для многосложных слов (<span>два авто*буса/авто*буси</span>). Иногда частотность зависит от одного слова
    (<span>два земjо*треси</span> «два землетрясения» чаще, чем <span>два земjо*треса</span>, но <span>два авто*буса</span> чаще, чем
    <span>два авто*буси</span>). У слова <span>па*т</span> употребление счетной формы зависит от значения: <span>де*сет па*та</span>
    «десять дорог», но только <span>десе*тпати</span> «десять раз».
    `,
  },
};
