import { ParagraphSectionsProps } from "@/types";

export const genderOfNouns: ParagraphSectionsProps = {
  type: "grammar-gender-of-noun",
  slug: "lesson-2",
  title: ["ГРАММАТИКА", "<span>ГРАМАТИКА</span>"],
  subtitle: "ИМЯ СУЩЕСТВИТЕЛЬНОЕ",
  content: {
    subtitle: "РОД ИМЁН СУЩЕСТВИТЕЛЬНЫХ",
    text: `Как и в русском языке, в македонском существительные делятся на существительные мужского, женского и среднего рода. Большинство
    существительных мужского рода оканчиваются на согласный: <span>брат</span>. К мужскому роду относятся существительные на <span>«-а»</span>,
    <span>«-о»</span>, <span>«-е»</span>, <span>«-у»</span>, <span>«-и»</span>, обозначающие лиц мужского пола: <span>су*диjа</span> «судья»,
    <span>И*лија, Ма*рко, та*тко</span> «отец», <span>ву*јко</span> «дядя» (со стороны матери), <span>де*чко</span> «парень»,
    <span>аташ*е</span> «атташе», <span>Пе*тре</span> «Пэтрэ», <span>гу*ру</span> «гуру», <span>де*нди</span> «деньди», а также мужские имена
    и названия месяцев на: <span>«-и»</span>: <span>Г*о*рг*и</span>, <span>Jануа*ри</span>, <span>Февруа*ри</span>.
    
    Существительные женского рода обычно оканчиваются на <span>«-а»</span> (<span>ма*jка</span> «мать», <span>И*вана</span>), некоторые - на
    согласный (<span>нок*</span> «ночь», все с суффиксом <span>-ост</span>: <span>ра*дост</span> «радость», <span>мла*дост</span> «молодость»).
    Женские имена на <span>«-и»</span>, <span>«-е»</span> могут восприниматься как существительные и женского, и среднего рода:
    <span>мо*јата/ мо*јето Ли*ле, Ма*хи</span>.
    
    Существительные среднего рода оканчиваются на <span>«-о»</span>, <span>«-е»</span>, <span>«-у»</span>, <span>«-и»</span>:
    <span>е*зеро</span> «озеро», <span>мо*мче</span> «парень», <span>де*воjче</span> «девочка», <span>жири*</span> «жюри»,
    <span>интервjу*</span> «интервью, собеседование».
    
    Существительные с уменьшительно - ласкательным суффиксом <span>«-че»</span> обычно относятся к существительным среднего рода, однако если
    они обозначают лицо мужского пола, возможны колебания - некоторые слова будут мужского рода (<span>ву*jче</span> «дядюшка»), а некоторые -
    среднего (<span>бра*тче</span> «братик»).
    
    Есть существительные, которые в зависимости от пола обозначаемого ими лица могут согласовываться по женскому или по мужскому роду:
    <span>мо*jата ро*днина</span> «моя родственница» и <span>мо*jот ро*днина</span> «мой родственник». Русская лексикографическая традиция
    относит такие слова к существительным общего рода, а македнская трактует их как амонимы - один мужского рода, а другой женского.`,
  },
};
