import { ParagraphSectionsProps } from "@/types";

export const masculineNouns: ParagraphSectionsProps = {
  type: "grammar-masculine-noun",
  slug: "lesson-2",
  content: {
    subtitle: "СУЩЕСТВИТЕЛЬНЫЕ МУЖСКОГО РОДА",
    text: `Если односложное существительное оканчивается на <span>«ч»</span>, <span>«ж»</span>, <span>«ш»</span>, <span>«j»</span>, то во
    множественном числе скорее всего будет окончание <span>«-еви»</span> (это тенденция, а не жесткое правило): <span>клу*ч</span> —
    <span>клу*чеви</span>, <span>бро*j</span> — <span>бро*еви</span> (но <span>па*ж</span> — <span>пажо*ви</span>). Если в корне есть главная
    <span>«е»</span>, тогда скорее будет окончание <span>«-ови»</span>: <span>е*ж</span> — <span>е*жови</span>, <span>ке*j</span> — <span>ке*jови</span>.

    Если односложное существительное оканчивается на иные согласные, то во множественном числе, скорее всего, будет окончание
    <span>«-ови»</span> <span>гра*д</span> — <span>гра*дови</span>. Сюда же примыкают существительные <span>о*ган</span>, <span>ве*тар</span>
    (с беглой гласной <span>«а»</span>): <span>о*ган</span> — <span>о*гнови</span>, <span>ве*тар</span> — <span>ве*трови</span>.

    У неготорых односложных существительных возможны оба окончания: <span>но*ж</span> — <span>но*жеви/ но*жови</span>, <span>ку*рс</span> —
    <span>ку*рсеви/ ку*рсови</span>.

    Существительные мужского рода на <span>«-о»</span>, <span>«-е»</span> во множественном числе соответственно имеют окончания
    <span>«-овци»</span>, <span>«-евци»</span>: <span>та*тко</span> — <span>та*тковци</span>, <span>ву*jче</span> — <span>ву*jчевци</span>.
    К ним примыкают существительные <span>све*кор</span> — <span>све*кровци</span>, <span>те*тин</span> — <span>тети*новци</span>,
    <span>шу*ра</span> — <span>шу*ревци</span>. Исключение: <span>аташе*</span> — <span>аташе*и</span>.

    Некоторые мужские имена и фамилии на <span>«-ов»</span>, <span>«-ев»</span> имеют окончания <span>«-овци»</span>, <span>«-ецви»</span>,
    возможны также дублеты <span>«-и»</span>: <span>И*ван</span> — <span>Ива*новци</span>, <span>Дра*ган</span> —
    <span>Драга*новци/ Дра*гани</span>, <span>Го*це</span> — <span>Го*цевци</span>, <span>И*ванов</span> — <span>Ива*новци/ Ива*нови</span>,
    <span>То*шев</span> — <span>То*шевци/ То*шеви</span>.
    
    Некоторые односложные существительные во множественном числе имеют окончание <span>«-и»</span>, при этом в словах на <span>«к»</span>,
    <span>«г»</span>, <span>«х»</span> происходят чередования <span>к/ц</span>, <span>г/з</span>, <span>х/с</span>: <span>за*б</span> —
    <span>за*би</span>, <span>во*лк</span> — <span>во*лци</span>, <span>Че*х</span> — <span>Че*си</span>. Часть из таких существительных имеет
    дублетные формы: <span>де*н</span> — <span>дни*/ де*нови</span>, <span>зву*к</span> — <span>зву*ци/ зву*кови</span>.

    Существительные мужского рода на <span>«-а»</span> во множественном числе имеют окончание <span>«-и»</span>, при этом чередования нет:
    <span>слу*га</span> — <span>слу*ги</span>, <span>су*диjа</span> — <span>су*дии</span>. Исключение: <span>вла*дика</span> — <span>вла*дици</span>.

    Подавляющее большинство неодносложных существительных мужского рода во множественном числе имеют окончание <span>«-и»</span>,
    при этом в словах на <span>«к»</span>, <span>«г»</span>, <span>«х»</span> происходят чередования <span>«к/ц»</span>, <span>«г/з»</span>,
    <span>«х/с»</span>: <span>па*сош</span> — <span>па*соши</span>, <span>па*тник</span> — <span>па*тници</span>, <span>у*спех</span> —
    <span>у*спеси</span>, <span>со*пруг</span> - <span>со*прузи</span>. Встречаются слова с беглыми гласными <span>«е»</span>,
    <span>«а»</span>, <span>«о»</span>, которые выпадают во множественном числе: <span>ми*нистер</span> — <span>ми*нистри</span>,
    <span>ме*тар</span> — <span>ме*три</span>, <span>а*гол</span> — <span>а*гли</span>. У слов с суффиксом <span>«-ок»</span> чередование
    непоследовательное: <span>по*томок</span> — <span>по*томци</span>, <span>по*дарок</span> — <span>пода*роци</span>. Суффикс <span>«-ин»</span>
    выпадает: <span>го*стин</span> — <span>го*сти</span>. У слов с суффиксом <span>«-ец»</span> два варианта: <span>Маке*донец</span> —
    <span>Маке*донци</span>, <span>Англи*чанец</span> — <span>Англи*чани</span> (первый вариант более частый).

    Заимствования мужсокого рода на <span>«-и»</span> имеют окончание <span>«-jа»</span>: <span>де*нди</span> — <span>де*ндиjа</span>.

    Существительные супплетивной формы множественного числа: <span>чо*век</span> — <span>лю*г*е</span>.

    Некоторые существительные имеют не регулярные чередования и окончания, их необходимо запомнить:  <span>бра*т</span> — <span>бра*к*а</span>,
    <span>го*сподин</span> — <span>го*пода</span>, <span>со*н</span> — <span>со*ништа/сни*шта</span>, <span>па*т</span> «дорога» —
    <span>па*тишта</span>, <span>па*т</span> «раз» — <span>па*ти</span>, <span>ка*мен</span> — <span>ка*мење</span>, <span>Ту*рчин</span> —
    <span>Ту*рци</span> и некоторые другие.
    `,
  },
};
