import { FillInExerciseData } from "@/types/exerciseTypes";

export const exercise3: FillInExerciseData = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте форму множественного числа от следующих словосочетаний мужского рода.`,
      ],
      content: {
        sentences: [
          {
            mkd: `<span>наш авио\u0301н ___, то\u0301j А\u0301лбанец ___, до\u0301бар броj ___, ни\u0301вен град ___, 
            ни\u0301зок де\u0301чко ___, ва\u0301ш и\u0301злез ___, си\u0301от кат ___, де\u0301сетти твоj ключ ___,
            не\u0301jзин ку\u0301фер ___, за\u0301морен лет ___, у\u0301морен Маке\u0301донец ___, чиj по\u0301jадок ___,
            четирина\u0301есетти По\u0301лjак ___, сто\u0301ти пу\u0301шач ___, ни\u0301вен ред ___, ка\u0301ков Ру\u0301син ___,
            коj Ср\u0301бин ___, ваш слу\u0301жбеник ___, прв со\u0301пруг ___, нов хо\u0301тел ___, моj це\u0301нтар ___,
            до\u0301бар чаj ___, си\u0301от час ___.`,
            answer: [
              `наши авиони`,
              `тие Албанци`,
              `добни броеви`,
              `нивни градови`,
              `ниски дечковци`,
              `ваши излези`,
              `сите катови`,
              `десетти твои клучеви`,
              `неjзини куфери`,
              `заморни летови`,
              `уморни Македонци`,
              `чие поjадоци`,
              `четиринаесетти Полjаци`,
              `стоти пушачи`,
              `нивни редови`,
              `какви Руси`,
              `кои Срби`,
              `ваши службеници`,
              `први сопрузи`,
              `нови хотели`,
              `мои центри`,
              `добри чаеви`,
              `сите часови`,
            ],
          },
        ],
      },
    },
  ],
};
