import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Замените существительные мужского рода местоимением <span>тоj</span>, женского — <span>та́а</span>, — среднего <span>то*а</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `аеродро*м ___ , Бла*гоja ___ , вре*ме ___ , де*до ___ , же*на ___ , и*злез ___ , ка*фе ___ , ки*ви ___ , ко*лега ___ ,
            ко*лешка ___ , ко*нтрола ___ , ку*фер ___ , ме*сто ___ , о*дмор ___ , о*ктомври ___ , пату*вање ___ , про*блем ___ , сла*бост ___ ,
            та*кси ___ , ту*ризам ___ , цел ___ `,
            answer: [
              `тоj`,
              `тоj`,
              `тоа`,
              `тоj`,
              `таа`,
              `тоj`,
              `тоа`,
              `тоа`,
              `тоj`,
              `таа`,
              `таа`,
              `тоj`,
              `тоа`,
              `тоj`,
              `тоj`,
              `тоа`,
              `тоj`,
              `таа`,
              `тоа`,
              `тоj`,
              `таа`,
            ],
          },
        ],
      },
    },
  ],
};
