import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте форму множественного числа от следующих словосочетаний среднего рода.`,
      ],
      content: {
        sentences: [
          {
            mkd: `умо*рено де*те ___, е*вро ___, в*аше и*ме ___, до*бро ме*сто ___, 
            за*морне пату*вање ___, мо*е пре*зиме ___, ка*кво пре*зимjе ___, не*jзино та*кси ___.`,
            answer: [
              `уморени деца`,
              `евра`,
              `ваши имења`,
              `добри места`,
              `заморни патувања`,
              `мои презимења`,
              `какви приземjа`,
              `неjзини таксиjа`,
            ],
          },
        ],
      },
    },
  ],
};
