import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-2",
  sections: [
    {
      type: "paragraph-exercise",
      prompt: [
        `Трансформируйте текст, начав его с местоимений <span>jас, ти, ние, вие, тие</span>.`,
      ],
      content: {
        original: `Ѓо*рѓи ве*ќе е во Ско*пjе. Се ка*чува во та*кси и о*ди до "Хо*лидеj Инн".
        Сти*гнува за поло*вина час, Пл*аќа и вле*гува во хо*телот. И*ма резерва*циjа за
        еднокре*ветна со*ба за две но*ќи на него*вото пре*зиме. Пла*ќа во го*тово и се ка*чува
        на ше*сти кат. По*тоа о*ди во ре*сторан и пи*е ка*фе.
        `,
        answer: [
          `Jас веќе сум во Скопjе. Се качувам во такси и одам до "Холидеj Инн". Стигнувам за половина час. Плаќам и влегувам во хотелот.
          Имам резервациjа за еднокреветна соба за две ноќи на моето презиме. Плаќам во готово и се качувам на шести кат. Потоа одам во
          ресторан и пиjам кафе.`,

          `Веќе си во Скопjе. Се качуваш во такси и одиш до "Холидеj Инн". Стигнуваш за половина час. Плаќаш и влегуваш во хотелот.
          Имаш резервациjа за еднокреветна соба за две ноќи на твоето презиме. Плаќаш во готово и се качуваш на шести кат. Потоа одиш во
          ресторан и пиеш кафе.`,

          `Веќе сме во Скопjе. Се качуваме во такси и одиме до "Холидеj Инн". Стигнуваме за половина час. Плаќаме и влегуваме во хотелот.
          Имаме резервациjа за еднокреветна соба за две ноќи на нашето презиме. Плаќаме во готово и се качуваме на шести кат. Потоа одиме во
          ресторан и пиеме кафе.`,

          `Веќе сте во Скопjе. Се качувате во такси и одите до "Холидеj Инн". Стигнувате за половина час. Плаќате и влегувате во хотелот.
          Имате резервациjа за еднокреветна соба за две ноќи на вашето презиме. Плаќате во готово и се качувате на шести кат. Потоа одите во
          ресторан и пиете кафе.`,

          `Веќе се во Скопjе. Се качуваат во такси и одат до "Холидеj Инн". Стигнуваат за половина час. Плаќаат и влегуваат во хотелот.
          Имаат резервациjа за еднокреветна соба за две ноќи на нивното презиме. Плаќаат во готово и се качуваат на шести кат. Потоа одат во
          ресторан и пиjат кафе.`,
        ],
      },
    },
  ],
};
