import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-2",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [
        `Переведите на македонский язык, числительные запишите словами.`,
      ],
      content: {
        original: `один его ресторан, одна её родственница, два паспортных контроля, двое мужчин, две женщины, двое их детей, два наших такси,
        два этажа, два ресторана, 5 имён, 9 ночей, 13 часов, 27 тысяч, 31 мой родственник, 48 македонцев, 54 македонки, 65 чемоданов, 76 новых
        фамилий, 18 городов, 82 места, 90 венгров, 253 американца, 312 минут, 489 мест, 746 англичан. `,
        answer: [
          `Еден негов ресторан, една неjзина роднина, две пасошки контроли, дваjца мажи, две жени, две нивни деца, две наши таксиjа, два ката,
          два ресторана/ресторани, пет имиња, девет ноќи, тринаесет часа, дваесет и седум илjади. триесет и еден моj роднина, четириесет и
          осум/осуммина Македонци, педесет и четири Македонки, шеесет и пет куфери, седумдесет и шест нови презимиња, осумнаесет града,
          осумдесет и два места, деведесет/деведесетмина Унгарци, двесте педесет и троjца/три Американци, триста дванаесет минути,
          четиристотини осумдесет и девет места, седумстотини четириесет и шест/шестмина Англичани.`,
        ],
      },
    },
  ],
};
