// import { FillInExerciseData } from "@/types/exerciseTypes";
import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Замените существительные мужского рода местоимением <span>тоj</span>, женского — <span>та́а</span>, — среднего <span>то\u0301а</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `<span>аеродро\u0301м ___ , Бла\u0301гоja ___ , вре\u0301ме ___ , де\u0301до ___ , же\u0301на ___ , и\u0301злез ___ , 
            ка\u0301фе ___ , ки\u0301ви ___ , ко\u0301лега ___ , ко\u0301лешка ___ , ко\u0301нтрола ___ , ку\u0301фер ___ ,
            ме\u0301сто ___ , о\u0301дмор ___ , о\u0301ктомври ___ , пату\u0301вање ___ , про\u0301блем ___ , сла\u0301бост ___ ,
            та\u0301кси ___ , ту\u0301ризам ___ , цел ___ </span>`,
            answer: [
              `тоj`,
              `тоj`,
              `тоа`,
              `тоj`,
              `таа`,
              `тоj`,
              `тоа`,
              `тоа`,
              `тоj`,
              `таа`,
              `таа`,
              `тоj`,
              `тоа`,
              `тоj`,
              `тоj`,
              `тоа`,
              `тоj`,
              `таа`,
              `тоа`,
              `тоj`,
              `таа`,
            ],
          },
        ],
      },
    },
  ],
};
