import { FillInExerciseData } from "@/types/exerciseTypes";

const exercise2: FillInExerciseData = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте форму множественного чиста от следующих словосочетаний с существительными женского рода.`,
      ],
      content: {
        sentences: [
          {
            mkd: `<span>о\u0301ваа же\u0301на ___ , мо\u0301ja ка\u0301ртичка ___ , се\u0301та нок\u0301 ___ , 
            не\u0301гова прия\u0301телка ___ , ва\u0301ша ра\u0301ка ___ , ко\u0301jа симфо\u0301ниjа ___ ,
            чи\u0301jа со\u0301пруга ___ , о\u0301наа службе\u0301ничка ___ , не\u0301jзина цел ___ , прва це\u0301на ___ .`,
            answer: [
              `овие жени`,
              `мои картички`,
              `сите ноќи`,
              `негови приjателки`,
              `ваши раце`,
              `кои симфонии`,
              `чии сопруги`,
              `оние службенички`,
              `ниjзини цели`,
              `први цени`,
            ],
          },
        ],
      },
    },
  ],
};

export default exercise2;
