import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Раскройте скобки.`],
      content: {
        sentences: [
          {
            mkd: `1. ___ (о*воj) чо*век е про*фесор.`,
            answer: [`Овоj`],
          },
          {
            mkd: `2. ___ (о*воj) д*ете не се ви*ка Ни*кола.`,
            answer: [`Ова`],
          },
          {
            mkd: `3. ___ (о*воj) лу*ѓе се од Грци*jа.`,
            answer: [`Овие`],
          },
          {
            mkd: `4. Да*ли ___ (о*воj) ж*ена се пре*зива Нико*ловска?`,
            answer: [`оваа`],
          },
          {
            mkd: `5. ___ (тоj) ка*ртичка е ___ (ни*вен).`,
            answer: [`Таа`, `нивна`],
          },

          {
            mkd: `6. ___ (тоj) ре*сторан е ___ (ни*вен).`,
            answer: [`Тоj`, `нивен`],
          },
          {
            mkd: `7. ___ (тоj) де*ца не се ___ (ни*вен).`,
            answer: [`Тие`, `нивни`],
          },
          {
            mkd: `8. ___ (тоj) ме*сто е ___ (ни*вен).`,
            answer: [`Тоа`, `нивно`],
          },
          {
            mkd: `9. Тоа е ___ (де*сетти) кат.`,
            answer: [`десетти`],
          },
          {
            mkd: `10. Тоа е ___ (де*сетти) ко*нтрола.`,
            answer: [`десетта`],
          },
          {
            mkd: `11. Тоа е ___ (де*сетти) jа*болко.`,
            answer: [`десетто`],
          },
          {
            mkd: `12. Тоа е ___ (де*сетти) панта*лони.`,
            answer: [`десетти`],
          },
        ],
      },
    },
  ],
};
