import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте форму множественного чиста от следующих словосочетаний с существительными женского рода.`,
      ],
      content: {
        sentences: [
          {
            mkd: `о*ваа же*на ___ , мо*ja ка*ртичка ___ , се*та нок* ___ , 
            не*гова прия*телка ___ , ва*ша ра*ка ___ , ко*jа симфо*ниjа ___ ,
            чи*jа со*пруга ___ , о*наа службе*ничка ___ , не*jзина цел ___ , прва це*на ___ .`,
            answer: [
              `овие жени`,
              `мои картички`,
              `сите ноќи`,
              `негови приjателки`,
              `ваши раце`,
              `кои симфонии`,
              `чии сопруги`,
              `оние службенички`,
              `ниjзини цели`,
              `први цени`,
            ],
          },
        ],
      },
    },
  ],
};
