import { FillInExerciseData } from "@/types/exerciseTypes";

const exercise5: FillInExerciseData = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Раскройте скобки.`],
      content: {
        sentences: [
          {
            mkd: `1. ___ (о\u0301воj) чо\u0301век е про\u0301фесор.`,
            answer: [`Овоj`],
          },
          {
            mkd: `2. ___ (о\u0301воj) д\u0301ете не се ви\u0301ка Ни\u0301кола.`,
            answer: [`Ова`],
          },
          {
            mkd: `3. ___ (о\u0301воj) лу\u0301ѓе се од Грци\u0301jа.`,
            answer: [`Овие`],
          },
          {
            mkd: `4. Да\u0301ли ___ (о\u0301воj) ж\u0301ена се пре\u0301зива Нико\u0301ловска?`,
            answer: [`оваа`],
          },
          {
            mkd: `5. ___ (тоj) ка\u0301ртичка е ___ (ни\u0301вен).`,
            answer: [`таа`, `нивна`],
          },

          {
            mkd: `6. ___ (тоj) ре\u0301сторан е ___ (ни\u0301вен).`,
            answer: [`Тоj`, `нивен`],
          },
          {
            mkd: `7. ___ (тоj) де\u0301ца не се ___ (ни\u0301вен).`,
            answer: [`Тие`, `нивни`],
          },
          {
            mkd: `8. ___ (тоj) ме\u0301сто е ___ (ни\u0301вен).`,
            answer: [`тоа`, `нивно`],
          },
          {
            mkd: `9. Тоа е ___ (де\u0301сетти) кат.`,
            answer: [`десетти`],
          },
          {
            mkd: `10. Тоа е ___ (де\u0301сетти) ко\u0301нтрола.`,
            answer: [`десетта`],
          },
          {
            mkd: `11. Тоа е ___ (де\u0301сетти) jа\u0301болко.`,
            answer: [`десетто`],
          },
          {
            mkd: `12. Тоа е ___ (де\u0301сетти) панта\u0301лони.`,
            answer: [`десетти`],
          },
        ],
      },
    },
  ],
};

export default exercise5;
