import { ParagraphExerciseProps } from "@/types/exerciseParagraphTypes";

const exercise7: ParagraphExerciseProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-2",
  sections: [
    {
      type: "paragraph-exercise",
      prompt: [
        `Трансформируйте текст, начав его с местоимений <span>jас, ти, ние, вие, тие</span>.`,
      ],
      content: {
        original: `<span>Ѓо\u0301рѓи ве\u0301ќе е во Ско\u0301пjе. Се ка\u0301чува во та\u0301кси и о\u0301ди до "Хо\u0301лидеj Инн".
        Сти\u0301гнува за поло\u0301вина час, Пл\u0301аќа и вле\u0301гува во хо\u0301телот. И\u0301ма резерва\u0301циjа за
        еднокре\u0301ветна со\u0301ба за две но\u0301ќи на него\u0301вото пре\u0301зиме. Пла\u0301ќа во го\u0301тово и се ка\u0301чува
        на ше\u0301сти кат. По\u0301тоа о\u0301ди во ре\u0301сторан и пи\u0301е ка\u0301фе.</span>
        `,
        answer: [
          `Jас веќе сум во Скопjе. Се качувам во такси и одам до "Холидеj Инн". Стигнувам за половина час. Плаќам и влегувам во хотелот.
          Имам резервациjа за еднокреветна соба за две ноќи на моето презиме. Плаќам во готово и се качувам на шести кат. Потоа одам во
          ресторан и пиjам кафе.`,

          `Веќе си во Скопjе. Се качуваш во такси и одиш до "Холидеj Инн". Стигнуваш за половина час. Плаќаш и влегуваш во хотелот.
          Имаш резервациjа за еднокреветна соба за две ноќи на твоето презиме. Плаќаш во готово и се качуваш на шести кат. Потоа одиш во
          ресторан и пиеш кафе.`,

          `Веќе сме во Скопjе. Се качуваме во такси и одиме до "Холидеj Инн". Стигнуваме за половина час. Плаќаме и влегуваме во хотелот.
          Имаме резервациjа за еднокреветна соба за две ноќи на нашето презиме. Плаќаме во готово и се качуваме на шести кат. Потоа одиме во
          ресторан и пиеме кафе.`,

          `Веќе сте во Скопjе. Се качувате во такси и одите до "Холидеj Инн". Стигнувате за половина час. Плаќате и влегувате во хотелот.
          Имате резервациjа за еднокреветна соба за две ноќи на вашето презиме. Плаќате во готово и се качувате на шести кат. Потоа одите во
          ресторан и пиете кафе.`,

          `Веќе се во Скопjе. Се качуваат во такси и одат до "Холидеj Инн". Стигнуваат за половина час. Плаќаат и влегуваат во хотелот.
          Имаат резервациjа за еднокреветна соба за две ноќи на нивното презиме. Плаќаат во готово и се качуваат на шести кат. Потоа одат во
          ресторан и пиjат кафе.`,
        ],
      },
    },
  ],
};

export default exercise7;
