import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-2",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте форму множественного числа от следующих словосочетаний мужского рода.`,
      ],
      content: {
        sentences: [
          {
            mkd: `наш авио*н ___, то*j А*лбанец ___, до*бар броj ___, ни*вен град ___, 
            ни*зок де*чко ___, ва*ш и*злез ___, си*от кат ___, де*сетти твоj ключ ___,
            не*jзин ку*фер ___, за*морен лет ___, у*морен Маке*донец ___, чиj по*jадок ___,
            четирина*есетти По*лjак ___, сто*ти пу*шач ___, ни*вен ред ___, ка*ков Ру*син ___,
            коj Ср*бин ___, ваш слу*жбеник ___, прв со*пруг ___, нов хо*тел ___, моj це*нтар ___,
            до*бар чаj ___, си*от час ___.`,
            answer: [
              `наши авиони`,
              `тие Албанци`,
              `добни броеви`,
              `нивни градови`,
              `ниски дечковци`,
              `ваши излези`,
              `сите катови`,
              `десетти твои клучеви`,
              `неjзини куфери`,
              `заморни летови`,
              `уморни Македонци`,
              `чие поjадоци`,
              `четиринаесетти Полjаци`,
              `стоти пушачи`,
              `нивни редови`,
              `какви Руси`,
              `кои Срби`,
              `ваши службеници`,
              `први сопрузи`,
              `нови хотели`,
              `мои центри`,
              `добри чаеви`,
              `сите часови`,
            ],
          },
        ],
      },
    },
  ],
};
