import { TablesProps } from "@/types";

export const definitenessCategoryTable: TablesProps = {
  slug: "lesson-4",
  type: "definiteness-category-table",
  content: {
    rows: [
      {
        suffix: "-ов, -от, -он",
        note: "м.р. на согласный",
        examples: ["ка*тов, ка*тот, ка*тон"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ж.р., м.р., мн.ч. на <span>«a»</span>",
        examples: ["же*на, же*нава, же*ната, же*нана"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "",
        examples: ["слу*га, слу*гава, слу*гата, слу*гана"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "",
        examples: ["се*ла, се*лава, се*лата, се*лана"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ограниченно ж.р. на <span>«т»</span>",
        examples: [
          "вест, ве*ста; ра*дост, ра*доста; искл.: смр*т, смр*та",
        ],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ограниченно ж.р. на другие согласные",
        examples: ["но*ќ, но*ќва, но*ќта"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ограниченно ж.р. на другие согласные",
        examples: ["цел, це*лта"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["се*ло, се*лово, се*лото, се*лоно"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["та*кси, та*ксиво, та*ксито, та*ксино"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["де*до, де*дово, де*дото, де*доно"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["де*нди, де*ндиво, де*ндито, де*нтино"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["лу*ге, лу*гево, лу*гето, лу*гено"],
      },
      {
        suffix: "-ве, -те, -не",
        note: "мн.ч. на <span>«и»</span> + <span>ра*це</span>, <span>но*зе</span>",
        examples: ["кни*ги, кни*гиве, кни*гите, кни*гине"],
      },
      {
        suffix: "-ве, -те, -не",
        note: "мн.ч. на <span>«и»</span> + <span>ра*це</span>, <span>но*зе</span>",
        examples: ["ра*це, ра*цеве, ра*цете, ра*цене"],
      },
    ],
  },
};
