import { TablesProps } from "@/types";

export const definitenessCategoryTable: TablesProps = {
  slug: "lesson-4",
  type: "definiteness-category-table",
  content: {
    rows: [
      {
        suffix: "-ов, -от, -он",
        note: "м.р. на согласный",
        examples: ["ка\u0301тов, ка\u0301тот, ка\u0301тон"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ж.р., м.р., мн.ч. на <span>«a»</span>",
        examples: ["же\u0301на, же\u0301нава, же\u0301ната, же\u0301нана"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "",
        examples: ["слу\u0301га, слу\u0301гава, слу\u0301гата, слу\u0301гана"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "",
        examples: ["се\u0301ла, се\u0301лава, се\u0301лата, се\u0301лана"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ограниченно ж.р. на <span>«т»</span>",
        examples: [
          "вест, ве\u0301ста; ра\u0301дост, ра\u0301доста; искл.: смр\u0301т, смр\u0301та",
        ],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ограниченно ж.р. на другие согласные",
        examples: ["но\u0301ќ, но\u0301ќва, но\u0301ќта"],
      },
      {
        suffix: "-ва, -та, -на",
        note: "ограниченно ж.р. на другие согласные",
        examples: ["цел, це\u0301лта"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["се\u0301ло, се\u0301лово, се\u0301лото, се\u0301лоно"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["та\u0301кси, та\u0301ксиво, та\u0301ксито, та\u0301ксино"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["де\u0301до, де\u0301дово, де\u0301дото, де\u0301доно"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["де\u0301нди, де\u0301ндиво, де\u0301ндито, де\u0301нтино"],
      },
      {
        suffix: "-во, -то, -но",
        note: "с.р., м.р. на <span>«о/и»</span>; мн.ч. на <span>«е»</span>",
        examples: ["лу\u0301ге, лу\u0301гево, лу\u0301гето, лу\u0301гено"],
      },
      {
        suffix: "-ве, -те, -не",
        note: "мн.ч. на <span>«и»</span> + <span>ра\u0301це</span>, <span>но\u0301зе</span>",
        examples: ["кни\u0301ги, кни\u0301гиве, кни\u0301гите, кни\u0301гине"],
      },
      {
        suffix: "-ве, -те, -не",
        note: "мн.ч. на <span>«и»</span> + <span>ра\u0301це</span>, <span>но\u0301зе</span>",
        examples: ["ра\u0301це, ра\u0301цеве, ра\u0301цете, ра\u0301цене"],
      },
    ],
  },
};
