import { TablesProps } from "@/types";

export const example7: TablesProps = {
  slug: "lesson-4",
  type: "example-7",
  content: {
    text: `Для обозначения наличия чего-либо или остутствия используются глаголы <span>и\u0301ма</span>, <span>и\u0301ма</span> в форме 3-го
    лица единственного числа:
    `,
    words: [
      {
        mkd: `Во Маке\u0301дониjа и\u0301ма пла\u0301нини, е\u0301зера и шу\u0301ми.`,
        ru: `В Македонии есть горы, озёра и леса.`,
      },
      {
        mkd: `Ту\u0301ка ќе не\u0301ма ни\u0301што.`,
        ru: `Тут ничего нет.`,
      },
    ],
  },
};
