import { TablesProps } from "@/types";

export const example4: TablesProps = {
  slug: "lesson-4",
  type: "example-4",
  content: {
    text: `Намного чаще употребляется конструкция <span>не*ма да</span> + глагол в форме настоящего времени:
    `,
    words: [
      {
        mkd: `Не*ма да му се jаву*ваме.`,
        ru: `Мы не будем ему звонить.`,
      },
      {
        mkd: `Не*ма да му се jа*виме.`,
        ru: `Мы ему не позвоним.`,
      },
      {
        mkd: `У*тре не*ма да би*деме во О*хрид.`,
        ru: `Завтра мы будем не в Охриде.`,
      },
    ],
  },
};
