import { TablesProps } from "@/types";

export const example5: TablesProps = {
  slug: "lesson-4",
  type: "example-5",
  content: {
    text: `От глагола <span>не*ма</span> две формы будущего времени <span>ќе не*ма/не*ма да и*ма</span>: 
    <span>не*маат па*ри</span> «у них нет денег» — <span>ќе не*маат па*ри/не*ма да и*маат па*ри</span> «у них не будет денег».

    После условных союзов <span>а*ко</span> «если» и <span>до*колку</span> «в случае если», частица <span>ќе</span> не употребляется: 
    `,
    words: [
      {
        mkd: `А*ко мно*гу чи*таш мно*гу зна*еш.`,
        ru: `Если моного читаеш, много знаешь.`,
      },
      {
        mkd: `А*ко мно*гу чи*таш мно*гу ќе зна*еш.`,
        ru: `Если много читаеш/будешь много читать, много будешь знать.`,
      },
      {
        mkd: `А*ко мно*го про*читаш мно*гу ќе до*знаеш.`,
        ru: `Если много прочитаешь, много узнаешь.`,
      },
      {
        mkd: `А*ко А*це е во Ско*пjе, ќе ти по*могне.`,
        ru: `Если Аце в Скопьео, он тебе поможет.`,
      },
      {
        mkd: `А*ко А*це би*де во Ско*пjе, ќе ти по*могне.`,
        ru: `Если Аце будет в Скопье, он тебе поможет.`,
      },
    ],
  },
};
