import { TablesProps } from "@/types";

export const example5: TablesProps = {
  slug: "lesson-4",
  type: "example-5",
  content: {
    text: `От глагола <span>не\u0301ма</span> две формы будущего времени <span>ќе не\u0301ма/не\u0301ма да и\u0301ма</span>: 
    <span>не\u0301маат па\u0301ри</span> «у них нет денег» — <span>ќе не\u0301маат па\u0301ри/не\u0301ма да и\u0301маат па\u0301ри</span> «у них не будет денег».

    После условных союзов <span>а\u0301ко</span> «если» и <span>до\u0301колку</span> «в случае если», частица <span>ќе</span> не употребляется: 
    `,
    words: [
      {
        mkd: `А\u0301ко мно\u0301гу чи\u0301таш мно\u0301гу зна\u0301еш.`,
        ru: `Если моного читаеш, много знаешь.`,
      },
      {
        mkd: `А\u0301ко мно\u0301гу чи\u0301таш мно\u0301гу ќе зна\u0301еш.`,
        ru: `Если много читаеш/будешь много читать, много будешь знать.`,
      },
      {
        mkd: `А\u0301ко мно\u0301го про\u0301читаш мно\u0301гу ќе до\u0301знаеш.`,
        ru: `Если много прочитаешь, много узнаешь.`,
      },
      {
        mkd: `А\u0301ко А\u0301це е во Ско\u0301пjе, ќе ти по\u0301могне.`,
        ru: `Если Аце в Скопьео, он тебе поможет.`,
      },
      {
        mkd: `А\u0301ко А\u0301це би\u0301де во Ско\u0301пjе, ќе ти по\u0301могне.`,
        ru: `Если Аце будет в Скопье, он тебе поможет.`,
      },
    ],
  },
};
