import { TablesProps } from "@/types";

export const example4: TablesProps = {
  slug: "lesson-4",
  type: "example-4",
  content: {
    text: `Намного чаще употребляется конструкция <span>не\u0301ма да</span> + глагол в форме настоящего времени:
    `,
    words: [
      {
        mkd: `Не\u0301ма да му се jаву\u0301ваме.`,
        ru: `Мы не будем ему звонить.`,
      },
      {
        mkd: `Не\u0301ма да му се jа\u0301виме.`,
        ru: `Мы ему не позвоним.`,
      },
      {
        mkd: `У\u0301тре не\u0301ма да би\u0301деме во О\u0301хрид.`,
        ru: `Завтра мы будем не в Охриде.`,
      },
    ],
  },
};
