import { TablesProps } from "@/types";

export const aSubtype1: TablesProps = {
  type: `a-subtype-1`,
  slug: "lesson-10",
  subtitle: `1. А-подтип`,
  text: `В глаголах, оканчивающихся на <span>-ее</span>, <span>-не</span>, <span>-пе</span>, <span>-бе</span>, <span>-ме</span>,
  <span>-ве</span>, <span>-ше</span>, и в некоторых глаголах на <span>-же</span>, <span>-зе</span>, <span>-ае</span> происходит
  чередование гласной <span>е</span> на <span>а</span>. В сочетании любых трёх гласных или двух гласных <span>а</span> возникает
  <span>j</span>: <span>доживе*а«j»-а</span>, <span>за*ла«j»а-в</span>.`,
  content: {
    subtitle: [" ", "дожи*вее", "ста*не", "ра*сипе", "и*згребе", "за*дреме"],
    rows: [
      {
        person: "јас",
        forms: [
          "дожи*веа-в",
          "ста*на-в",
          "ра*сипа-в",
          "и*згреба-в",
          "за*дрема-в",
        ],
      },
      {
        person: "ти",
        forms: ["дожи*веа", "ста*на", "ра*сипа", "и*згреба", "за*дрема"],
      },
      {
        person: "тој, та*а, то*а",
        forms: ["дожи*веа", "ста*на", "ра*сипа", "и*згреба", "за*дрема"],
      },
      {
        person: "ни*е",
        forms: [
          "доживе*а-вме",
          "ста*на-вме",
          "раси*па-вме",
          "изгре*ба-вме",
          "задре*ма-вме",
        ],
      },
      {
        person: "ви*е",
        forms: [
          "доживе*а-вте",
          "ста*на-вте",
          "раси*па-вте",
          "изгре*ба-вте",
          "задре*ма-вте",
        ],
      },
      {
        person: "ти*е",
        forms: [
          "доживе*а«j»-а",
          "ста*на-а",
          "раси*па-а",
          "изгре*ба-а",
          "задре*ма-а",
        ],
      },
    ],
  },
};
