import { TablesProps } from "@/types";

export const aSubtype2: TablesProps = {
  type: `a-subtype-2`,
  slug: "lesson-10",
  content: {
    subtitle: [" ", "ско*ве", "на*пише", "ка*же", "за*врзе", "за*лае"],
    rows: [
      {
        person: "јас",
        forms: ["ско*ва-в", "на*пиша-в", "ка*жа-в", "за*врза-в", "за*ла«j»а-в"],
      },
      {
        person: "ти",
        forms: ["ско*ва", "на*пиша", "ка*жа", "за*врза", "за*ла«j»а"],
      },
      {
        person: "тој, та*а, то*а",
        forms: ["ско*ва", "на*пиша", "ка*жа", "за*врза", "за*ла«j»а"],
      },
      {
        person: "ни*е",
        forms: [
          "ско*ва-вме",
          "напи*ша-вме",
          "ка*жа-вме",
          "завр*за-вме",
          "зала*«j»а-вме",
        ],
      },
      {
        person: "ви*е",
        forms: [
          "ско*ва-вте",
          "напи*ша-вте",
          "ка*жа-вте",
          "завр*за-вте",
          "зала*«j»а-вте",
        ],
      },
      {
        person: "ти*е",
        forms: ["ско*ва-а", "напи*ша-а", "ка*жа-а", "завр*за-а", "зала*«j»а-а"],
      },
    ],
  },
};
