import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-16",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "анса*мбл",
            pron: "анса*мбо",
            ru: "ансамбль",
          },
          {
            mkd: "бенд",
            pron: "бэнд",
            ru: "музыкальная группа",
          },
          {
            mkd: "ве*ти",
            pron: "вэ*ти",
            ru: "пообещать",
          },
          {
            mkd: "ве*тува",
            pron: "вэ*тува",
            ru: "обещать",
          },
          {
            mkd: "виоли*на",
            pron: "виоли*на",
            ru: "скрипка",
          },
          {
            mkd: "га*јда",
            pron: "га*йда",
            ru: "волынка",
          },
          {
            mkd: "де*ло",
            pron: "дэ*ло",
            ru: "произведение",
          },
          {
            mkd: "дожи*вее",
            pron: "дожи*вээ",
            ru: "пережить, испытать",
          },
          {
            mkd: "дожи*вува",
            pron: "дожи*вува",
            ru: "переживать, испытывать",
          },
          {
            mkd: "жив",
            pron: "жиф",
            ru: "живой",
          },
          {
            mkd: "за*сака",
            pron: "за*сака",
            ru: "полюбить",
          },
          {
            mkd: "зу*рла",
            pron: "зу*рла",
            ru: "зурна",
          },
          {
            mkd: "и*гра",
            pron: "и*гра",
            ru: "игра, танец",
          },
          {
            mkd: "и*зведе",
            pron: "и*звэдэ",
            ru: "исполнить",
          },
          {
            mkd: "изве*дува",
            pron: "извэ*дува",
            ru: "исполнять",
          },
          {
            mkd: "изво*рен",
            pron: "изво*рэн",
            ru: "аутентичный, оригинальный",
          },
          {
            mkd: "ка*вал",
            pron: "ка*вал",
            ru: "кавал",
          },
          {
            mkd: "кла*сичен",
            pron: "кла*сичэн",
            ru: "классический",
          },
          {
            mkd: "ко*нцерт",
            pron: "ко*нцэрт",
            ru: "концерт",
          },
          {
            mkd: "му*зика",
            pron: "му*зика",
            ru: "музыка",
          },
          {
            mkd: "му*зичар",
            pron: "му*зичар",
            ru: "музыкант",
          },
          {
            mkd: "му*зички",
            pron: "му*зички",
            ru: "музыкальный",
          },
          {
            mkd: "на*роден",
            pron: "на*родэн",
            ru: "народный",
          },
          {
            mkd: "на*стап",
            pron: "на*стап",
            ru: "выступление",
          },
          {
            mkd: "на*стапи",
            pron: "на*стапи",
            ru: "выступить",
          },
          {
            mkd: "наста*пува",
            pron: "наста*пува",
            ru: "выступать",
          },
          {
            mkd: "но*сија",
            pron: "но*сийа",
            ru: "одежда, народный костюм",
          },
          {
            mkd: "о*бичен",
            pron: "о*бичэн",
            ru: "обычный",
          },
          {
            mkd: "организа*тор",
            pron: "организа*тор",
            ru: "организатор",
          },
          {
            mkd: "па*тем",
            pron: "па*тэм",
            ru: "по пути, кстати",
          },
          {
            mkd: "па*тем ре*чено",
            pron: "па*тэм рэ*чэно",
            ru: "кстати (говоря)",
          },
          {
            mkd: "пе*јач/ка",
            pron: "пэ*яч/ка",
            ru: "певец/певица",
          },
          {
            mkd: "пијани*ст/ка",
            pron: "пияни*ст/ка",
            ru: "пианист/ка",
          },
          {
            mkd: "по*днесе",
            pron: "по*днэсэ",
            ru: "вынести",
          },
          {
            mkd: "подне*сува",
            pron: "поднэ*сува",
            ru: "выносить",
          },
          {
            mkd: "по*знат",
            pron: "по*знат",
            ru: "известный",
          },
          {
            mkd: "при*стапен",
            pron: "при*стапэн",
            ru: "доступный",
          },
          {
            mkd: "про*грама",
            pron: "про*грама",
            ru: "программа",
          },
          {
            mkd: "пу*блика",
            pron: "пу*блика",
            ru: "публика",
          },
          {
            mkd: "ра*сказ",
            pron: "ра*скас",
            ru: "рассказ",
          },
          {
            mkd: "ра*мка",
            pron: "ра*мка",
            ru: "рамка",
          },
          {
            mkd: "ред",
            pron: "рэт",
            ru: "ряд",
          },
          {
            mkd: "сви*ри",
            pron: "сви*ри",
            ru: "играть (на музыкальном инструменте)",
          },
          {
            mkd: "сви*рка",
            pron: "сви*рка",
            ru: "игра, исполнение",
          },
          {
            mkd: "се*каков",
            pron: "сэ*каков",
            ru: "всяческий",
          },
          {
            mkd: "та*нчар/ка",
            pron: "та*нчэр/ка",
            ru: "танцор/танцовщица",
          },
          {
            mkd: "та*пан",
            pron: "та*пан",
            ru: "барабан",
          },
          {
            mkd: "традициона*лен",
            pron: "традициона*лэн",
            ru: "традиционный",
          },
          {
            mkd: "фестива*л",
            pron: "фэстива*л",
            ru: "фестиваль",
          },
          {
            mkd: "хармо*ника",
            pron: "хармо*ника",
            ru: "аккордеон",
          },
          {
            mkd: "ша*нса",
            pron: "ша*нса",
            ru: "шанс",
          },
        ],
      },
    },
  ],
};
