import { ParagraphSectionsProps } from "@/types";

export const verbType: ParagraphSectionsProps = {
  type: `verb-type`,
  slug: "lesson-1",
  title: `ВИД ГЛАГОЛА`,
  content: {
    text: `Как и в русском языке, в македонском глаголы бывают несовершенного вида, совершенного и двувидовые. Глаголы несовершенного вида
    отвечают на вопрос [что делать?] (<span>чи*та</span> «читать»), глаголы совершенного вида - на вопрос [что сделать?]
    (<span>про*чита</span> «прочитать»), двувидовые - [что (с)делать?] (<span>мини*ра</span> «минировать»).`,
  },
};
