import { ParagraphSectionsProps } from "@/types";

export const definitenessCategory: ParagraphSectionsProps = {
  type: "grammar-definiteness-category",
  slug: "lesson-4",
  title: {
    ru: "ГРАММАТИКА",
    mkd: "ГРАМАТИКА",
  },
  content: {
    intro: {
      subtitle: ["КАТЕГОРИЯ ОПРЕДЕЛЁННОСТИ"],
      text: `В македонском языке у существительных есть категория определённости. То, что объект выделен из ряда других и известен говорящему,
    выражается не только лексически, как в русском языке (<span>та́а книга</span> «эта книга»), но и грамматически — при помощи постпозитивного
    (стоящего в конце слова) артикля: <span>кни*гата</span> «эта книга» (ср. артикль «the» в английском языке).

    В македонском есть три набора артиклей. Форма артикля зависит от рода, числа существительного и его окончания. Артикли с согласным
    <span>«т»</span> являются самыми нейтральными и частотными: <span>ка*тот</span> «этот этаж», <span>кни*гата</span> «эта книга»,
    <span>се*лото</span> «это село», <span>кни*гите</span> «эти книги». Артикли с согласным <span>«в»</span> сигнализируют, что объект
    находится очень близко к говорящему, в том числе и в переносном смысле (по времени, эмоционально), а с согласным <span>«н»</span> — далеко:
    <span>ка*тов</span> «вот этот этаж», <span>кни*гавa</span> «вот эта книга», <span>се*лово</span> «вот это село», <span>кни*гиве</span>
    «вот эти книги», <span>ка*тон</span> «тот этаж», <span>кни*гана</span> «та книга», <span>се*лоно</span> «то село», <span>кни*гине</span>
    «те книги».`,
    },

    text: `У некоторых слов мужского рода при присоединении артикля происходит выпадение беглой гласной:
    <span>о*ган — о*ганот, тури*зам — тури*змот</span>.
    
    Изначально определёнными считаются имена собственные, поэтому обычно они употребляются без артикля. Иногда, однако, для выражения особого
    эмоционального отношения говорящего к объекту используется форма с артиклем: <span>Ско*пје</span> — <span>Ско*пјево</span>
    (наше Скопье, со всеми его минусами и плюсами, которые мы любим и ненавидим). У некоторых имён собственных такая форма является настолько
    частотной, чтоуже, кажется, потеряла такое особое значение: <span>Ба*лкан</span> — <span>Ба*лканот</span>.

    Если перед существительным стоит одно или несколько определений, то артикль будет присоединяться к первому определению: <span>мо*јата
    пр*ва кни*га</span> «эта моя первая книга». К прилагательным и местоимениям прилагательным мужского рода артикли <span>-ов</span>,
    <span>-от</span>, <span>-он</span> присоединяются через соединительную гласную <span>«и»</span>: <span>до*бар</span> —
    <span>до*бриот</span>, <span>ни*вeн</span> — <span>ни*вниот</span>, <span>пр*в</span> — <span>пр*виот</span>, <span>е*ден</span> —
    <span>е*дниот</span>. К прилагательным на <span>«и»</span> артикли присоединяются напрямую: <span>ру*ски</span> — <span>ру*скиот</span>.
    Исключение: <span>мој</span> — <span>мо*јот</span>, <span>твој</span> — <span>тво*јот</span>, <span>свој</span> — <span>својот</span>.
    К прилагательным и местоимениям прилагательным женского рода присоединяют артикли <span>-ва</span>, <span>-та</span>, <span>-на</span>;
    ср.р. — <span>-во</span>, <span>-то</span>, <span>-но</span>; в форме множественного числа <span>-ве</span>, <span>-те</span>,
    <span>-не</span>: <span>мо*јата</span>, <span>мо*ето</span>, <span>мо*ите</span>.

    Местоимения <span>о*вoj</span> «этот», <span>тој</span> «этот», <span>о*ној</span> «тот», <span>си*от</span> «весь» считаются
    определёнными, поэтому к ним артикль не добавляется: <span>та*а пр*ва кни*га</span>.

    Количественные числительные также имеют определённую форму. Если числительное оканчивается на <span>«-а»</span>, присоединяется артикль
    <span>-та</span>; на другие — артикль <span>-те</span>: <span>два*та</span>, <span>два*јцата</span>, <span>две*те</span>,
    <span>три*те</span>, <span>тринае*сетте</span>, <span>сто́те</span>. У составных числительных артикль присоединяется к последнему члену:
    <span>две и*лјади сто и два*та</span>. Если число оканчивается на существительные <span>и*лјада</span> «тысяча», <span>ми*лион</span>
    «миллион», <span>милија*рда</span> «миллиард», артикль присоединяется к последней части числительного:
    <span>две*сте и педе*сетте и*лјади</span>. У числительных на <span>-ми*на</span>: артикль вставляется перед суффиксом:
    <span>петте*мина</span> (форма <span>петми*ната</span> нарушает норму, но встречается в разговорной речи). По аналогии с числительными
    определённую форму могут иметь слова <span>мно*гу</span> «много», <span>ма*лку</span> «мало» и <span>по*веќе</span> «довольно большое
    число»: <span>мно*гуте</span>, <span>ма*лкуте</span> и <span>пове*ќето</span>. Надо отметить, что числительные и примыкающие к ним слова
    довольно редко употребляются в определённой форме, за исключением числительных на 2, 3, 4.

    В македонском языке нет неопределённого артикля (ср. неопределённый артикль «а» в английском языке), однако в его функции часто
    употребляется числительное <span>е*ден</span> в значении «какой-то, некий»: <span>е*дни лу*ѓе</span> «одни/какие-то люди». В одних
    значениях это числительное может стоять в определенной форме: <span>е*дниот е стар, дру*гиот е глуп</span> «один старый, другой глупый».

    Употребление определённой/неопределённой формы существительного зависит не только от того, известен ли объект говорящему, выделен ли он из
    ряда других объектов, но и от синтаксической позиции существительного в предложении. Практически всегда в определённой форме стоит подлежащее
    при прямом порядке слов: <span>учениците читаат книги</span> «ученики читают книги», (но <span>пролет секогаш сле*дува по зи*ма</span>
    «весна всегда следует за зимой»). Существительное в именном сказуемом обычно стоит в неопределённой форме: <span>И*ван е ди*ректор</span>
    «Иван директор». Дополнение после глаголов <span>и*ма</span> и <span>не*ма</span> обычно стоит в неопределённой форме:
    <span>и*мам брат</span> «у меня есть брат», (но <span>jас jа и*мам тво*jата кни*га</span> «твоя книга у меня»). Форма в других позициях
    зависит от контекста.
    `,
  },
};
