import { ParagraphSectionsProps } from "@/types";

export const prepositions: ParagraphSectionsProps = {
  type: "prepositions",
  subtitle: "ПРЕДЛОГИ",
  intro: `В македонском языке зачения, которые в русском языке выражаются падежами, передаются в основном при помощи предлогов:
    <span>це\u0301нтарот на гра\u0301дот</span> «центр города», <span>пода\u0301роци за дру\u0301гари</span> «подарки друзьям/для друзей»,
    <span>пи\u0301шувам со пе\u0301нкало</span> «я пишу ручкой» и т.д. Ниже представлены основные значения основных предлогов:`,
  content: {
    text: `
    
    <span>без</span> без: <span>без ше\u0301кер</span> «без сахара»

    <span>во</span> в: <span>во Мо\u0301сква</span> «в Москве/Москву», <span>во окт\u0301омври</span> «в октябре». У предлога <span>во</span>
    есть также форма <span>в</span>, которая употребляется с неопределёнными формами некоторых существительных, при этом такие сочетания
    синонимичны сочетаниям предлога <span>во</span> с определёнными формами этих существительных: <span>о\u0301дам в ку\u0301јна =
    о\u0301дам во ку\u0301јната</span> «я иду на (эту) кухню». Кроме того, в литературном языке существует правило употребления этих вариантов
    с днями недели: <span>во сре\u0301да</span> «в среду (любую)», <span>во сре\u0301дата</span> «в прошлую среду», <span>в сре\u0301да</span>
    «в следующую среду». Исключение из этого правила — слово «вто́рник»: <span>во вто́рник</span> «во вторник», <span>во вто́рникот</span>
    «в прошлый вторник». Для выражения значения «следующий вторник» используется ликсический способ: <span>на ре\u0301дниот/вто́рник</span>.

    <span>врз:</span> оказание давления, движение сверху вниз на объект и нахождение в результате такого движения:
    <span>пи́шува бу́гарски бу́кви врз ср́пските</span> «пишет болгарские буквы поверх сербских».

    <span>до:</span> 1) до: <span>до Ско\u0301jе</span> «до Скопье», <span>до ју\u0301ли</span> «до июля» 2) нахождение рядом:
    <span>се́ди до ма́сата</span> «сидит у стола».

    <span>за:</span> 1) охват объекта: <span>др́жи за ра́ка</span> «держит за руку» 2) цель движения: <span>о́дам за Ско\u0301jе</span>
    «еду в Скопье» 3) цель действия, предназначение, получатель результата действия: <span>ку́пувам за прија\u0301тели</span>
    «покупаю для друзей» 4) причина: <span>се ка́раат за па\u0301ри</span> «ссорятся из-за денег» 5) объект мысли и речи:
    <span>збо́рувам за А́на</span> «говорю об Анне» 6) временное значение: <span>и́звештај за ма́рт</span> «отчёт за март»,
    <span>ќе за\u0301вр́шиме за е́ден ден</span> «закончим за один день» 7) тождество: <span>ле́б за 40 денар</span> «хлеб за 40 денар».

    <span>зад:</span> нахождение и движение за объект: <span>жи́вее зад ре́ката</span> «живет за рекой».

    <span>за\u0301ради</span> ради: <span>за\u0301ради те\u0301бе</span> «ради тебя».

    <span>кај:</span> 1) движение и нахождение у какого-либо лица: <span>кај А́на сум</span> «я у Анны» 2) нахождение около объекта:
    <span>кај музе́јот сме</span> «мы около музея».

    <span>кон:</span> 1) движение в направлении некоторого объекта: <span>о\u0301ди кон хо́телот</span> «идёт в сторону к гостиницы» 2) объект,
    по отношению к которому производится действие: <span>до́дава кон то\u0301а</span> «добавляет к этому» 3) временное значение:
    <span>кон по́лноќ</span> «к полуночи».

    <span>меѓу</span> между: <span>ме́ѓу нас</span> «между нами».

    <span>на\u0301место</span> вместо: <span>на́место нас</span> «вместо нас».

    <span>на:</span> 1) пространственное значение: <span>о́ди на ре\u0301ка</span> «идёт на реку» 2) временное значение:
    <span>на Ве́лигден</span> «на Пасху» 3) дистанция: <span>се на\u0301оѓа на 17 км</span> «находится в 17 км» 4) посессивные значения:
    <span>со́ба на И́ван</span> «комната Ивана» (но <span>ча\u0301ша во\u0301да</span> «стакан воды») 5) адресат и другие:
    <span>му збо́рувам на И́ван</span> «я говорю Ивану».

    <span>над</span> над: <span>над ме́не</span> «надо мной».

    <span>низ</span> сквозь, по: <span>низ при́змата</span> «сквозь призму», <span>низ гра́дот</span> «по городу».

    <span>од:</span> 1) начальная точка движения/действия, источник получения: <span>од Него\u0301тино</span> «из/от Неготино»,
    <span>од ма́сата</span> «со стола», <span>од И́ван</span> «от Ивана» 2) точка отсчёта: <span>ра́боти од ју\u0301ли</span> «работает с июля»  
    3) харктеристика по материалу, происхождению, времени: <span>ма́са од др́во</span> «стол из дерева», <span>цр́ква од I век</span>
    «церковь I века» 4) основа для сравнения: <span>по́стар од И́ван</span> «старше Ивана» 5) причина: <span>смр́т од глад</span> «смерть от голода»
    6) часть целого: <span>дел од гру\u0301пата</span> «часть группы» 7) субъект в пассивной конструкции: <span>на\u0301пишан од Лу\u0301ка</span>
    «написанный Лукой».

    <span>о\u0301колу</span> 1) вокруг: <span>о́колу ма́сата</span> «вокруг стола» 2) приблизительное количество: <span>о́колу 2 ча́са</span>
    «около 2 часов», <span>о́колу 2 е́вро</span> «около 2 евро».

    <span>о\u0301свен</span> кроме: <span>о\u0301свен те\u0301бе</span> «кроме тебя».

    <span>по:</span> 1) место движения, действия: <span>о́ди по мо́стот</span> «идёт по мосту» 2) дистрибуция: <span>да́ва по 2 ле́ба</span>
    «даёт по 2 хлеба» 3) последовательность: <span>по ју\u0301ли</span> «после июля», <span>по 2 де́на</span> «2 дня спустя» 4) цель движения:
    <span>о́ди по ле́б</span> «идёт за хлебом» 5) соответствие: <span>по на́шите ста\u0301ндарди</span> «по нашим стандартам» 6) причина
    (ограниченно): <span>по грéшка</span> «по ошибке» 7) насколько легко одет человек: <span>о́ди по кра\u0301тки ра\u0301кави</span>
    «ходит в одежде с коротким рукавом».

    <span>под</span> под: <span>се́ди под ма́сата</span> «сидит под столом».

    <span>по\u0301крај:</span> 1) движение вдоль объекта, нахождение около: <span>по\u0301крај па́тот</span> «вдоль дороги» 2) помимо:
    <span>покра\u0301ј то\u0301а</span> «помимо этого» 3) вопреки, несмотря на: <span>по\u0301крај напо́рите</span> «несмотря на усилия».

    <span>по\u0301ради</span> по причине: <span>по́ради бо́лест</span> «по болезни».

    <span>пред:</span> 1) перед: <span>пре́д неа</span> «перед ней» 2) временное значение: <span>пре́д 2 де́на</span> «2 дня назад»,
    <span>2 де́на пред сва́дбата</span> «за 2 дня до свадьбы».

    <span>преку</span> через: <span>пре́ку пат</span> «через дорогу».

    <span>при</span> при: <span>коми́сија при ОН</span> «комиссия при ООН».

    <span>про\u0301тив</span> против: <span>про́тив ме\u0301не</span> «против меня»

    <span>со:</span> 1) совместность: <span>со\u0301 нив</span> «с ними» 2) инструмент: <span>со нож</span> «ножом».

    <span>спо\u0301ред:</span> 1) в соответствии с: <span>спо́ред ста́ндардот</span> «в соответствии со стандартом» 2) источник информации:
    <span>спо́ред И\u0301ванов</span> «по словам/мнению Иванова».

    <span>спре\u0301ма:</span> 1) в направлении, по отношению: <span>спре́ма Ско́пје</span> «в сторону Скопье/ по отношению к Скопье» 2) напротив
    (нечасто): <span>сто́и спре́ма ме\u0301не</span> «стоит напротив меня».

    <span>спро\u0301ти:</span> 1) напротив: <span>спро́ти ба́нката</span> «напротив банка» 2) накануне: <span>спро́ти Бо́жиќ</span>
    «накануне Рождества».

    <span>сред</span> среди, в середине: <span>сред лу́ѓето</span> «среди людей», <span>сред океа́н</span> «среди океана».
    `,
  },
};
