import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-11`,
  sections: [
    {
      type: "lecture",
      subtitle: {
        ru: "ДИАЛОГ",
        mkd: "ДИЈАЛОГ",
      },
      content: {
        description: {
          mkd: `<em>На*таша, И*ван и На*ум пи*jат ка*фе во е*дно ка*фуле со по*глед на езе*рото.</em>`,
          ru: `<em>Наташа, Иван и Наум пьют кофе в кафе с видом на озеро.</em>`,
        },
        dialogue: [
          {
            speaker: {
              id: `ivan`,
              mkd: `И*ван:`,
              ru: `Иван:`,
            },
            mkd: [
              `Ле*то е мо*е наjоми*лено го*дишно вре*ме. Мо*же да о*диш по кра*тки ра*кави, да се со*нчаш и да се ка*пеш. Ле*сно е да
              па*туваш. И и*ма мно*гу со*нце.`,
              `А ка*ко се сла*ви Бо*жиќ во Македо*ниjа?`,
            ],
            ru: [
              `Лето моё любимое время года. Можно ходить в одежде с коротким рукавом, загорать и купаться. Легко путешествовать. И много 
              солнца.`,
              `А как празднуют Рождество в Македонии?`,
            ],
          },
          {
            speaker: {
              id: `naum`,
              mkd: `На*ум:`,
              ru: `Наум:`,
            },
            mkd: [
              `Па ти си Ру*син, каj вас се*когаш е ла*дно. Jас по*веќе са*кам про*лет. Сè по*чнува да зеле*нее и да цу*ти. Мо*же да се*диш 
              на отво*рено, но у*ште не е то*пло. А ти, На*таша?`,
            ],
            ru: [
              `Ну, ты русский, у вас всегда холодно. Я больше люблю весну. Всё начинает заленеть и цвести. Можно сидеть на открытой
              террасе, но ещё не жарко. А ты, Наташа?`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На*таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Jас на*jмногу са*кам зи*ма по*ради зи*мските пра*зници. Пред сè Бо*жиќ. О*воj ден си*те се тру*дат да го по*минат со 
              фамили*jата.`,
              `Бо*жиќ се сла*ви на се*дми jануа*ри, а де*нот пред Бо*жиќ се ви*ка Ба*дник или Ко*леде. Ко*га мо*jот по*стар брат и jас
              бе*вме ма*ли, стану*вавме ра*но на*утро и за*едно со дру*гите де*ца о*девме по ку*ќи и ста*нови, чу*кавме, им го
              чести*тавме Ба*дник на га*здите, пе*евме коле*дарски пе*сни и доби*вавме од во*зрасни о*реви, бонбо*ни и бискви*ти.
              
              По*тоа се вра*ќавме до*ма и си покажу*вавме коj што до*би. Ма*jка ни го*твеше по*сни jа*дења, пе*чеше специjа*лен леб,
              по*гача, и ста*ваше вна*тре па*ричка. На*вечер се соби*равме це*лата фами*лиjа на ма*сата. Та*тко ни го де*леше ле*бот
              и му го да*ваше е*дно па*рче на се*коj, у*ште е*дно му оста*ваше на Го*спод и е*ден — на куќата. Луѓ ето веру*ваат де*ка
              чо*векот ко*jшто jа на*jде во сво*ето па*рче пари*чката, ќе би*де сре*ќен це*лата сле*дна го*дина.
              
              По ве*чера о*девме на*двор, во се*кое ма*ало и*маше о*ган, о*колу ко*jшто се соби*раа лу*ѓето. Лу*ѓето пи*еjа ра*киjа,
              пе*еjа пе*сни и и*граа. Бе*ше мно*гу за*бавно!`,
            ],
            ru: [
              `Я больше всего люблю зиму из-за зимних праздников, предже всего Рождества. Этот день все стараются провести с семьёй.`,
              `День накануне Рождества называеся Бадник, или Коледе. Когда мой старший брат и я были маленькими, мы вставали роно утром
              и вместе с другими детьми ходили по домам и квартирам, стучали, поздравляли хозяев с сочельником, пели колядки и получали
              от взрослых грецкие орехи, конфеты и печенье.
              
              Потом мы возвращались домой и показывали друг другу, кто что получил. Мама готовила пострые блюда, пекла специальный хлеб,
              погачу, и клала в него монетку. Вечером мы собирались всей семьёй за столом. Папа делил хлеб и давал каждому один кусочек,
              ещё один кусок мы оставляли Боку и один — дому. Люди верят, что человек, который нашёл в своём кусочке монетку, будет
              счастливым весь следующий год.
              
              После ужина мы шли на улицу, в каждом районе был костёр, вокруг которого собирались люди. Люди пили ракию, пели песни и
              танцевали. Было очень весело!`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "naum", language: "ru", replyIndex: 0 },
          { speakerId: "naum", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
        ],
      },
    },
  ],
};

//  ѐ
//  ѝ
