import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-8",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          { mkd: "бр*за", pron: "бр*за", ru: "спешить" },
          { mkd: "влез", pron: "влэс", ru: "вход, въезд" },
          { mkd: "е*ве", pron: "э*вэ", ru: "вот" },
          { mkd: "ка*са", pron: "ко*са", ru: "касса" },
          { mkd: "ка*сне", pron: "ко*снэ", ru: "перекусить" },
          { mkd: "ка*снува", pron: "ко*снува", ru: "перекусывать" },
          { mkd: "на*рача", pron: "на*рача", ru: "заказать" },
          { mkd: "нарач*ува", pron: "нара*чува", ru: "заказывать" },
          { mkd: "не*кој", pron: "нэ*кой", ru: "кто-то, кто-либо, некто" },
          { mkd: "не*што", pron: "нэ*што", ru: "что-то, что-либо, нечто" },
          { mkd: "о*зад", pron: "о*зади", ru: "сзади" },
          { mkd: "пата*рина", pron: "пата*рина", ru: "пункт оплаты дороги" },
          { mkd: "па*уза", pron: "па*уза", ru: "пауза, перерыв" },
          { mkd: "пе*рон", pron: "пэ*рон", ru: "перрон" },
          { mkd: "по*брза", pron: "по*брза", ru: "поспешить" },
          {
            mkd: "по*вратен би*лет",
            pron: "по*вратеэн_би*леэт",
            ru: "билет туда-обратно",
          },
          { mkd: "пра*вец", pron: "пра*вэц", ru: "направление" },
          { mkd: "при*јде", pron: "при*йдэ", ru: "подойти" },
          { mkd: "при*јоѓа", pron: "при*йог'а", ru: "подходить" },
          { mkd: "сло*боден", pron: "сло*бодэн", ru: "свободный" },
          {
            mkd: "ста*ва",
            pron: "ста*ва",
            ru: "ставить, класть, устанавливать",
          },
          {
            mkd: "ста*ви",
            pron: "ста*ви",
            ru: "поставить, положить, установить",
          },
          { mkd: "стр*пи", pron: "стр*пи", ru: "потерпеть" },
          { mkd: "тр*гне", pron: "тр*гнэ", ru: "тронуться, отправиться" },
          { mkd: "тр*гнува", pron: "тр*гнува", ru: "тронуться, отправляться" },
          { mkd: "тр*пи", pron: "тр*пи", ru: "терпеть" },
          { mkd: "се чи*ни", pron: "сэ*_чи*ни", ru: "казаться" },
        ],
      },
    },
  ],
};
