import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-3`,
  sections: [
    {
      type: "lecture",
      subtitle: [`ДИАЛОГ`, `<span>ДИЈАЛОГ</span>`],
      content: {
        description: {
          mkd: `<em>На\u0301таша и И\u0301ван ма\u0301лку одмо\u0301раат. По\u0301тоа На\u0301таша се дого\u0301вара во е\u0301дно
          ка\u0301фуле во це\u0301нтарот на гра\u0301дот. И\u0301ван и На\u0301таша се туши\u0301раат, се облеку\u0301ваат и о\u0301дат
          во кафу\u0301лето. Друга\u0301рите на На\u0301таша Зла\u0301тко и Би\u0301лjана ве\u0301ќе се та\u0301му.</em>`,
          ru: `<em>Наташа и Иван немного отдыхают. Потом Наташа договаривается встретиться со своими друзьями в кафе в центре города.
          Иван и Наташа принимают душ, одеваются и идут в кафе. Друзья Наташи Златко и Биляна уже там.</em>`,
        },
        dialogue: [
          {
            speaker: {
              id: `zlatko`,
              mkd: `Зла\u0301тко:`,
              ru: `Златко:`,
            },
            mkd: [
              `Ми\u0301ло ми е.`,
              `Нави\u0301стина? Jас сум по по\u0301текло од О\u0301хрид. Ми\u0301слам де\u0301ка мо\u0301jот град е на\u0301jубав на 
              све\u0301тот.`,
              `А што ра\u0301ботиш во Мо\u0301сква?`,
              `Jас сум еко\u0301номист по образова\u0301ние, и\u0301наку се\u0301га и\u0301мам сво\u0301jа тури\u0301стичка
              аге\u0301нциjа. А Би\u0301лjана е учи\u0301телка по а\u0301нглиски jа\u0301зик во сре\u0301дно учи\u0301лиште.
              А ви\u0301е и\u0301мате ка\u0301де да се сме\u0301стите во О\u0301хрид?`,
              `Дру\u0301гарка ми е професио\u0301нален во\u0301дич, зна\u0301е се за гра\u0301дот.`,
              `Се ви\u0301ка Ле\u0301jла, и\u0301ма три\u0301есет го\u0301дини.`,
              `Ту\u0301рчинка е. Од е\u0301дна ста\u0301ра ту\u0301рска фами\u0301лиjа. Ти\u0301е ни се ко\u0301мшии. Та\u0301тко ми и
              та\u0301тко и\u0301 на Ле\u0301jла се го\u0301леми дру\u0301гари. Се\u0301га ќе и\u0301 се jа\u0301вам и ќе jа
              пр\u0301ашам да\u0301ли и\u0301ма вре\u0301ме.`,
            ],
            ru: [
              `Очень приятно.`,
              `Правда? Я родом из Охрида. Я думаю, что мой город - самый красивый в мире.`,
              `А чем ты занимаешся в Москве?`,
              `Я экономист по образованию, но сейчас у меня своё туристическое агенство. А Биляна - учительница английского языка в средней
              школе. А вам есть где разместиться в Охриде?`,
              `Моя подруга - профессиональный экскурсовод, она знает все в городе.`,
              `Её зовут Лейла, ей тридцать лет.`,
              `Турчанка. Из одной старой турецкой семьи. Они наши соседи. Мой отец и отец Лейлы большие друзья. Сейчас я ей позвоню и
              спрошу, есть ли у неё время.`,
            ],
          },
          {
            speaker: {
              id: `ivan`,
              mkd: `И\u0301ван:`,
              ru: `И\u0301ван:`,
            },
            mkd: [
              `Ми\u0301ло ми е, И\u0301ван.`,
              `На\u0301таша ме у\u0301чи. Збо\u0301рувам, но не знам да пи\u0301шувам. Во Македо\u0301ниjа сум ве\u0301ќе пе\u0301тти пат.
              Мно\u0301гу ми се до\u0301паѓа ту\u0301ка. О\u0301воj пат плани\u0301раме да о\u0301диме во О\u0301хрид`,
              `Не, не, по по\u0301текло сум од Санкт-Пе\u0301тербург, а во Мо\u0301сква жи\u0301веам и ра\u0301ботам ве\u0301ќе 
              де\u0301сет го\u0301дини. Ми\u0301слам де\u0301ка си\u0301те о\u0301вие гра\u0301дови се мно\u0301гу у\u0301бави,
              се\u0301коj на своj на\u0301чин.`,
              `Ра\u0301ботам ка\u0301ко програме\u0301р во е\u0301дна го\u0301лема амери\u0301канска компа\u0301ниjа. А ви\u0301е со што
              се занима\u0301вате?`,
              `О\u0301длично! Фа\u0301ла ти на\u0301jмонгу!`,
            ],
            ru: [
              `Очень приятно, Иван.`,
              `Наташа меня учит. Я говорю, но не умею писать. В Македонии я в пятый раз. Мне здесь очень нравится. В этот раз мы планируем
              поехать в Охрид.`,
              `Нет, нет, я родом из Санкт-Петербурга, а в Москве живу и работаю уже десять лет. Я думаю, что все эти города очень красивые,
              каждый по-своему.`,
              `Я работаю программистом в одной большой американской компании. А вы чем занимаетесь?`,
              `Отлично! Спасибо тебе большое!`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На\u0301таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Здра\u0301во! Са\u0301кам да ве запо\u0301знаам. О\u0301ва е маж ми И\u0301ван. И\u0301ван, о\u0301ва се мо\u0301ите
              дру\u0301гари, Зла\u0301тко и Би\u0301лjана.`,
              `Да, по\u0301веќе ни тре\u0301ба дру\u0301штво. Не\u0301коj коj мо\u0301же да ра\u0301скаже за О\u0301хрид и да не
              про\u0301шета`,
              `Ка\u0301ко се ви\u0301ка? Ко\u0301лку го\u0301дини и\u0301ма?`,
              `Ле\u0301jла? Што е по национа\u0301лност`,
            ],
            ru: [
              `Привет! Я хочу вас познакомить. Это мой муж Иван. Иван. Это мои друзья Златко и Биляна.`,
              `Да, нам больше нужна компания. Кто-нибудь, кто может рассказать об Охриде и прогуляться с нами.`,
              `Как её зовут? Сколько ей лет?`,
              `Лейла? Кто она по национальности?`,
            ],
          },
          {
            speaker: {
              id: `bilyana`,
              mkd: `Би\u0301лjана:`,
              ru: `Биляна:`,
            },
            mkd: [
              `Ми\u0301ло ми е. И\u0301ван, пр\u0301впат си во Македо\u0301ниjа? Мн\u0301огу у\u0301баво збо\u0301руваш маке\u0301донски.`,
              `Зла\u0301тко, И\u0301ван е од Мо\u0301сква, си\u0301гурно ми\u0301сли де\u0301ка Мо\u0301сква е на\u0301jубав град.`,
            ],
            ru: [
              `Очень приятно. Иван, ты впервые в Македонии? Ты очень хорошо говоришь по-македонски.`,
              `Златко, Иван из Москвы, наверняка он думает, что Москва - самый красивый город.`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "zlatko", language: "ru", replyIndex: 0 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 0 },
          { speakerId: "bilyana", language: "ru", replyIndex: 0 },
          { speakerId: "bilyana", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },
          { speakerId: "zlatko", language: "ru", replyIndex: 1 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 1 },
          { speakerId: "bilyana", language: "ru", replyIndex: 1 },
          { speakerId: "bilyana", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "zlatko", language: "ru", replyIndex: 2 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 2 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },

          { speakerId: "zlatko", language: "ru", replyIndex: 3 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "zlatko", language: "ru", replyIndex: 4 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 4 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },
          { speakerId: "zlatko", language: "ru", replyIndex: 5 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 5 },
          { speakerId: "natasha", language: "ru", replyIndex: 3 },
          { speakerId: "natasha", language: "mkd", replyIndex: 3 },
          { speakerId: "zlatko", language: "ru", replyIndex: 6 },
          { speakerId: "zlatko", language: "mkd", replyIndex: 6 },
          { speakerId: "ivan", language: "ru", replyIndex: 4 },
          { speakerId: "ivan", language: "mkd", replyIndex: 4 },
        ],
      },
    },
  ],
};
