import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-3",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Добрый день! Я хочу вас познакомить. Ивана, этом мой брат Владимир. Владимир, это моя подруга Ивана. — Очень приятно. 
        Владимир, вы первый раз в Македонии? — Да. Мне очень здесь нравится! Я думаю, что Охрид — очень красивый город. — Я родом из Охрида.
        Я думаю, что Охрид — самый красивый город в мире. А вы от куда из Молдавии? — Я из Кишенёва. 2. — Ты знаешь, кто это? — Это моя подруга
        Мария. — Кто она по национальности? Она полька. — Полька? Она очень хорошо говорит по-македонски. — Она уже тридцать лет живёт и работает
        в Скопье. Её муж македонец. — А как зовут её мужа? — Его зовут Гоце. — А кто они по профессии? — Мария парикхмахер, а у её муже своя
        кампания. — А сколько им лет? — Марии пятьдесят восем лет, а Гоце шестьдесят один. — У них есть дети? — Да, Александр и Марина. Александр
        уже работает, ему тридцать лет. Он работает администратором в Холидей Инн. А Марина студентка, ей двадцать три года. 3. Я встаю, принимаю
        душ, одеваюсь, пью кофе, вызываю такси и еду в центр города. Там я встречаюсь во своей подругой Наташей. Наташа македонка, но очень хорошо
        говорит по-румынски. Она рассказывает мне о Македонии. Потом мы расплачиваемся и идем гулять.
        `,
        answer: [
          `1. Сакам да ве запознаам. Ивана, ова е брат ми Владимир. Владимир, ова е другарка ми Ивана. Мило ми е. Владимир, првпат сте во 
          Македониjа? Да. Многу ми се допаѓа тука. Мислам дека Охрид е многу убав град. По потекло сум од Охрид. Мислам дека моjот град е
          наjубав на светот. А од каде сте од Молдавиjа? Од Кишенев. 2. Дали знаеш коj е тоа? Тоа е другарка ми Мариjа. Што е по националност?
          Полjакиња е. Полjакиња? Многу добро зборува македонски. Веќе триесет години живее и работи во Скопjе. Неjзиниот маж е Македонец.
          А како се вика маж ѝ? Се вика Гоце. Што се по професиjа? Мариjа е фризерка, а маж ѝ има своjа компаниjа. А колку години имаат?
          Мариjа има педесет години, а Гоце шеесет и една. Дали имаат деца? Да, Александари Марина. Александар веќе работи, има триесет години.
          Работи како администратор во Холидеj Инн. А Марина е студентка, има дваесет и три години. 3. Станувам, се туширам, пиjам кафе, викам
          такси и одам во центарот на градот. Таму се среќавам со другарка ми Наташа. Наташа е Македонка, на многу убаво зборува руски. Ми
          раскажува за Македониjа. Потоа плаќаме и одиме да шетаме.`,
        ],
      },
    },
  ],
};
