import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-3",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте краткие формы дательного падежа от указанных местоимений.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. ___ (то*j) благо*дарам за по*дарок.`,
            answer: [`Му`],
          },
          {
            mkd: `2. ___ (ти*е) пи*шуваш пи*смо?`,
            answer: [`Им`],
          },
          {
            mkd: `3. Бо*jан че*сто ___ (jас) се jа*вува.`,
            answer: [`ми`],
          },
          {
            mkd: `4. Че*сто ту*ка ___ (се*бе) купу*ваме ка*фе.`,
            answer: [`си`],
          },
          {
            mkd: `5. ___ (ние) се допа*ѓаат Тр*пе и же*на му.`,
            answer: [`Ни`],
          },
          {
            mkd: `6. Зо*што не ___ (та*а) раскажу*ваат за брат им.`,
            answer: [`ѝ`],
          },
          {
            mkd: `7. Са*кам да ___ (ти) се заблаго*дарам.`,
            answer: [`ти`],
          },
          {
            mkd: `8. Што ___ (вие) чи*таат?`,
            answer: [`ви`],
          },
        ],
      },
    },
  ],
};
