import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-3",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте краткие формы винительного падежа от указанных местоимений.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. ___ (то\u0301j) ко\u0301ристам ко\u0301га па\u0301тувам.`,
            answer: [`Го`],
          },
          {
            mkd: `2. ___ (ти\u0301е) прашу\u0301ваме за И\u0301стамбул.`,
            answer: [`Ги`],
          },
          {
            mkd: `3. Да\u0301ли ___ (jас) разби\u0301рате.`,
            answer: [`ме`],
          },
          {
            mkd: `4. Љу\u0301бица мно\u0301гу ___ (се\u0301бе) са\u0301ка.`,
            answer: [`се`],
          },
          {
            mkd: `5. Зо\u0301што не ___ (ни\u0301е) че\u0301каш?`,
            answer: [`не`],
          },
          {
            mkd: `6. Че\u0301сто ___ (та\u0301а) ку\u0301пуваш?`,
            answer: [`jа`],
          },
          {
            mkd: `7. Са\u0301кам да ___ (ти) пра\u0301шам.`,
            answer: [`те`],
          },
          {
            mkd: `8. Мно\u0301гу са\u0301каат да ___ (вие) запо\u0301знаат?`,
            answer: [`ве`],
          },
        ],
      },
    },
  ],
};
