import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-3",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте указанные словосочетания, используя краткие формы местоимений в дательном падеже.`,
      ],
      content: {
        text: "Образец: <span>мо*jот маж</span> — <span>ма*ж ми</span>",
        sentences: [
          {
            mkd: `<span>ва*шиот та*тком ___ , неjзи*ната ма*jка ___ , мо*jот брат ___ , тво*jата се*страде*до ___ , 
            ва*шата же*на ___ , ни*вната дру*гарка ___ , неjзи*ниот дру*гарка*фе ___ ,
            ва*шиот де*до ___ , мо*jата ба*ба ___ , на*шиот син ___ , ни*вната ќе*рка ___ ,
            неjзи*ниот де*чко ___ , него*вата де*воjка ___ </span>`,
            answer: [
              `татко ви`,
              `маjка ѝ`,
              `брат ми`,
              `сестра ти`,
              `жена ви`,
              `другарка им`,
              `другар ѝ`,
              `дедо ви`,
              `баба ми`,
              `син ни`,
              `ќерка им`,
              `дечко ѝ`,
              `девоjка му`,
            ],
          },
        ],
      },
    },
  ],
};
