import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-3",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Трансформируйте указанные словосочетания, используя краткие формы местоимений в дательном падеже.`,
      ],
      content: {
        text: "Образец: <span>мо\u0301jот маж</span> — <span>ма\u0301ж ми</span>",
        sentences: [
          {
            mkd: `<span>ва\u0301шиот та\u0301тком ___ , неjзи\u0301ната ма\u0301jка ___ , мо\u0301jот брат ___ , тво\u0301jата се\u0301страде\u0301до ___ , 
            ва\u0301шата же\u0301на ___ , ни\u0301вната дру\u0301гарка ___ , неjзи\u0301ниот дру\u0301гарка\u0301фе ___ ,
            ва\u0301шиот де\u0301до ___ , мо\u0301jата ба\u0301ба ___ , на\u0301шиот син ___ , ни\u0301вната ќе\u0301рка ___ ,
            неjзи\u0301ниот де\u0301чко ___ , него\u0301вата де\u0301воjка ___ </span>`,
            answer: [
              `татко ви`,
              `маjка ѝ`,
              `брат ми`,
              `сестра ти`,
              `жена ви`,
              `другарка им`,
              `другар ѝ`,
              `дедо ви`,
              `баба ми`,
              `син ни`,
              `ќерка им`,
              `дечко ѝ`,
              `девоjка му`,
            ],
          },
        ],
      },
    },
  ],
};
