import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-3",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Я хочу хорошо говорить, читать и писать по-македонски. 2. Ты умеешь писать по-английски? 3. Мой муж начинает работать в 
        8 часов. 4. Мы их учим писать по-русски. 5. Вы любите путешествовать? 6. Они договариваются встретиться. 7. Здесь хорошо отдыхать. 
        8. Я хочу с вами познакомиться. 9. Я хочу, чтобы моя жена познакомилась с вами. 10. Ты хочешь поехать на такси? 11. Ты хочешь, чтобы
        мы поехали на такси? 12. Моя сестра хочет встретиться с Саней. 13. Моя сестра хочет, чтобы я встретился с Саней. 14. Мы им звоним,
        чтобы рассказать о Москве. 15. Мы им звоним, чтобы они рассказали нам о Москве. 16. Я покупаю билеты, чтобы мы поехали в Голландию. 
        17. Я покупаю билеты, чтобы Александр и Мария поехали в Германию.`,
        answer: [
          `1. Сакам добро да зборувам, да читам и да пишувам македонски. 2. Дали знаеш да пишуваш англиски? 3. Маж ми почнува да работи во 8
        часот. 4. Ги учиме да пишуваат руски. 5. Дали сакате да патувате? 6. Се договараат да се сретнат. 7. Тука добро се одмора. 8. Сакам
        да се запознаам со вас. 9. Сакам жена ми да се запознае со вас. 10. Дали сакаш да одиш со такси? 11. Дали сакаш да одиме со такси? 
        12. Сестра ми сака да се сретне со Сања. 13. Сестра ми сака да се сретнам со Сања. 14. Им се јавуваме да им раскажеме за Москва. 
        15. Им се јавуваме да ни раскажат за Москва. 16. Купувам билети за да одиме во Холандија. 17. Купувам билети за Александар и
        Марија да одат во Германија.`,
        ],
      },
    },
  ],
};
