import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-3",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Раскройте скобки.`],
      content: {
        sentences: [
          {
            mkd: `1. Jо\u0301ван не збо\u0301рува за (се\u0301бе) ___ .`,
            answer: [`себе`],
          },
          {
            mkd: `2. Зо\u0301што не збору\u0301вате со (jас) ___ ?`,
            answer: [`мене`],
          },
          {
            mkd: `3. Не о\u0301диме без (ти\u0301е) ___ .`,
            answer: [`нив`],
          },
          {
            mkd: `4. То\u0301а е пи\u0301смо од (та\u0301а) ___ .`,
            answer: [`неа`],
          },
          {
            mkd: `5. За (ко\u0301j) ___ ку\u0301пуваш по\u0301дарок?`,
            answer: [`кого`],
          },
          {
            mkd: `6. Да\u0301ли та\u0301тко ѝ на Ле\u0301jла ра\u0301боти со (ти) ___ ?`,
            answer: [`тебе`],
          },
          {
            mkd: `7. Не почну\u0301ваат без (ни\u0301е) ___ .`,
            answer: [`нас`],
          },
          {
            mkd: `8. То\u0301j е по\u0301дарок од (то\u0301j) ___ за (ти) ___ ?`,
            answer: [`него`, `тебе`],
          },
          {
            mkd: `8. Жи\u0301веам над (ви\u0301е) ___ .`,
            answer: [`вас`],
          },
        ],
      },
    },
  ],
};
