import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-3",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Образуйте краткие формы дательного падежа от указанных местоимений.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. ___ (то\u0301j) благо\u0301дарам за по\u0301дарок.`,
            answer: [`Му`],
          },
          {
            mkd: `2. ___ (ти\u0301е) пи\u0301шуваш пи\u0301смо?`,
            answer: [`Им`],
          },
          {
            mkd: `3. Бо\u0301jан че\u0301сто ___ (jас) се jа\u0301вува.`,
            answer: [`ми`],
          },
          {
            mkd: `4. Че\u0301сто ту\u0301ка ___ (се\u0301бе) купу\u0301ваме ка\u0301фе.`,
            answer: [`си`],
          },
          {
            mkd: `5. ___ (ние) се допа\u0301ѓаат Тр\u0301пе и же\u0301на му.`,
            answer: [`Ни`],
          },
          {
            mkd: `6. Зо\u0301што не ___ (та\u0301а) раскажу\u0301ваат за брат им.`,
            answer: [`ѝ`],
          },
          {
            mkd: `7. Са\u0301кам да ___ (ти) се заблаго\u0301дарам.`,
            answer: [`ти`],
          },
          {
            mkd: `8. Што ___ (вие) чи\u0301таат?`,
            answer: [`ви`],
          },
        ],
      },
    },
  ],
};
