import { ParagraphSectionsProps } from "@/types";

export const needVerb: ParagraphSectionsProps = {
  type: "need-verb",
  subtitle: ["ГЛАГОЛ <span>ТРЕБА</span>"],
  content: {
    text: `
    На русский язык глагол <span>тре\u0301ба</span> можно перевести и как «надо/нужно»надо/нужно, и как «должен»: <span>(ви́е) ќе трѐба да
    ку\u0301пите би\u0301лет</span> «вы должны будете купить билет», или «вам надо/нужно будет купить билет». Перевод зависит от
    контекста. Обратите внимание, что здесь глагол <span>тре\u0301ба</span> стоит в форме 3-го лица ед.ч. то есть употребляется безлично,
    а вот второй глагол стоит в личной форме, которая подсказывает, кто должен что-то сделать (<span>да купите</span>, то есть вы).  

    Кроме того, на русский язык глагол <span>тре\u0301ба</span> переводится также при помощи краткого прилагательного 
    «нужен (нужна/о/ы)»: <span>ќе ми тре\u0301баат па\u0301ри</span> «мне будут нужны деньги».  Перед глаголом обычно стоит местоимение в
    дательном падеже (указывает кому нужен субъект), а сам глагол <span>тре\u0301ба</span> стоит в личной форме, которая зависит от лица
    и числа подлежащего: <span>тре\u0301бам</span> «я нужен/нужна», <span>тре\u0301бате</span> «вы нужны» и т.д.`,
  },
};
