import { ParagraphSectionsProps } from "@/types";

export const needVerb: ParagraphSectionsProps = {
  type: "grammar-need-verb",
  slug: "lesson-3",
  subtitle: "ГЛАГОЛ <span>ТРЕ*БА</span>",
  content: {
    text: `
    На русский язык глагол <span>тре*ба</span> можно перевести и как «надо/нужно», и как «должен»:
    <span>(ви́е) ќе трѐба да ку*пите би*лет</span> «вы должны будете купить билет», или «вам надо/нужно будет купить билет». Перевод зависит от
    контекста. Обратите внимание, что здесь глагол <span>тре*ба</span> стоит в форме 3-го лица ед.ч. то есть употребляется безлично, а вот
    второй глагол стоит в личной форме, которая подсказывает, кто должен что-то сделать (<span>да купите</span>, то есть вы).

    Кроме того, на русский язык глагол <span>тре*ба</span> переводится также при помощи краткого прилагательного  «нужен (нужна/о/ы)»:
    <span>ќе ми тре*баат па*ри</span> «мне будут нужны деньги».  Перед глаголом обычно стоит местоимение в дательном падеже (указывает кому
    нужен субъект), а сам глагол <span>тре*ба</span> стоит в личной форме, которая зависит от лица и числа подлежащего: <span>тре*бам</span>
    «я нужен/нужна», <span>тре*бате</span> «вы нужны» и т.д.`,
  },
};
