import { VocabularyData } from "@/types/vocabularyTypes";

const vocabulary1: VocabularyData = {
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-1",
  sections: [
    {
      type: "vocabulary-1",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "Добро утро!",
            pron: "до́бро_у́тро / до́бро утро",
            ru: "Доброе утро!",
          },
          {
            mkd: "Добар ден!",
            pron: "до́бар_дэ́н",
            ru: "Добрый день!",
          },
          {
            mkd: "Добро вечер / добра вечер!",
            pron: "до́бро_вэ́чэр / до́бра_вэ́чэр",
            ru: "Добрый вечер!",
          },
          {
            mkd: "Добра ноќ!",
            pron: "до́бра_но́ќ",
            ru: "Спокойной ночи!",
          },
          {
            mkd: "Здраво!",
            pron: "здра́во",
            ru: "Здравствуйте! Привет!",
          },
          {
            mkd: "До видување!",
            pron: "до_виду́ванје",
            ru: "До свидания!",
          },
          {
            mkd: "Пријатно!",
            pron: "при́јатно",
            ru: "Всего хорошего! До свидания!",
          },
          {
            mkd: "Чао!",
            pron: "ча́о",
            ru: "Пока!",
          },
          {
            mkd: "Како се викаш?",
            pron: "ка́ко сэ_ви́каш",
            ru: "Как тебя зовут?",
          },
          {
            mkd: "Како се викате?",
            pron: "ка́ко сэ_ви́кате",
            ru: "Как вас зовут?",
          },
          {
            mkd: "Мило ми е!",
            pron: "ми́ло_ми_э",
            ru: "Мне очень приятно!",
          },
          {
            mkd: "Повели!",
            pron: "по́вэли",
            ru: "Пожалуйста! (обращение на ты)",
          },
          {
            mkd: "Повелете!",
            pron: "повэ́лэтэ",
            ru: "Пожалуйста! (обращение на вы)",
          },
          {
            mkd: "Те молам!",
            pron: "тэ_мо́лам",
            ru: "Пожалуйста! Я тебя прошу!",
          },
          {
            mkd: "Ве молам!",
            pron: "вэ_мо́лам",
            ru: "Пожалуйста! Я вас прошу!",
          },
          {
            mkd: "Благодарам!",
            pron: "благо́дарам",
            ru: "Спасибо! Благодарю!",
          },
          {
            mkd: "Фала!",
            pron: "фа́ла",
            ru: "Спасибо! (неофициально)",
          },
          {
            mkd: "Нема на што!",
            pron: "нэ́ма_на_што",
            ru: "Не за что!",
          },
          {
            mkd: "Извини/Извинете",
            pron: "изви́ни / изви́нэтэ",
            ru: "Извини/Извините",
          },
          {
            mkd: "Што убаво!",
            pron: "што_у́баво",
            ru: "Как здорово!",
          },
        ],
      },
    },
    {
      type: "vocabulary-2",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "аеродро́м",
            pron: "аэродро́м",
            ru: "аэропорт",
          },
          {
            mkd: "авио́н",
            pron: "авио́н",
            ru: "самолёт",
          },
          {
            mkd: "авио́нски",
            pron: "авио́нски",
            ru: "авиа",
          },
          {
            mkd: "ба́гаж",
            pron: "бага́ж",
            ru: "багаж",
          },
          {
            mkd: "безца́рински",
            pron: "бэсца́рински",
            ru: "бестаможенный",
          },
          {
            mkd: "би́лет",
            pron: "би́лэт",
            ru: "билет",
          },
          {
            mkd: "благо́дари",
            pron: "благо́дари",
            ru: "благодарить",
          },
          {
            mkd: "бр\u0301зо",
            pron: "бр\u0301зо",
            ru: "быстро",
          },
          {
            mkd: "ваш",
            pron: "ваш",
            ru: "ваш",
          },
          {
            mkd: "ви́ка",
            pron: "ви́ка",
            ru: "звать, вызывать",
          },
          {
            mkd: "се ви́ка",
            pron: "сэ_ви́ка",
            ru: "зваться",
          },
          {
            mkd: "во",
            pron: "во",
            ru: "в",
          },
          {
            mkd: "вре\u0301ме",
            pron: "врэ́мэ",
            ru: "время",
          },
          {
            mkd: "да",
            pron: "да",
            ru: "да",
          },
          {
            mkd: "деклари́рање",
            pron: "дэклариранйэ",
            ru: "декларирование",
          },
          {
            mkd: "де\u0301нес/де\u0301неска",
            pron: "дэ́нэс / дэ́нэска",
            ru: "сегодня",
          },
          {
            mkd: "до́волно",
            pron: "до́волно",
            ru: "достаточно",
          },
          {
            mkd: "же\u0301на",
            pron: "жэ́на",
            ru: "женщина, жена",
          },
          {
            mkd: "жи́вее",
            pron: "жи́вээ",
            ru: "жить",
          },
          {
            mkd: "за",
            pron: "за",
            ru: "для, с целью, в",
          },
          {
            mkd: "за да",
            pron: "за_да",
            ru: "чтобы",
          },
          {
            mkd: "се заблаго́дари",
            pron: "сэ_заблаго́дари",
            ru: "поблагодарить",
          },
          {
            mkd: "за́тоа",
            pron: "за́тоа",
            ru: "поэтому",
          },
          {
            mkd: "за́тоа што",
            pron: "за́тоа_што",
            ru: "поэтому что",
          },
          {
            mkd: "и",
            pron: "и",
            ru: "и",
          },
          {
            mkd: "и́злез",
            pron: "и́злэз",
            ru: "выход",
          },
          {
            mkd: "и́сто та́ка",
            pron: "и́сто_та́ка",
            ru: "точно так же, также",
          },
          {
            mkd: "и́ма",
            pron: "и́ма",
            ru: "иметь",
          },
          {
            mkd: "ка́де",
            pron: "ка́дэ",
            ru: "где, куда",
          },
          {
            mkd: "ка́ко",
            pron: "ка́ко",
            ru: "как",
          },
          {
            mkd: "ка́фе",
            pron: "ка́фэ",
            ru: "кофе",
          },
          {
            mkd: "се́ ка́чи",
            pron: "сэ́_ка́чи",
            ru: "подняться, сесть (в транспорт)",
          },
          {
            mkd: "се́ ка́чува",
            pron: "сэ́_ка́чува",
            ru: "подниматься, садиться (в транспорт)",
          },
          {
            mkd: "кон",
            pron: "кон",
            ru: "к, в направлении к",
          },
          {
            mkd: "контро́ла",
            pron: "контро́ла",
            ru: "контроль",
          },
          {
            mkd: "ку́пи",
            pron: "ку́пи",
            ru: "купить",
          },
          {
            mkd: "ку́пува",
            pron: "ку́пува",
            ru: "покупать",
          },
          {
            mkd: "ку́фер",
            pron: "ку́фэр",
            ru: "чемодан",
          },
          {
            mkd: "ле́т",
            pron: "лéт",
            ru: "полет",
          },
          {
            mkd: "ма́ж",
            pron: "ма́ш",
            ru: "мужчина; муж",
          },
          {
            mkd: "Маке́донец",
            pron: "маке́донец",
            ru: "македонец",
          },
          {
            mkd: "Маке́донка",
            pron: "маке́донка",
            ru: "македонка",
          },
          {
            mkd: "Маке́донци",
            pron: "маке́донци",
            ru: "македонцы",
          },
          {
            mkd: "ме́сто",
            pron: "ме́сто",
            ru: "место",
          },
          {
            mkd: "мно́гу",
            pron: "мно́гу",
            ru: "много, очень",
          },
          {
            mkd: "мо́ли",
            pron: "мо́ли",
            ru: "просить",
          },
          {
            mkd: "нао́ѓа",
            pron: "на́оѓа",
            ru: "находить",
          },
          {
            mkd: "на́пише",
            pron: "на́пишэ",
            ru: "написать",
          },
          {
            mkd: "не",
            pron: "нэ",
            ru: "не, нет",
          },
          {
            mkd: "не́ма",
            pron: "не́ма",
            ru: "не иметь",
          },
          {
            mkd: "непозна́т",
            pron: "нэпозна́т",
            ru: "незнакомый",
          },
          {
            mkd: "ни́што",
            pron: "ни́што",
            ru: "ничто, ничего",
          },
          {
            mkd: "но",
            pron: "но",
            ru: "но, однако",
          },
          {
            mkd: "о́ва",
            pron: "о́ва",
            ru: "это",
          },
          {
            mkd: "о́ди",
            pron: "о́ди",
            ru: "идти, ходить, ехать, ездить",
          },
          {
            mkd: "о́дмор",
            pron: "о́дмор",
            ru: "отдых, отпуск",
          },
          {
            mkd: "па́кува",
            pron: "па́кува",
            ru: "паковать, собирать",
          },
          {
            mkd: "па́сош",
            pron: "па́сош",
            ru: "загранпаспорт",
          },
          {
            mkd: "па́сошка контро́ла",
            pron: "па́сошка контро́ла",
            ru: "паспортный контроль",
          },
          {
            mkd: "па́тник",
            pron: "па́тник",
            ru: "путешественник, пассажир",
          },
          {
            mkd: "па́тничка",
            pron: "па́тничка",
            ru: "путешественница, пассажирка",
          },
          {
            mkd: "па́тници",
            pron: "па́тници",
            ru: "путешественники, пассажиры",
          },
        ],
      },
    },
  ],
};

export default vocabulary1;
