import { VocabularyData } from "@/types/vocabularyTypes";

const vocabulary1: VocabularyData = {
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-1",
  sections: [
    {
      type: "vocabulary-1",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "Добро утро!",
            pron: "до́бро_у́тро / до́бро утро",
            ru: "Доброе утро!",
          },
          {
            mkd: "Добар ден!",
            pron: "до́бар_дэ́н",
            ru: "Добрый день!",
          },
          {
            mkd: "Добро вечер / добра вечер!",
            pron: "до́бро_вэ́чэр / до́бра_вэ́чэр",
            ru: "Добрый вечер!",
          },
          {
            mkd: "Добра ноќ!",
            pron: "до́бра_но́ќ",
            ru: "Спокойной ночи!",
          },
          {
            mkd: "Здраво!",
            pron: "здра́во",
            ru: "Здравствуйте! Привет!",
          },
          {
            mkd: "До видување!",
            pron: "до_виду́ванје",
            ru: "До свидания!",
          },
          {
            mkd: "Пријатно!",
            pron: "при́јатно",
            ru: "Всего хорошего! До свидания!",
          },
          {
            mkd: "Чао!",
            pron: "ча́о",
            ru: "Пока!",
          },
          {
            mkd: "Како се викаш?",
            pron: "ка́ко сэ_ви́каш",
            ru: "Как тебя зовут?",
          },
          {
            mkd: "Како се викате?",
            pron: "ка́ко сэ_ви́кате",
            ru: "Как вас зовут?",
          },
          {
            mkd: "Мило ми е!",
            pron: "ми́ло_ми_э",
            ru: "Мне очень приятно!",
          },
          {
            mkd: "Повели!",
            pron: "по́вэли",
            ru: "Пожалуйста! (обращение на ты)",
          },
          {
            mkd: "Повелете!",
            pron: "повэ́лэтэ",
            ru: "Пожалуйста! (обращение на вы)",
          },
          {
            mkd: "Те молам!",
            pron: "тэ_мо́лам",
            ru: "Пожалуйста! Я тебя прошу!",
          },
          {
            mkd: "Ве молам!",
            pron: "вэ_мо́лам",
            ru: "Пожалуйста! Я вас прошу!",
          },
          {
            mkd: "Благодарам!",
            pron: "благо́дарам",
            ru: "Спасибо! Благодарю!",
          },
          {
            mkd: "Фала!",
            pron: "фа́ла",
            ru: "Спасибо! (неофициально)",
          },
          {
            mkd: "Нема на што!",
            pron: "нэ́ма_на_што",
            ru: "Не за что!",
          },
          {
            mkd: "Извини/Извинете",
            pron: "изви́ни / изви́нэтэ",
            ru: "Извини/Извините",
          },
          {
            mkd: "Што убаво!",
            pron: "што_у́баво",
            ru: "Как здорово!",
          },
        ],
      },
    },
  ],
};

export default vocabulary1;
