import { VocabularyData } from "@/types";

export const vocabulary2: VocabularyData = {
  type: "vocabulary-2",
  slug: "lesson-1",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "аеродро́м",
            pron: "аэродро́м",
            ru: "аэропорт",
          },
          {
            mkd: "авио́н",
            pron: "авио́н",
            ru: "самолёт",
          },
          {
            mkd: "авио́нски",
            pron: "авио́нски",
            ru: "авиа",
          },
          {
            mkd: "ба́гаж",
            pron: "бага́ж",
            ru: "багаж",
          },
          {
            mkd: "безца́рински",
            pron: "бэсца́рински",
            ru: "бестаможенный",
          },
          {
            mkd: "би́лет",
            pron: "би́лэт",
            ru: "билет",
          },
          {
            mkd: "благо́дари",
            pron: "благо́дари",
            ru: "благодарить",
          },
          {
            mkd: "бр*зо",
            pron: "бр*зо",
            ru: "быстро",
          },
          {
            mkd: "ваш",
            pron: "ваш",
            ru: "ваш",
          },
          {
            mkd: "ви́ка",
            pron: "ви́ка",
            ru: "звать, вызывать",
          },
          {
            mkd: "се ви́ка",
            pron: "сэ_ви́ка",
            ru: "зваться",
          },
          {
            mkd: "во",
            pron: "во",
            ru: "в",
          },
          {
            mkd: "вре*ме",
            pron: "врэ́мэ",
            ru: "время",
          },
          {
            mkd: "да",
            pron: "да",
            ru: "да",
          },
          {
            mkd: "деклари́рање",
            pron: "дэклариранйэ",
            ru: "декларирование",
          },
          {
            mkd: "де*нес / де*неска",
            pron: "дэ́нэс / дэ́нэска",
            ru: "сегодня",
          },
          {
            mkd: "до́волно",
            pron: "до́волно",
            ru: "достаточно",
          },
          {
            mkd: "же*на",
            pron: "жэ́на",
            ru: "женщина, жена",
          },
          {
            mkd: "жи́вее",
            pron: "жи́вээ",
            ru: "жить",
          },
          {
            mkd: "за",
            pron: "за",
            ru: "для, с целью, в",
          },
          {
            mkd: "за да",
            pron: "за_да",
            ru: "чтобы",
          },
          {
            mkd: "се заблаго́дари",
            pron: "сэ_заблаго́дари",
            ru: "поблагодарить",
          },
          {
            mkd: "за́тоа",
            pron: "за́тоа",
            ru: "поэтому",
          },
          {
            mkd: "за́тоа што",
            pron: "за́тоа_што",
            ru: "поэтому что",
          },
          {
            mkd: "и",
            pron: "и",
            ru: "и",
          },
          {
            mkd: "и́злез",
            pron: "и́злэз",
            ru: "выход",
          },
          {
            mkd: "и́сто та́ка",
            pron: "и́сто_та́ка",
            ru: "точно так же, также",
          },
          {
            mkd: "и́ма",
            pron: "и́ма",
            ru: "иметь",
          },
          {
            mkd: "ка́де",
            pron: "ка́дэ",
            ru: "где, куда",
          },
          {
            mkd: "ка́ко",
            pron: "ка́ко",
            ru: "как",
          },
          {
            mkd: "ка́фе",
            pron: "ка́фэ",
            ru: "кофе",
          },
          {
            mkd: "се́ ка́чи",
            pron: "сэ́_ка́чи",
            ru: "подняться, сесть (в транспорт)",
          },
          {
            mkd: "се́ ка́чува",
            pron: "сэ́_ка́чува",
            ru: "подниматься, садиться (в транспорт)",
          },
          {
            mkd: "кон",
            pron: "кон",
            ru: "к, в направлении к",
          },
          {
            mkd: "контро́ла",
            pron: "контро́ла",
            ru: "контроль",
          },
          {
            mkd: "ку́пи",
            pron: "ку́пи",
            ru: "купить",
          },
          {
            mkd: "ку́пува",
            pron: "ку́пува",
            ru: "покупать",
          },
          {
            mkd: "ку́фер",
            pron: "ку́фэр",
            ru: "чемодан",
          },
          {
            mkd: "ле́т",
            pron: "лéт",
            ru: "полет",
          },
          {
            mkd: "ма́ж",
            pron: "ма́ш",
            ru: "мужчина; муж",
          },
          {
            mkd: "Маке́донец",
            pron: "маке́донец",
            ru: "македонец",
          },
          {
            mkd: "Маке́донка",
            pron: "маке́донка",
            ru: "македонка",
          },
          {
            mkd: "Маке́донци",
            pron: "маке́донци",
            ru: "македонцы",
          },
          {
            mkd: "ме́сто",
            pron: "ме́сто",
            ru: "место",
          },
          {
            mkd: "мно́гу",
            pron: "мно́гу",
            ru: "много, очень",
          },
          {
            mkd: "мо́ли",
            pron: "мо́ли",
            ru: "просить",
          },
          {
            mkd: "нао́ѓа",
            pron: "на́оѓа",
            ru: "находить",
          },
          {
            mkd: "на́пише",
            pron: "на́пишэ",
            ru: "написать",
          },
          {
            mkd: "не",
            pron: "нэ",
            ru: "не, нет",
          },
          {
            mkd: "не́ма",
            pron: "не́ма",
            ru: "не иметь",
          },
          {
            mkd: "непозна́т",
            pron: "нэпозна́т",
            ru: "незнакомый",
          },
          {
            mkd: "ни́што",
            pron: "ни́што",
            ru: "ничто, ничего",
          },
          {
            mkd: "но",
            pron: "но",
            ru: "но, однако",
          },
          {
            mkd: "о́ва",
            pron: "о́ва",
            ru: "это",
          },
          {
            mkd: "о́ди",
            pron: "о́ди",
            ru: "идти, ходить, ехать, ездить",
          },
          {
            mkd: "о́дмор",
            pron: "о́дмор",
            ru: "отдых, отпуск",
          },
          {
            mkd: "па́кува",
            pron: "па́кува",
            ru: "паковать, собирать",
          },
          {
            mkd: "па́сош",
            pron: "па́сош",
            ru: "загранпаспорт",
          },
          {
            mkd: "па́сошка контро́ла",
            pron: "па́сошка_контро́ла",
            ru: "паспортный контроль",
          },
          {
            mkd: "па́тник",
            pron: "па́тник",
            ru: "путешественник, пассажир",
          },
          {
            mkd: "па́тничка",
            pron: "па́тничка",
            ru: "путешественница, пассажирка",
          },
          {
            mkd: "па́тници",
            pron: "па́тници",
            ru: "путешественники, пассажиры",
          },
          {
            mkd: "па́тува",
            pron: "па́тува",
            ru: "путешествовать",
          },
          {
            mkd: "пату*вање",
            pron: "пату́ван'э",
            ru: "путешествие",
          },
          {
            mkd: "пи*е",
            pron: "пи́э",
            ru: "пить",
          },
          {
            mkd: "пи*шува",
            pron: "пи́шува",
            ru: "писать",
          },
          {
            mkd: "по*дарок",
            pron: "по́дарок",
            ru: "подарок",
          },
          {
            mkd: "пода*роци",
            pron: "пода́роци",
            ru: "подарки",
          },
          {
            mkd: "поjа*дува",
            pron: "пойа́дува",
            ru: "завтракать",
          },
          {
            mkd: "по*мине",
            pron: "по́минэ",
            ru: "провести (время); пройти",
          },
          {
            mkd: "поми*нува",
            pron: "поми́нува",
            ru: "проводить (время); проходить",
          },
          {
            mkd: "по*тоа",
            pron: "по́тоа",
            ru: "потом",
          },
          {
            mkd: "пре*дава",
            pron: "прэ́дава",
            ru: "сдавать",
          },
          {
            mkd: "пре*ку",
            pron: "прэ́ку",
            ru: "через",
          },
          {
            mkd: "се при*jави",
            pron: "сэ_при́йави",
            ru: "зарегистрироваться",
          },
          {
            mkd: "се приjа*вува",
            pron: "сэ_прийа́вува",
            ru: "регистрироваться",
          },
          {
            mkd: "при*jател",
            pron: "при́йатэл",
            ru: "приятель",
          },
          {
            mkd: "приjа*телка",
            pron: "прийа́тэлка",
            ru: "приятельница",
          },
          {
            mkd: "приjа*тели",
            pron: "прийа́тэли",
            ru: "приятели",
          },
          {
            mkd: "прода*вница",
            pron: "прода́вница",
            ru: "магазин",
          },
          {
            mkd: "ра*но",
            pron: "ра́но",
            ru: "рано",
          },
          {
            mkd: "рет",
            pron: "рэт",
            ru: "очередь",
          },
          {
            mkd: "ро*днина",
            pron: "ро́днина",
            ru: "родственник, родственница",
          },
          {
            mkd: "ро*днини",
            pron: "ро́днини",
            ru: "родственники",
          },
          {
            mkd: "Ру*син",
            pron: "ру́син",
            ru: "русский (национальность)",
          },
          {
            mkd: "Ру*синка",
            pron: "ру́синка",
            ru: "русская (национальность)",
          },
          {
            mkd: "Ру*си",
            pron: "ру́си",
            ru: "русские (национальность)",
          },
          {
            mkd: "си*гурен",
            pron: "си́гурэн",
            ru: "верный, надежный, уверенный",
          },
          {
            mkd: "слу*жбеник",
            pron: "слу́жбэник",
            ru: "служащий",
          },
          {
            mkd: "со",
            pron: "со",
            ru: "с",
          },
          {
            mkd: "со*пруг",
            pron: "со́пруг",
            ru: "супруг",
          },
          {
            mkd: "со*пруга",
            pron: "со́пруга",
            ru: "супруга",
          },
          {
            mkd: "сопру*жници",
            pron: "сопру́жници",
            ru: "супруги",
          },
          {
            mkd: "спа*кува",
            pron: "спа́кува",
            ru: "упаковать, собрать",
          },
          {
            mkd: "ста*не",
            pron: "ста́нэ",
            ru: "встать",
          },
          {
            mkd: "ста*нува",
            pron: "ста́нува",
            ru: "вставать",
          },
          {
            mkd: "та*кси",
            pron: "та́кси",
            ru: "такси",
          },
          {
            mkd: "та*му",
            pron: "та́му",
            ru: "там, туда",
          },
          {
            mkd: "тури*зам",
            pron: "тури́зам",
            ru: "туризм",
          },
          {
            mkd: "ца*рински",
            pron: "ца́рински",
            ru: "таможенный",
          },
          {
            mkd: "цел (ж.р.)",
            pron: "цел",
            ru: "цель ",
          },
          {
            mkd: "ча*ј",
            pron: "ча́й",
            ru: "чай",
          },
          {
            mkd: "че*ка",
            pron: "чэ́ка",
            ru: "ждать",
          },
          {
            mkd: "че*сто",
            pron: "чэ́сто",
            ru: "часто",
          },
        ],
      },
    },
  ],
};
