import { VocabularyData } from "@/types";

export const vocabulary1: VocabularyData = {
  type: "vocabulary-1",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-1",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "До\u0301бро у\u0301тро!",
            pron: "до́бро_у́тро / до́бро_у\u0301тро",
            ru: "Доброе утро!",
          },
          {
            mkd: "До\u0301бар ден!",
            pron: "до́бар_дэ́н",
            ru: "Добрый день!",
          },
          {
            mkd: "До\u0301бро ве\u0301чер / до\u0301бра ве\u0301чер!",
            pron: "до́бро_вэ́чэр / до́бра_вэ́чэр",
            ru: "Добрый вечер!",
          },
          {
            mkd: "До\u0301бра но\u0301ќ!",
            pron: "до́бра_но́ќ",
            ru: "Спокойной ночи!",
          },
          {
            mkd: "Здра\u0301во!",
            pron: "здра́во",
            ru: "Здравствуйте! Привет!",
          },
          {
            mkd: "До видување!",
            pron: "до_виду́ванје",
            ru: "До свидания!",
          },
          {
            mkd: "При\u0301јатно!",
            pron: "при́йатно",
            ru: "Всего хорошего! До свидания!",
          },
          {
            mkd: "Ча\u0301о!",
            pron: "ча́о",
            ru: "Пока!",
          },
          {
            mkd: "Ка\u0301ко се ви\u0301каш?",
            pron: "ка́ко_сэ_ви́каш",
            ru: "Как тебя зовут?",
          },
          {
            mkd: "Ка\u0301ко се ви\u0301кате?",
            pron: "ка́ко_сэ_ви́кате",
            ru: "Как вас зовут?",
          },
          {
            mkd: "Ми\u0301ло ми е!",
            pron: "ми́ло_ми_э",
            ru: "Мне очень приятно!",
          },
          {
            mkd: "По\u0301вели!",
            pron: "по́вэли",
            ru: "Пожалуйста! (обращение на ты)",
          },
          {
            mkd: "Пове\u0301лете!",
            pron: "повэ́лэтэ",
            ru: "Пожалуйста! (обращение на вы)",
          },
          {
            mkd: "Те мо\u0301лам!",
            pron: "тэ_мо́лам",
            ru: "Пожалуйста! Я тебя прошу!",
          },
          {
            mkd: "Ве мо\u0301лам!",
            pron: "вэ_мо́лам",
            ru: "Пожалуйста! Я вас прошу!",
          },
          {
            mkd: "Благо\u0301дарам!",
            pron: "благо́дарам",
            ru: "Спасибо! Благодарю!",
          },
          {
            mkd: "Фа\u0301ла!",
            pron: "фа́ла",
            ru: "Спасибо! (неофициально)",
          },
          {
            mkd: "Не\u0301ма на што!",
            pron: "нэ́ма_на_што",
            ru: "Не за что!",
          },
          {
            mkd: "И\u0301звини / Изви\u0301нете",
            pron: "изви́ни / изви́нэтэ",
            ru: "Извини / Извините",
          },
          {
            mkd: "Што у\u0301баво!",
            pron: "што_у́баво",
            ru: "Как здорово!",
          },
        ],
      },
    },
  ],
};
