import { VocabularyData } from "@/types";

export const vocabulary1: VocabularyData = {
  type: "vocabulary-1",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-1",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          {
            mkd: "До*бро у*тро!",
            pron: "до́бро_у́тро / до́бро_у*тро",
            ru: "Доброе утро!",
          },
          {
            mkd: "До*бар ден!",
            pron: "до́бар_дэ́н",
            ru: "Добрый день!",
          },
          {
            mkd: "До*бро ве*чер / до*бра ве*чер!",
            pron: "до́бро_вэ́чэр / до́бра_вэ́чэр",
            ru: "Добрый вечер!",
          },
          {
            mkd: "До*бра но*ќ!",
            pron: "до́бра_но́ќ",
            ru: "Спокойной ночи!",
          },
          {
            mkd: "Здра*во!",
            pron: "здра́во",
            ru: "Здравствуйте! Привет!",
          },
          {
            mkd: "До видување!",
            pron: "до_виду́ванје",
            ru: "До свидания!",
          },
          {
            mkd: "При*јатно!",
            pron: "при́йатно",
            ru: "Всего хорошего! До свидания!",
          },
          {
            mkd: "Ча*о!",
            pron: "ча́о",
            ru: "Пока!",
          },
          {
            mkd: "Ка*ко се ви*каш?",
            pron: "ка́ко_сэ_ви́каш",
            ru: "Как тебя зовут?",
          },
          {
            mkd: "Ка*ко се ви*кате?",
            pron: "ка́ко_сэ_ви́кате",
            ru: "Как вас зовут?",
          },
          {
            mkd: "Ми*ло ми е!",
            pron: "ми́ло_ми_э",
            ru: "Мне очень приятно!",
          },
          {
            mkd: "По*вели!",
            pron: "по́вэли",
            ru: "Пожалуйста! (обращение на ты)",
          },
          {
            mkd: "Пове*лете!",
            pron: "повэ́лэтэ",
            ru: "Пожалуйста! (обращение на вы)",
          },
          {
            mkd: "Те мо*лам!",
            pron: "тэ_мо́лам",
            ru: "Пожалуйста! Я тебя прошу!",
          },
          {
            mkd: "Ве мо*лам!",
            pron: "вэ_мо́лам",
            ru: "Пожалуйста! Я вас прошу!",
          },
          {
            mkd: "Благо*дарам!",
            pron: "благо́дарам",
            ru: "Спасибо! Благодарю!",
          },
          {
            mkd: "Фа*ла!",
            pron: "фа́ла",
            ru: "Спасибо! (неофициально)",
          },
          {
            mkd: "Не*ма на што!",
            pron: "нэ́ма_на_што",
            ru: "Не за что!",
          },
          {
            mkd: "И*звини / Изви*нете",
            pron: "изви́ни / изви́нэтэ",
            ru: "Извини / Извините",
          },
          {
            mkd: "Што у*баво!",
            pron: "што_у́баво",
            ru: "Как здорово!",
          },
        ],
      },
    },
  ],
};
