import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, поставив союзы <span>коj/коjшто</span> и/или <span>што</span> в нужную форму.`,
      ],

      content: {
        text: `<span>То*а е ме*стото, за, коj/ко*jшто, си*те ме прашу*ваат. — То*а е ме*стото за ко*е/ко*ешто си*те ме прашу*ваат. 
        То*а ме*стото, коj/ко*jшто/што, е на*jбиску до ра*jот. — То*а ме*стото кое/ко*ешто/што е на*jбиску до ра*jот.</span>`,
        sentences: [
          {
            mkd: `1. Апартма*нот, за, коj/ко*jшто, прашу*вате ве*ќе е и*знаjмен. — ___.`,
            answer: [
              `Апартманот за **коj / коjшто** прашувате веќе е изнаjмен`,
            ],
          },
          {
            mkd: `2. Са*кам да jа ви*дам дево*jката, коj/ко*jшто/што, ти се до*паѓа. — ___.`,
            answer: [
              `Сакам да jа видам девоjката, **коj / коjшто / што**, ти се допаѓа`,
            ],
          },
          {
            mkd: `3. Коле*гите се догава*раат со дире*кторот, коj/ко*jшто/што пра*ви нов план. — ___.`,
            answer: [
              `Колегите се догавараат со директорот, **коj / коjшто / што** прави нов план`,
            ],
          },
          {
            mkd: `4. Работни*ците дискути*раат со консулта*нтите, кон коj/ко*jшто, че*сто се обра*ќаат. — ___.`,
            answer: [
              `Работниците дискутираат со консултантите кон **коj / коjшто** често се обраќаат`,
            ],
          },
          {
            mkd: `5. Ме интереси*ра музе*jот, од, коj/ко*jшто, излегу*ваат ти*е лу*ѓе. — ___.`,
            answer: [
              `Ме интересира музеjот од **коj / коjшто** излегуваат тие луѓе`,
            ],
          },
          {
            mkd: `6. Не го па*метиш де*дото, коj/ко*jшто/што, се*когаш ни купу*ваше сла*долед? — ___`,
            answer: [
              `Не го паметиш дедото **коj / коjшто / што** секогаш ни купуваше сладолед?`,
            ],
          },
          {
            mkd: `7. Да*ли jа зна*еш дево*jката, каj, коj/ко*jшто, ќе о*диме на го*сти? — ___`,
            answer: [
              `Дали jа знаеш девоjката каj **коj / коjшто** ќе одиме на гости?`,
            ],
          },
        ],
      },
    },
  ],
};
