import { ExercisesProps } from "@/types";

export const exercise11: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 11",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>го</span>, <span>jа</span>, <span>ги</span>, если союзы <span>коj</span>, <span>коjшто</span>,
        <span>што</span> выступают в роли прямого объекта.`,
      ],

      content: {
        text: `<span>То*а е ме*стото ко*е/ко*ешто/што ______ обо*жавам. — То*а е ме*стото за ко*е/ко*ешто/што го 
        обо*жавам.</span>`,
        sentences: [
          {
            mkd: `1. Ми се до*паѓа апартма*нот коj/ко*jшто/што ___ и*знаjму*вате.`,
            answer: [`го`],
          },
          {
            mkd: `2. Са*кам да ги ви*дам студе*нтите ко*и/ко*ишто/што не о*дат на преда*вања.`,
            answer: [``],
          },
          {
            mkd: `3. Коле*гите се догава*раат со сметководите*лката ко*jа/ко*jашто/што са*ка да на*прави нов план.`,
            answer: [``],
          },
          {
            mkd: `4. Дискути*раме со профе*сорот коj/ко*jшто не ___ са*каш.`,
            answer: [`го`],
          },
          {
            mkd: `5. Ме интереси*ра де*тето ко*е/ко*ешто/што то*лку до*бро збо*рува а*нглиски.`,
            answer: [``],
          },
          {
            mkd: `6. Не jа чи*таше кни*гата за ко*jа/ко*jашто си*те збору*ваат?`,
            answer: [``],
          },
          {
            mkd: `7. Да*ли jа зна*еш дево*jката каj ко*jа/ко*jашто ќе о*диме на го*сти?`,
            answer: [``],
          },
        ],
      },
    },
  ],
};
