import { ExercisesProps } from "@/types";

export const exercise6: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 6",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Поставьте глаголы в скобках в форму имперфекта. Трансформируйте текст используя местоимения <span>jас</span>, <span>ни*е</span>,
        <span>ти*е</span>.
        
        (Подсказка: используйте кнопки ниже с местоимениями, чтобы переключать режимы <span>"Фи*лип", "jас", "ни*е", "ти*е"</span>. В центре
        показано текущее местоимение.)`,
      ],
      answerSet: {
        labels: ["Фи*лип", "jас", "ни*е", "ти*е"],
      },
      content: {
        sentences: [
          {
            mkd: `Ла*ни Фи*лип се*коj ден ___ (ста*нува) ра*но на*утро, ___ (се бри*чи), ___ (ми*е) ли*це и ра*це, ___ (се обле*кува) и 
            ___ (изле*гува) од до*ма.`,
            answer: [
              `стануваше/станував/станувавме/стануваа`,
              `бричеше/бричев/бричевме/бричеа`,
              `се облекуваше/се облекував/се облекувавме/се облекуваа`,
              `излегуваше/излегував/излегувавме/излегуваа`,
            ],
          },
          {
            mkd: `По пат за на*каj ра*бота ___ (ку*пува) ка*фе и го ___ (пи*е).`,
            answer: [
              `купуваше/купував/купувавме/купуваа`,
              `пиеше/пиев/пиевме/пиеjа`,
            ],
          },
          {
            mkd: `На ра*бота ___ (се поздра*вува) со коле*гите, го ___ (вклу*чува) сво*jот компjу*тер и jа ___ (прове*рува) службе*ната
            по*шта.`,
            answer: [
              `се поздравуваше/се поздравував/се поздравувавме/се поздравуваа`,
              `вклучуваше/вклучував/вклучувавме/вклучуваа`,
              `проверуваше/проверував/проверувавме/проверуваа`,
            ],
          },
          {
            mkd: `По*тоа ___ (се подго*твува) за сре*дбите и ___ (се сре*ќава) со клие*нтите.`,
            answer: [
              `се подготвуваше/се подготвував/се подготвувавме/се подготвуваа`,
              `се среќаваше/се среќавав/се среќававме/се среќаваа`,
            ],
          },
          {
            mkd: `По сре*дбите се*когаш ___ (се вра*ќа) на ра*бота ___ (jа*де) во ме*нза.`,
            answer: [
              `се враќаше/се враќав/се враќавме/се враќаа`,
              `jадеше/jадев/jадевме/jадеа`,
            ],
          },
          {
            mkd: `По ра*бота ___ (у*чи) а*нглиски jа*зик на ку*рс.`,
            answer: [`учеше/учев/учевме/учеа`],
          },
          {
            mkd: `На час ___ (чи*та) те*кстови, ги ___ (прераска*жува), ___ (одго*вара) на праша*њата на наста*вникот и ___ (слу*ша) 
            ау*диосни*мки на а*нглиски.`,
            answer: [
              `читаше/читав/читавме/читаа`,
              `прераскажуваше/прераскажував/прераскажувавме/прераскажуваа`,
              `одговараше/одговарав/одговаравме/одговараа`,
              `слушаше/слушав/слушавме/слушаа`,
            ],
          },
          {
            mkd: `По ча*сот ___ (се вра*ќа) до*ма, ___ (ве*чера), ___ (гле*да) телеви*зиjа и ___ (ле*гнува) да спи*е.`,
            answer: [
              `се враќаше/се враќав/се враќавме/се враќаа`,
              `вечераше/вечерав/вечеравме/вечераа`,
              `гледаше/гледав/гледавме/гледаа`,
              `легнуваше/легнував/легнувавме/легнуваа`,
            ],
          },
        ],
      },
    },
  ],
};
