import { ExercisesProps } from "@/types";

export const exercise14: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 14",
  slug: "lesson-8",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Это наша подруга, родителям которой мы часто помогаем. 2. Вы знаете наших друзей, на машине которых мы поедем? 
        3. Мне очень нравится писатель, книгу которого ты сейчас читаешь. 4. А где ребёнок, дедушка которого разговаривает с Горданой?`,
        answer: [
          `1. Тоа е другарка на на **чии / чиишто** родители често им помагаме. 2. Дали ги знаете нашите другари со **чиjа / чиаjшто**
          кола ќе одиме? 3. Многу ми се допаѓа писателот **чиjа / чиаjшто** книга сега jа читаш. 4. А каде е детето **чиj / чиjшто**
          дедо разговара со Гордана?`,
        ],
      },
    },
  ],
};
