import { ExercisesProps } from "@/types";

export const exercise5: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 5",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создајте реченици следејќи го примерот.`],

      content: {
        text: "<span>Ми*ле и Зо*ра тре*ба да ми се ја*ват. — Ми*ле и Зо*ра не*ка ми се ја*ват.</span>",
        sentences: [
          {
            mkd: `1. И*ван и На*таша тре*ба да пра*шаат не*кој ми*нувач. — ___.`,
            answer: [`Иван и Наташа нека прашаат некој минувач`],
          },
          {
            mkd: `2. Тво*ите дру*гари тре*ба да го пра*шаат каси*ерот. — ___.`,
            answer: [`Твоите другари нека го прашаат касиерот`],
          },
          {
            mkd: `3. И*ван тре*ба да му при*јде на во*зачот. — ___.`,
            answer: [`Иван нека му пријде на возачот`],
          },
          {
            mkd: `4. Те*а тре*ба не*што да ка*сне. — ___.`,
            answer: [`Теа нека касне нешто`],
          },
          {
            mkd: `5. Тво*ите дру*гари тре*ба да ни нара*чаат ка*фе. — ___.`,
            answer: [`Твоите другари нека ни нарачаат кафе`],
          },
          {
            mkd: `6. Дру*гар ти тре*ба да на*прави па*уза. — ___.`,
            answer: [`Другар ти нека направи пауза`],
          },
          {
            mkd: `7. Студе*нтите тре*ба да му се заблаго*дарат на профе*сорот. — ___.`,
            answer: [`Студентите нека му се заблагодарат на професорот`],
          },
          {
            mkd: `8. Де*чко ти тре*ба да стр*пи е*ден час. — ___.`,
            answer: [`Дечко ти нека стрпи еден час`],
          },
          {
            mkd: `9. Де*војка ти тре*ба пр*во да ти ра*скаже за то*а те*бе. — ___.`,
            answer: [`Девојка ти нека прво ти раскаже за тоа тебе`],
          },
          {
            mkd: `10. И*скра и Ли*лјана пр*во тре*ба да ни по*могнат на нас. — ___.`,
            answer: [`Искра и Лилјана нека ни помогнат на нас`],
          },
        ],
      },
    },
  ],
};
