import { ExercisesProps } from "@/types";

export const exercise4: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 4",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения, следуя образцу.`],

      content: {
        text: "<span>Не нерви*раj се. — Не*моj да се нерви*раш.</span>",
        sentences: [
          {
            mkd: `1. Не жале*ете се. — ___.`,
            answer: [`Немоjте да се жалите`],
          },
          {
            mkd: `2. Не се жа*ли. — ___.`,
            answer: [`Немоj да се жалиш`],
          },
          {
            mkd: `3. Не дава*j му jа мо*jата кни*га ни*кому. — ___.`,
            answer: [`Немоj да му jа даваш моjата книга никому`],
          },
          {
            mkd: `4. Не му го да*ваjте ку*ферот на ни*кого. — ___.`,
            answer: [`Немоjте да му го давате куферот на никого`],
          },
          {
            mkd: `5. Не jа пра*шуваj Ми*ла за ра*бота. — ___.`,
            answer: [`Немоj да jа прашуваш Мила за работа`],
          },
          {
            mkd: `6. Не пома*гаjте му на о*ва де*те. — ___.`,
            answer: [`Немоjте да му помагате на ова дете`],
          },
          {
            mkd: `7. Не вле*гуваj та*му. — ___.`,
            answer: [`Немоj да влегуваш таму`],
          },
          {
            mkd: `8. Не прани*раjте ни*што за неде*лата. — ___.`,
            answer: [`Немоjте да планирате ништо за неделата`],
          },
          {
            mkd: `9. Не ми нерви*раj. — ___.`,
            answer: [`Немоj да ме нервираш`],
          },
          {
            mkd: `10. Не пцу*jте. — ___.`,
            answer: [`Немоjте да пцуете`],
          },
        ],
      },
    },
  ],
};

// import { ExercisesProps } from "@/types";

// export const exercise4: ExercisesProps = {
//   type: "exercises",
//   title: "Упражнение 4",
//   slug: "lesson-8",
//   sections: [
//     {
//       type: "exercise-fill-in",
//       prompt: [`Создайте предложения, следуя образцу.`],

//       content: {
//         text: "<span>Не нерви*раj се. — Не*моj да се нерви*раш.</span>",
//         sentences: [
//           {
//             mkd: `1. Не жале*ете се. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `2. Не се жа*ли. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `3. Не дава*j му jа мо*jата кни*га ни*кому. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `4. Не му го да*ваjте ку*ферот на ни*кого. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `5. Не jа пра*шуваj Ми*ла за ра*бота. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `6. Не пома*гаjте му на о*ва де*те. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `7. Не вле*гуваj та*му. — ___.`,
//             answer: [``],
//           },

//           {
//             mkd: `8. Не прани*раjте ни*што за неде*лата. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `9. Не ми нерви*раj. — ___.`,
//             answer: [``],
//           },
//           {
//             mkd: `10. Не пцу*jте. — ___.`,
//             answer: [``],
//           },
//         ],
//       },
//     },
//   ],
// };
