import { ExercisesProps } from "@/types";

export const exercise15: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 15",
  slug: "lesson-8",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `— Иван, скажи, пожалуйста, как дойди до автовокзала? — Продолжай идти прямо, а потом поверни налево. Там будет 
        автовокзал. — А как нам купить билеты в Охрид? — Идите в кассу. Там спросите у кассира, в какое время отправляются автобусы в
        Охрид, и купите билеты. — Лучше купить билеты в одном направлении или туда и обратно? — Билеты туда и обратно стоят немного
        дешевле, чем два отдельных билета. — А что делать, если мы купим билет туда и обратно, а потом поймем, что хотим поехать в другой
        день? Мы сможем их поменять? — Нет, не сможете, поэтому тогда лучше купите билеты в одном направлении. — А как нам добраться от
        автовокзала в Охриде до дома Наума? — Позвоните Науму. Пусть он закажет вам такси. К сожалению, таксисты, которые ждут около
        автовокзала, обычно не хотят ехать по таксометру. — Спасибо!`,
        answer: [
          `— Иван, кажи, те молам, како да стигниме до Меѓуградската автобуска станица? — Продолжи право, а потоа сврни лево. Таму е 
          Меѓуградската автобуска станица. — А како да купиме билети за Охрид? — Одете на касата. Таму ќе го прашате кариерот во колку
          тргнуваат автобусите на Охрид и ќе купите билети. — Подобро е да купиме повратни билети или во еден правец? — Повторни билети
          чинат малку поевтино отколку два билета во еден правец. — А што да правиме ако купиме повторни билети, а потоа разбереме дека
          сакаме да одиме друг ден? Ќе можели да ги смениме? — Не, нема да можете затоа подобро тогаш купите билети во еден правец. — А
          како да стигнеме од Меѓуградската автобуска станица до куќата на Наум? Нека ви **нарача / викне** такси. За жал таксистите
          **кои / коишто / што** чекаат каj Меѓуградската автобуска станица обично не сакаат да одат по таксиметар. — Фала!`,
        ],
      },
    },
  ],
};
