import { ExercisesProps } from "@/types";

export const exercise3: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 3",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения, следуя образцу.`],

      content: {
        text: "<span>Тре*ба да ми се jа*вите. — Jавете* ми се.</span>",
        sentences: [
          {
            mkd: `1. Тре*ба да одго*вориш бр*зо. — ___.`,
            answer: [`Одговори брзо`],
          },
          {
            mkd: `2. Тре*ба да одгово*рите бр*зо. — ___.`,
            answer: [`Одговорете брзо`],
          },
          {
            mkd: `3. Тре*ба да ни на*рачаш та*кси. — ___.`,
            answer: [`Нарачаj ни такси`],
          },
          {
            mkd: `4. Тре*ба да ни нара*чате та*кси. — ___.`,
            answer: [`Нарачаjте ни такси`],
          },
          {
            mkd: `5. Тре*ба да живе*ете каj нас. — ___.`,
            answer: [`Живеjте каj нас`],
          },
          {
            mkd: `6. Тре*ба да жи*вееш каj нас. — ___.`,
            answer: [`Живеj каj нас`],
          },
          {
            mkd: `7. Тре*ба да ме запозна*ете со ва*шите роди*тели. — ___.`,
            answer: [`Запознаjте ме со вашите родители`],
          },

          {
            mkd: `8. Тре*ба да ме запо*знаеш со тво*ите роди*тели. — ___.`,
            answer: [`Запознаj ме со твоите родители`],
          },
          {
            mkd: `9. Тре*ба да по*брзаш. — ___.`,
            answer: [`Побрзаj`],
          },
          {
            mkd: `10. Тре*ба да побр*зате. — ___.`,
            answer: [`Побрзаjте`],
          },
          {
            mkd: `11. Тре*ба да ѝ помо*гнете на ма*jка ви. — ___.`,
            answer: [`Помогнете ѝ на мајка ви`],
          },
          {
            mkd: `12. Тре*ба да ѝ по*могнеш на ма*jка ти. — ___.`,
            answer: [`Помогни ѝ на мајка ти`],
          },
          {
            mkd: `13. Тре*ба да се о*блечеш. — ___.`,
            answer: [`Облечи се`],
          },
          {
            mkd: `14. Тре*ба да се обле*чете. — ___.`,
            answer: [`Облечете се`],
          },

          {
            mkd: `15. Тре*ба да им за*браниш на де*цата да ше*таат са*ми. — ___.`,
            answer: [`Забрани им на децата да шетаат сами`],
          },
          {
            mkd: `16. Тре*ба да им забра*ните на де*цата да ше*таат са*ми. — ___.`,
            answer: [`Забранете им на децата да шетаат сами`],
          },
          {
            mkd: `17. Тре*ба да ги и*змиеш садо*вите. — ___.`,
            answer: [`Измиj ги садовите`],
          },
          {
            mkd: `18. Тре*ба да ги изми*ете садо*вите. — ___.`,
            answer: [`Измиjте ги садовите`],
          },
          {
            mkd: `19. Не тре*ба да се пла*шите од во*дата. — ___.`,
            answer: [`**Не плашете се / Не се плашете** од водата`],
          },
          {
            mkd: `20. Не тре*ба да се пла*шиш од во*дата. — ___.`,
            answer: [`**Не плаши се / Не се плаши** од водата`],
          },
        ],
      },
    },
  ],
};
