import { ExercisesProps } from "@/types";

export const exercise8: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 8",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения, соединив части предложения.`],

      content: {
        text: "<span>Не знам, за, што, пра*шуваш. — Не знам за што пра*шуваш.</span>",
        sentences: [
          {
            mkd: `1. Разми*слував, за, што, си*те збору*ваат. — ___.`,
            answer: [`Размислував за што сите зборуваат`],
          },
          {
            mkd: `2. Са*кам да ви*дам, со, што, се зани*мава син ми. — ___.`,
            answer: [`Сакам да видам со што се занимава син ми`],
          },
          {
            mkd: `3. Коле*гите се догава*раат, про*тив, што, да гла*саат. — ___.`,
            answer: [`Колегите се догавараат против што да гласаат`],
          },
          {
            mkd: `4. Работни*ците дискути*раат, кон, коj, да се со*гласат. — ___.`,
            answer: [`Работниците дискутираат со што да се согласат`],
          },
          {
            mkd: `5. Ме интереси*ра, од, што, то*а за*виси. — ___.`,
            answer: [`Ме интересира од што тоа зависи`],
          },
          {
            mkd: `6. Не па*метиш, по*ради, што, то*а го пра*веше? — ___.`,
            answer: [`Не паметиш поради што тоа го правеше?`],
          },
          {
            mkd: `7. Студи*ите тра*ат е*дна го*дина, при, што, наста*вата се изве*дува од професо*рите на Маши*нскиот факулте*т. — ___.`,
            answer: [
              `Студиите траат една година при што наставата се изведува од професорите на Машинскиот факултет`,
            ],
          },
        ],
      },
    },
  ],
};
