import { ExercisesProps } from "@/types";

export const exercise12: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 12",
  slug: "lesson-8",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Это книги, которые мне нужны. 2. Это кники, о которых мы говорили. 3. Это книги, которые я хочу купить. 4. Мне 
        нравится девушка, которая работает вместе с тобой. 5. Мне нравится девушка, с которой ты работаешь. 6. Мне нравится девушка,
        которую я часто вижу в библиотеке.`,
        answer: [
          `1. Тоа се книгите **кои / коишто / што** ми требаат. 2. Тоа се книгите за **кои / коишто** зборувавме. 3. Тоа се книгите 
          **кои / коишто / што** сакам да ги купам. 4. Ми се допаѓа девоjката **коjа / коjашто / што** работи заедно со тебе. 5. Ми
          се допаѓа девоjката мо **коjа / коjашто** работиш. 6. Ми се допаѓа девоjката **коjа / коjашто / што** често jа гледам во
          библиотеката.`,
        ],
      },
    },
  ],
};
