import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Вставьте частицы <span>му</span>, <span>ѝ</span>, <span>им</span>.`,
      ],
      content: {
        sentences: [
          {
            mkd: `1. Ко*му са*каш да ___ се заблаго*дариш?`,
            answer: [`му`],
          },
          {
            mkd: `2. На ко*го са*кате да ___ се заблаго*дарите?`,
            answer: [`му`],
          },
          {
            mkd: `3. И*вана мно*гу ___ се до*паѓа на Зо*ран.`,
            answer: [`му`],
          },
          {
            mkd: `4. На И*вана мно*гу ___ се до*паѓа Зо*ран.`,
            answer: [`ѝ`],
          },
          {
            mkd: `5. Ма*jка ___ забра*нува на де*цата да пли*ваат са*ми.`,
            answer: [`им`],
          },
          {
            mkd: `6. Ми*слам де*ка полици*jата ќе ___ jа зе*ме воза*чката до*звола на брат ти.`,
            answer: [`му`],
          },
          {
            mkd: `7. На*шите роди*тели са*каат да ___ го и*знаjмат апартма*нот на На*таша и И*ван.`,
            answer: [`им`],
          },
          {
            mkd: `8. И*рена ___ се jа*вува не*кому.`,
            answer: [`му`],
          },
          {
            mkd: `9. Не мо*жеш да ___ по*могнеш на си*те.`,
            answer: [`им`],
          },
          {
            mkd: `10. На ма*jка ми ___ се jа*де.`,
            answer: [`ѝ`],
          },
          {
            mkd: `11. Зо*што ___ да*ваш па*ри на о*ваа организа*циjа?`,
            answer: [`ѝ`],
          },
          {
            mkd: `12. На ни*кого не ___ се ра*боти.`,
            answer: [`му`],
          },
          {
            mkd: `13. На се*стра ми се*когаш ___ е то*пло, а ме*не е ла*дно.`,
            answer: [`ѝ`],
          },
        ],
      },
    },
  ],
};
