import { ExercisesProps } from "@/types";

export const exercise13: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 13",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [`Создайте предложения, соединив два предложения в одно.`],

      content: {
        text: `<span>Че*сто ги гле*даме о*вие де*ца. Та*ткото на о*вие де*ца ра*боти ту*ка. — Че*сто ги гле*даме о*вие де*ца чиj/чиjшто
           та*ткото ра*боти ту*ка.</span>`,
        sentences: [
          {
            mkd: `1. Го прашу*ваме коле*гата. Ќе*рката на коле*гата жи*вее во Па*риз. ___`,
            answer: [
              `Го прашуваме колегата **чиjа / чиjашто** ќерка живее во Париз.`,
            ],
          },
          {
            mkd: `2. Де*неска ќе се сре*тнеме со о*воj по*знат пи*сател. Кни*гите на о*воj по*знат пи*сател ги чи*та це*лата др*жава. ___`,
            answer: [
              `Денеска ќе се сретнеме со овоj познат писател **чии / чиишто** книги ги чита целата држава.`,
            ],
          },
          {
            mkd: `3. Са*кам да им се заблаго*дарам на мо*ите дру*гари. Во ку*ќата на мо*ите дру*гари живе*еме во Бу*курешт. ___`,
            answer: [
              `Сакам да им се заблагодарам на моите другари во **чиjа / чиjашто** куќа живееме во Букурешт.`,
            ],
          },
          {
            mkd: `4. Наста*вникот са*ка да се сре*тне со о*вие роди*тели. Ги у*чи де*цата на о*вие роди*тели. ___`,
            answer: [
              `Наставникот сака да се сретне со овие родители **чии / чиишто** децата учи.`,
            ],
          },
        ],
      },
    },
  ],
};
