import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-8",
  sections: [
    {
      type: "exercise-fill-in",
      prompt: [
        `Создайте предложения, поставив союз <span>коj</span> в нужную форму.`,
      ],

      content: {
        text: "<span>Не знам, за, коj, пра*шуваш. — Не знам за ко*го пра*шуваш.</span>",
        sentences: [
          {
            mkd: `1. Разми*слував, за, коj, си*те збору*ваат. — ___.`,
            answer: [`Размислував за кого сите зборуваат`],
          },
          {
            mkd: `2. Са*кам да ви*дам, со, коj, се сре*трува син ми. — ___.`,
            answer: [`Сакам да видам со кого се сретнува син ми`],
          },
          {
            mkd: `3. Коле*гите се догава*раат, про*тив, коj, да гла*саат. — ___.`,
            answer: [`Колегите се догавараат против кого да гласаат`],
          },
          {
            mkd: `4. Работни*ците дискути*раат, кон, коj, да се о*братат. — ___.`,
            answer: [`Работниците дискутираат кон кого да се обратат`],
          },
          {
            mkd: `5. Ме интереси*ра, од, коj, то*а го слу*шнавте. — ___.`,
            answer: [`Ме интересира од кого тоа го слушнавте`],
          },
          {
            mkd: `6. Не па*метиш, за*ради, коj, то*а го пра*веше? — ___.`,
            answer: [`Не паметиш заради кого тоа го правеше?`],
          },
          {
            mkd: `7. Прани*раме, каj, коj, да оти*дете на го*сти. — ___.`,
            answer: [`Планираме каj кого да отидеме на гости`],
          },
        ],
      },
    },
  ],
};
