import { ExercisesProps } from "@/types";

export const exercise2: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 2",
  slug: "lesson-8",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Кому ты рассказываешь о Киеве? — Я рассказываю сёстрам. 2. Раньше я часто рассказывал сёстрам о Киеве. — Кому ты 
        рассказывал? — Сёстрам. 3. Послезавтра я расскажу сёстрам о Киеве. 4. Я ничего не буду рассказывать сёстрам. 5. Если ты расскажешь
        сёстрам о Киеве, им понравится. 6. Ты должен рассказать сёстрам о Киеве. 7. Почему ты не хочешь рассказать сёстрам о Киеве? 8. Кому
        ты хочешь рассказать о Киеве? — Сёстрам. 9. Я хочу, чтобы ты рассказал моим сёстрам о Киеве. 10. Я хочу, чтобы мой друг рассказал
        своим сёстрам о Киеве. 11. Кому вы пишете? — Мы пишем Анастасии и Николе. 12. Раньше мы часто писали письма Анастасии и Николе. —
        Кому вы писали? — Анастасии и Николе. 13. В июле мы часто будем писать Анастасии и Николе. 14. Мы не будем писать об этом Анастасии
        и Николе. 15. Мы напишем Анастасии и Николе послезавтра. 16. Мы должны написать Анастасии и  Николе. 17. Мы хотим написать письмо
        Анастасии и Николе. — Кому вы хотите написать? — Анастасии и Николе. 18. Мы хотим, чтобы наши друзья написали об этих апартаментах
        Анастасии и Николе. 19. Моей сестре хочеться спать. 20. Ирене холодно. 21. Мне жарко. 22. Никому не хочется работать. 23. Дарко
        кому-то звонит.`,
        answer: [
          `1. На **кого / кому** му раскажуваш за Киев? — Им раскажувам на сестрите. 2. Порано често им раскажував на сестрите за
          Киев. — На **кого / кому** му раскажуваше? — На сестрите. 3. Задутре ќе им раскажам на сестрите за Киев. 4. Ништо нема да
          им раскажувам на сестрите. 5. Ако им раскажеш на сестрите за Киев, ќе им се допадне. 6. Треба да им раскажеш на сестрите за
          Киев. 7. Зошто не сакаш да им раскажеш на сестрите за Киев? 8. На **кого / кому** сакаш да му раскажеш за Киев? — На
          сестрите. 9. Сакам да им раскажеш на сестрите за Киев. 10. Сакам другар ми да им раскаже на сестрите за Киев. 11. На
          **кого / кому** му пишувате? — Им пишуваме  на Анастасиjа и (на) Никола. — На **кого / кому** му пишувавте? — На
          Анастасиjа и (на) Никола. 13. Во jули често ќе им пишуваме на Анастасиjа и (на) Никола. 14. Нема да им пишуваме за тоа на
          Анастасиjа и (на) Никола. 15. Ќе им напишеме на Анастасиjа и (на) Никола утре. 16. Треба да им пишеме на Анастасиjа и (на)
          Никола. 17. Сакаме да им напишеме на Анастасиjа и (на) Никола. — На **кого / кому** сакате да му напишете? — Анастасиjа и
          (на) Никола. 18. Сакаме вашите другари да им напишат на Анастасиjа и (на) Никола за овоj апартман. 19. На сестра ми ѝ се спие.
          20. На Ирена ѝ е ладно. 21. Топло ми е. 22. На **никого / никому** не му се работи. 23. Дарко му се јавува
          **некому. / на некого.**`,
        ],
      },
    },
  ],
};
