import { PayAttentionBlockProps } from "@/types/payAttantionTypes";

export const payAttention2: PayAttentionBlockProps = {
  sections: [
    {
      type: "pay-attention-2",
      slug: "lesson-4",
      title: "ОБРАТИТЕ ВНИМАНИЕ!",
      content: {
        text: `В предложениях типа «завтра мы поедем...» в македонском обычно употребляется глагол не совершённого вида <span>о\u0301ди:
        у\u0301тре ќе о\u0301диме...</span> для выражения начала движения можно использовать глагол <span>тр\u0301гне</span> «двинуться, отправиться»:
        <span>ќе тр\u0301гнеме во 6 ча\u0301сот</span> мы отправимся в 6 часов.
        
        Междомение <span>ле\u0301ле</span> «ох, ах, ой» может выражать самые разные эмоции в зависимости от интонации — удивление, восхищение,
        стах, осуждение и т.д.
        
        Прилогательное <span>свет</span> «святой» с именами святых мужского пола имеет форму <span>све\u0301ти: све\u0301ти Дими\u0301триjа</span>
        «святой Дмитрий».
        `.trim(),
      },
    },
  ],
};
