import { PayAttentionBlockProps } from "@/types";

export const payAttention2: PayAttentionBlockProps = {
  sections: [
    {
      type: "pay-attention-2",
      slug: "lesson-4",
      title: "ОБРАТИТЕ ВНИМАНИЕ!",
      content: {
        text: `В предложениях типа «завтра мы поедем...» в македонском обычно употребляется глагол не совершённого вида <span>о*ди:
        у*тре ќе о*диме...</span> для выражения начала движения можно использовать глагол <span>тр*гне</span> «двинуться, отправиться»:
        <span>ќе тр*гнеме во 6 ча*сот</span> мы отправимся в 6 часов.
        
        Междомение <span>ле*ле</span> «ох, ах, ой» может выражать самые разные эмоции в зависимости от интонации — удивление, восхищение,
        стах, осуждение и т.д.
        
        Прилогательное <span>свет</span> «святой» с именами святых мужского пола имеет форму <span>све*ти: све*ти Дими*триjа</span> «святой Дмитрий».
        `.trim(),
      },
    },
  ],
};
