import { ParagraphSectionsProps } from "@/types";

export const formsOfRetelling: ParagraphSectionsProps = {
  type: "forms-of-retelling",
  slug: "lesson-13",
  content: {
    text: `Пересказывательные формы употребляются при повествовании о различных исторических событиях. Для того чтобы избежать употребления 
    форм пересказа, часто используется настоящее историческое. При рассказе о событиях недавнего прошлого могут использоваться аорист и
    имперфект, если говорящий/пишущий уверен в том, что события действительно произошли (встречается, например, в газетах).`,
  },
};
