import { TablesProps } from "@/types";

export const example10: TablesProps = {
  slug: "lesson-11",
  type: "example-10",

  content: {
    text: `Интервал часто задаётся предлогами <span>од... до</span> или предлогом <span>за</span>:`,
    words: [
      {
        mkd: "Ра*ботам од о*сум до два (ча*сот).",
        ru: "Я работаю с восьми до двух.",
      },
      {
        mkd: "Го пре*веде те*кстот за два ча*са.",
        ru: "Он перевёл текст за два часа.",
      },
      {
        mkd: "За вре*ме на о*дмор о*слабнав.",
        ru: "Во время отпуска я похудел.",
      },
    ],
  },
};
