import { TablesProps } from "@/types";

export const example2: TablesProps = {
  slug: "lesson-11",
  type: "example-2",

  content: {
    text: `Когда речь идёт о конкретных днях и ночах, обычно используются выражения <span>пре*ку ден</span> «днём» и <span>во но*ќва</span> 
    «этой ночью», <span>во но*ќва</span> «той ночью». Когда же имеется в виду, что что-то происходит в дневное или ночное время, то
    употребляются наречия <span>но*ќе</span> и <span>де*ње</span>`,
    words: [
      {
        mkd: "на изгре*jсонце",
        ru: "во время восхода солнца",
      },
      {
        mkd: "на пла*дне",
        ru: "в полдень",
      },
      {
        mkd: "на заjди*сонце",
        ru: "на закате",
      },
      {
        mkd: "в по*лноќ",
        ru: "в полночь",
      },
      {
        mkd: "во три ча*сот по по*лноќ",
        ru: "в три часа ночи",
      },
    ],
  },
};
