import { TablesProps } from "@/types";

export const example7: TablesProps = {
  slug: "lesson-11",
  type: "example-7",

  content: {
    text: `Слово <span>не*дела</span> часто употребляется без предлога с определёнными определениями типа <span>о*воj</span>,
    <span>тоj</span>, <span>о*ноj</span>, <span>наре*дниот</span> и т.д.:`,
    words: [
      {
        mkd: "Ќе до*jдам нере*дната не*дела.",
        ru: "Я приеду на следующей неделе.",
      },
      {
        mkd: "Коj да*тум сме де*нес?",
        ru: "Какое сегодня число?",
      },
      {
        mkd: "Де*нес е пр*ви маj.",
        ru: "Сегодня первое мая.",
      },
      {
        mkd: "Ку*пив би*лет за пр*ви маj.",
        ru: "Я купил билет на первое мая.",
      },
      {
        mkd: "Се ро*див на пр*ви маj и*лjада деветсто*тини осу*мдесет и пр*ва го*дина.",
        ru: "Я родился первого мая тысяча деятьсот восемьдесят первого года.",
      },
      {
        mkd: "Се ро*див во маj.",
        ru: "Я родился в мае.",
      },
      {
        mkd: "Се ро*див во и*лjада деветсто*тини осу*мдесет и пр*ва го*дина.",
        ru: "Я родился в тысяча деятьсот восемьдесят первом году.",
      },
    ],
  },
};
