import { TablesProps } from "@/types";

export const example12: TablesProps = {
  slug: "lesson-11",
  type: "example-12",

  content: {
    text: `Следование обычно задаётся предлогами <span>по</span> (следование в прошлом и будущем), <span>за</span> (следование только в 
    будущем) или союзом <span>о*ткако</span>:`,
    words: [
      {
        mkd: "Ќе до*jдам за е*дна не*дела.",
        ru: "Я приеду через неделю.",
      },
      {
        mkd: "До*jдов по два де*на.",
        ru: "Я приехал два дня спустя.",
      },
      {
        mkd: "По пла*жата се истуши*рав.",
        ru: "После пляжа я принял душ.",
      },
      {
        mkd: "До*jдов е*дна не*дела по по*гребот.",
        ru: "Я приехал через неделю после похорон.",
      },
      {
        mkd: "О*ткако за*минав Ма*jа да*де о*тказ.",
        ru: "После того как я уехал, Майя уволилась.",
      },
    ],
  },
};
