import { TablesProps } from "@/types";

export const example5: TablesProps = {
  slug: "lesson-11",
  type: "example-5",

  content: {
    text: `Слово <span>дено*виве</span> употребляется в значении «на днях»:`,
    words: [
      {
        mkd: "Ќе до*jдам дено*виве.",
        ru: "Я приеду на днях.",
      },
      {
        mkd: "Коj ден од неде*ла е де*нес?",
        ru: "Какой сегодня день недели?",
      },
      {
        mkd: "Де*нес е сре*да.",
        ru: "Сегодня среда.",
      },
      {
        mkd: "Бев до*ма в сре*дата.",
        ru: "Я был дома в прошлую среду.",
      },
      {
        mkd: "Бев до*ма мина*тата сре*да.",
        ru: "Я был дома в прошлую среду.",
      },
      {
        mkd: "Ќе до*jдам в сре*да.",
        ru: "Я приеду в следующую среду.",
      },
      {
        mkd: "Ќе до*jдам наре*дната сре*да.",
        ru: "Я приеду в следующую среду.",
      },
    ],
  },
};
