import { TablesProps } from "@/types";

export const example1: TablesProps = {
  slug: "lesson-11",
  type: "example-1",
  title: {
    ru: "ГРАММАТИКА",
    mkd: "ГРАМАТИКА",
  },
  subtitle: "ВЫРАЖЕНИЕ ВРЕМЕННЫХ ОТНОШЕНИЙ",
  content: {
    text: `Рассмотрим основные средства выражения временных отношений в македонском языке.`,
    words: [
      {
        mkd: "Ко*лку е ча*сот?",
        ru: "Который час?",
      },
      {
        mkd: "Се*га е де*вет и поло*вина (ча*сот).",
        ru: "Сейчас половина десятого.",
      },
      {
        mkd: "Се*га е де*вет до де*вет (ча*сот).",
        ru: "Сейчас без десяти девять.",
      },
      {
        mkd: "Се*га е де*вет (ча*сот) и пет ми*нути.",
        ru: "Сейчас пять минут десятого.",
      },
      {
        mkd: "Во ко*лку (ча*сот) ќе до*jдеш?",
        ru: "В котором часу ты приедешь?",
      },
      {
        mkd: "Ќе до*jдам во де*вет и поло*вина (ча*сот).",
        ru: "Я приеду в половине десятого.",
      },
      {
        mkd: "Ќе до*jдам во де*сет до де*вет (ча*сот).",
        ru: "Я приеду без десяти девять.",
      },
      {
        mkd: "Ќе до*jдам во де*вет (ча*сот) и пет ми*нути.",
        ru: "Я приеду в пять минут десятого.",
      },
      {
        mkd: "Ќе до*jдам на*утро или на*вечер.",
        ru: "Я приеду утром или вечером..",
      },
      {
        mkd: "Ќе до*jдам пре*ку ден.",
        ru: "Я приеду днём.",
      },
      {
        mkd: "Де*ње спи*е, но*ќе ра*боти.",
        ru: "Днём спит, ночью работает.",
      },
    ],
  },
};
