import { TablesProps } from "@/types";

export const futureInThePast: TablesProps = {
  type: `grammar-future-in-the-past-table`,
  slug: "lesson-14",
  text: `Будущее в прошедшем образуется при помощи показателя будущего времени <span>ќе</span> и формы имперфекта (от глаголов
  совершенного и несовершенного вида).`,
  content: {
    subtitle: [" ", "пра*ви", "на*прави"],
    rows: [
      {
        person: "јас",
        forms: ["ќе-пра*ве-в", "ќе-на*праве-в"],
      },
      {
        person: "ти",
        forms: ["ќе-пра*ве-ше", "ќе-напра*ве-ше"],
      },
      {
        person: "тој, та*а, то*а",
        forms: ["ќе-пра*ве-ше", "ќе-напра*ве-ше"],
      },
      {
        person: "ни*е",
        forms: ["ќе-пра*ве-вме", "ќе-напра*ве-вме"],
      },
      {
        person: "ви*е",
        forms: ["ќе-пра*ве-вте", "ќе-напра*ве-вте"],
      },
      {
        person: "ти*е",
        forms: ["ќе-пра*ве-а", "ќе-напра*ве-а"],
      },
    ],
  },
};
