import { DialogueBlockProps } from "@/types";

export const dialogueBlock: DialogueBlockProps = {
  slug: `lesson-6`,
  sections: [
    {
      type: "lecture",
      subtitle: {
        ru: "ДИАЛОГ",
        mkd: "ДИЈАЛОГ",
      },
      content: {
        description: {
          mkd: `На*таша и И*ван дискути*раат ка*ко да сти*гнат до О*хрид.`,
          ru: `Наташа и Иван обсуждают, как добраться до Охрида.`,
        },
        dialogue: [
          {
            speaker: {
              id: `ivan`,
              mkd: `И*ван:`,
              ru: `Иван:`,
            },
            mkd: [
              `Мно*гу са*кам да па*тувам со воз. Да*ли и*ма воз од Ско*пjе до О*хрид?`,
              `То*гаш ка*ко ќе о*диме?`,
              `А*jде да ви*диме на и*нтернет ка*кви се усло*вите за изнаjму*вање.`,
              `Ми се до*паѓа о*ваа ко*ла со две вра*ти. Ма*ла е, не тро*ши мно*гу го*риво и за неа и*ма по*пуст о*ва не*дела. А да*ли мо*же да
              jа поди*гнеме ко*лата во Ско*пjе и да jа преда*деме во О*хрид? Не*маме ка*де да jа парки*раме.`,
              `Ле*ле, са*мо што ра*збрав де*ка мо*jата во*зачка е во Варшава.`,
            ],
            ru: [
              `Я очень люблю путешествовать на поезде. Есть ли поезд из Скопье в Охрид?`,
              `Тогда как мы поедем?`,
              `Давай посмотрим в Интернете, каковы условия проката.`,
              `Мне нравится вот эта машина с двумя дверями. Она маленькая, расходует немного топлива, и на неё есть скидка на этой неделе. А мы
              можем получить машину в Скопье и сдать её в Охриде? Нам негде её парковать.`,
              `Ой, я только что понял, что моё водительское удостоверение в Варшаве.`,
            ],
          },
          {
            speaker: {
              id: `natasha`,
              mkd: `На*таша:`,
              ru: `Наташа:`,
            },
            mkd: [
              `Не, не*ма, а и не ти препора*чувам да се во*зиш со воз во Македо*ниjа. Возо*вите се мно*гу ста*ри и не се бе*збедни.`,
              `Мо*же да ку*пиме по*вратни би*лети на Меѓугра*дската авто*буска ста*ница и да о*диме со а*втобус, мо*же да изна*jмиме ко*ла.`,
              `О*ва е до*бра фи*рма, и*маат лице*нца, си*те нео*пходни докуме*нти и до*бра и*нтернет-ста*ница. Изнаjму*ваат ко*ли од си*те
              кла*си (еконо*мик, ко*мпакт, ста*ндард, џип, ми*ниван, ко*мбе, лимузи*на), на ди*зел и бе*нзин, со авто*матски и мануе*лен
              ме*нувач на бр*зини.
              
              Си*те се опре*мени со кли*ма-у*ред, CD пле*ер и USB-по*лнач за телефо*ни и, се*како, со во*здушна пе*рница, ре*зервно тр*кало,
              противпо*жарен апара*т за га*сење по*жар, сигу*рносен триа*голник, ку*тиjа за пр*ва по*мош и са*jла. Ко*лите се но*ви, се*коj
              ме*сец помину*ваат те*хнички пре*глед. До*стапна е деноно*ќна те*хничка по*мош.
              
              Километра*жата е неограни*чена. Во це*ната се вклу*чени зе*лен ка*ртон, осигуру*вање на вози*лото и патни*ците, и осигуру*вање
              од тре*то ли*це.
              
              Це*ните се прика*жани со влу*чен ДДВ. Во*зачот тре*ба да и*ма од 25 до 75 го*дини, ва*жечка меѓуна*родна или маке*донска
              во*зачка до*звола, ли*чна ка*рта или па*сош.`,
              `Ту*ка не пи*шува, тре*ба да се jавиме и да пра*шаме.`,
              `То*гаш ни*што, ќе о*диме со а*втобус.`,
            ],
            ru: [
              `Нет, и я не советую тебе ездить на поезде в Македонии. Поезда очень старые и небезопасные.`,
              `Мы можем купить билеты туда и обратно на междугороднем автовокзале и поехать на автобусе, можем взять напрокат машину.`,
              `Это хорошая фирма, у них есть лицензия, все необходимые документы и хорошая веб-сайт. Они сдают в прокат машины всех классов
              (эконом, компакт, стандарт, джип, минивэн, микроавтобус, лимузин), на дизеле и на бензине, с автоматической и ручной коробками
              передач.
              
              Все машины оборудованы кондиционером, CD-плеером, USB-зарядкой для телефонов и, конечно же, подушкой безопасности, запасным
              колесом, огнетушителем, светоотражающим треугольником, аптечкой и тросом. Машины новые, каждый месяц проходят техосмотр.
              
              Километраж неограничен. В цену входит страхование для поездки за границу, стаховка транспортного средства и пассажиров, страхование
              гражданской ответственности.
              
              Цены указаны с НДС. Водителю должно быть от 25 до 75 лет, он должен иметь действующее международное водительское удостоверение,
              личную карту или загранпаспорт.`,
              `Тут не написано, нужно позвонить и спросить.`,
              `Тогда ничего не поделаешь, поедем на автобусе.`,
            ],
          },
        ],
        dialogueOrder: [
          { speakerId: "ivan", language: "ru", replyIndex: 0 },
          { speakerId: "ivan", language: "mkd", replyIndex: 0 },
          { speakerId: "natasha", language: "ru", replyIndex: 0 },
          { speakerId: "natasha", language: "mkd", replyIndex: 0 },
          { speakerId: "ivan", language: "ru", replyIndex: 1 },
          { speakerId: "ivan", language: "mkd", replyIndex: 1 },
          { speakerId: "natasha", language: "ru", replyIndex: 1 },
          { speakerId: "natasha", language: "mkd", replyIndex: 1 },
          { speakerId: "ivan", language: "ru", replyIndex: 2 },
          { speakerId: "ivan", language: "mkd", replyIndex: 2 },
          { speakerId: "natasha", language: "ru", replyIndex: 2 },
          { speakerId: "natasha", language: "mkd", replyIndex: 2 },
          { speakerId: "ivan", language: "ru", replyIndex: 3 },
          { speakerId: "ivan", language: "mkd", replyIndex: 3 },
          { speakerId: "natasha", language: "ru", replyIndex: 3 },
          { speakerId: "natasha", language: "mkd", replyIndex: 3 },
          { speakerId: "ivan", language: "ru", replyIndex: 4 },
          { speakerId: "ivan", language: "mkd", replyIndex: 4 },
          { speakerId: "natasha", language: "ru", replyIndex: 4 },
          { speakerId: "natasha", language: "mkd", replyIndex: 4 },
          { speakerId: "ivan", language: "ru", replyIndex: 5 },
          { speakerId: "ivan", language: "mkd", replyIndex: 5 },
          { speakerId: "natasha", language: "ru", replyIndex: 5 },
          { speakerId: "natasha", language: "mkd", replyIndex: 5 },
        ],
      },
    },
  ],
};
