import { VocabularyData } from "@/types";

export const vocabulary: VocabularyData = {
  type: "vocabulary",
  title: {
    ru: `НОВЫЕ СЛОВА И ВЫРАЖЕНИЯ`,
    mkd: `<span>НОВИ ЗБОРОВИ И ИЗРАЗИ</span>`,
  },
  slug: "lesson-9",
  sections: [
    {
      type: "vocabulary",
      content: {
        subtitle: [`Македонский язык`, `Произношение`, `Русский язык`],
        words: [
          { mkd: "а*гол", pron: "а*гол", ru: "угол" },
          { mkd: "а*кциjа", pron: "а*кцийа", ru: "акция, мероприятие" },
          { mkd: "банкома*т", pron: "банкомат", ru: "банкомат" },
          { mkd: "ба*ра", pron: "ба*ра", ru: "искать, требовать" },
          { mkd: "бо*jа", pron: "бо*йа", ru: "цвет" },
          {
            mkd: "гардеро*ба",
            pron: "гардэро*ба",
            ru: "гардероб, примерочная",
          },
          {
            mkd: "доне*сува",
            pron: "донэ*сува",
            ru: "приносить, привозить, приводить",
          },
          {
            mkd: "до*несе",
            pron: "до*нэсэ",
            ru: "принести, привезти, привести",
          },
          { mkd: "ки*не", pron: "ки*нэ", ru: "рвать, отрывать" },
          {
            mkd: "ко*рзо",
            pron: "ко*рзо",
            ru: "место вечернего городского гуляния",
          },
          { mkd: "кр*ши", pron: "кр*ши", ru: "ломать" },
          { mkd: "ку*сур", pron: "ку*сур", ru: "сдача" },
          { mkd: "но*си", pron: "но*си", ru: "носить, возить, водить" },
          { mkd: "о*ко (о*чи)", pron: "о*ко (о*чи)", ru: "глаз (глаза)" },
          {
            mkd: "о*тсто",
            pron: "о*тсто",
            ru: "проценты (при указании процентов)",
          },
          { mkd: "о*чила", pron: "о*чила", ru: "очки" },
          { mkd: "пла*нина", pron: "пла*нина", ru: "гора" },
          { mkd: "ра*сипе", pron: "ра*сипэ", ru: "испортить" },
          { mkd: "раси*пува", pron: "раси*пува", ru: "портить" },
          { mkd: "се*едно", pron: "сэ*эдно", ru: "всё равно" },
          { mkd: "си*н", pron: "си*н", ru: "голубой, синий" },
          { mkd: "ски*нат", pron: "ски*нат", ru: "порванный, оторванный" },
          { mkd: "ски*не", pron: "ски*нэ", ru: "порвать, оторвать" },
          { mkd: "скр*ши", pron: "скр*ши", ru: "сломать" },
          { mkd: "со*нце", pron: "со*нцэ", ru: "солнце" },
          { mkd: "тама*н", pron: "тама*м", ru: "как раз" },
          { mkd: "џе*мпер", pron: "джэ*мпэр", ru: "свитер" },
        ],
      },
    },
  ],
};
