import { ParagraphSectionsProps } from "@/types";

const genderOfNouns: ParagraphSectionsProps = {
  type: "gender-of-noun",
  title: ["ГРАММАТИКА", "<span>ГРАМАТИКА</span>"],
  subtitle: ["ИМЯ СУЩЕСТВИТЕЛЬНОЕ"],
  content: {
    subtitle: ["РОД ИМЁН СУЩЕСТВИТЕЛЬНЫХ"],
    text: `Как и в русском языке, в македонском существительные делятся на существительные мужского, женского и среднего рода.
    Большинство существительных мужского рода оканчиваются на согласный: <span>брат</span>. К мужскому роду относятся существительные
    на <span>«-а»</span>, <span>«-о»</span>, <span>«-е»</span>, <span>«-у»</span>, <span>«-и»</span>, обозначающие лиц мужского пола:
    <span>су\u0301диjа</span> «судья», <span>И\u0301лија, Ма\u0301рко, та\u0301тко</span> «отец», <span>ву\u0301јко</span>
    «дядя» (со стороны матери), <span>де\u0301чко</span> «парень», <span>аташ\u0301е</span> «атташе», <span>Пе\u0301тре</span> «Пэтрэ»,
    <span>гу\u0301ру</span> «гуру», <span>де\u0301нди</span> «деньди», а также мужские имена и названия месяцев на:
    <span>«-и»</span>: <span>Г\u0301о\u0301рг\u0301и</span>, <span>Jануа\u0301ри</span>, <span>Февруа\u0301ри</span>.
    
    Существительные женского рода обычно оканчиваются на <span>«-а»</span> (<span>ма\u0301jка</span> «мать», <span>И\u0301вана</span>),
    некоторые - на согласный (<span>нок\u0301</span> «ночь», все с суффиксом <span>-ост</span>: <span>ра\u0301дост</span> «радость»,
    <span>мла\u0301дост</span> «молодость»). Женские имена на <span>«-и»</span>, <span>«-е»</span> могут восприниматься как существительные
    и женского, и среднего рода: <span>мо\u0301јата/ мо\u0301јето Ли\u0301ле, Ма\u0301хи</span>.
    
    Существительные среднего рода оканчиваются на <span>«-о»</span>, <span>«-е»</span>, <span>«-у»</span>, <span>«-и»</span>:
    <span>е\u0301зеро</span> «озеро», <span>мо\u0301мче</span> «парень», <span>де\u0301воjче</span> «девочка»,
    <span>жири\u0301</span> «жюри», <span>интервjу\u0301</span> «интервью, собеседование».
    
    Существительные с уменьшительно - ласкательным суффиксом <span>«-че»</span> обычно относятся к существительным среднего рода,
    однако если они обозначают лицо мужского пола, возможны колебания - некоторые слова будут мужского рода (<span>ву\u0301jче</span> «дядюшка»),
    а некоторые - среднего (<span>бра\u0301тче</span> «братик»).
    
    Есть существительные, которые в зависимости от пола обозначаемого ими лица могут согласовываться по женскому или по мужскому роду:
    <span>мо\u0301jата ро\u0301днина</span> «моя родственница» и <span>мо\u0301jот ро\u0301днина</span> «мой родственник». Русская
    лексикографическая традиция относит такие слова к существительным общего рода, а македнская трактует их как амонимы - один мужского
    рода, а другой женского.`,
  },
};

export default genderOfNouns;
