import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-1",
  sections: [
    {
      type: "paragraph-exercise",
      prompt: [
        `Трансформируйте текст, начав его с местоимений <span>jас, ти, ние, вие, тие</span>.`,
      ],
      content: {
        original: `Де*jан ста*нува ра*но, пие ка*фе, поjа*дува и о*ди на ра*бота. На ра*бота 
        чи*та и пи*шува. По*тоа ви*ка та*кси и о*ди на аеродро*м. Та*му се че*кира,
        поми*нува па*сошка и ца*ринска ко*нтрола. Ку*пува пода*роци за ро*днини и приjа*тели.
        По*тоа се*ди и че*ка зада се ка*чи на авио*н. Па*тува за Бе*рлин.
        `,
        answer: [
          `Jас станувам рано, пиjам кафе, поjадувам и одам на работа. На работа 
          читам и пишувам. Потоа викам такси и одам на аеродром. Таму се чекирам,
          поминувам пасошка и царинска контрола. Купувам подароци за роднини и приjатели.
          Потоа седам и чекам зада се качам на авион. Патувам за Берлин.`,

          `Ти стануваш рано, пиеш кафе, поjадуваш и одиш на работа. На работа
        читаш и пишуваш. Потоа викаш такси и одиш на аеродром. Таму се чекираш,
        поминуваш пасошка и царинска контрола. Купуваш подароци за роднини и приjатели.
        Потоа седиш и чекаш зада се качиш на авион. Патуваш за Берлин.`,

          `Ние стануваме рано, пиеме кафе, поjадуваме и одиме на работа. На работа
        читаме и пишуваме. Потоа викаме такси и одиме на аеродром. Таму се чекираме,
        поминуваме пасошка и царинска контрола. Купуваме подароци за роднини и приjатели.
        Потоа седиме и чекаме зада се качиме на авион. Патуваме за Берлин.`,

          `Вие станувате рано, пиете кафе, поjадувате и одите на работа. На работа
        читате и пишувате. Потоа викате такси и одите на аеродром. Таму се чекирате,
        поминувате пасошка и царинска контрола. Купувате подароци за роднини и приjатели.
        Потоа седите и чекате зада се качите на авион. Патувате за Берлин.`,

          `Тие стануваат рано, пиjат кафе, поjадуваат и одат на работа. На работа
        читаат и пишуваат. Потоа викаат такси и одат на аеродром. Таму се чекираат,
        поминуваат пасошка и царинска контрола. Купуваат подароци за роднини и приjатели.
        Потоа седат и чекаат зада се качат на авион. Патуваат за Берлин.`,
        ],
      },
    },
  ],
};
