// import { ParagraphExerciseProps } from "@/types/exerciseParagraphTypes";
import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-1",
  sections: [
    {
      type: "paragraph-exercise",
      prompt: [
        `Трансформируйте текст, начав его с местоимений <span>jас, ти, ние, вие, тие</span>.`,
      ],
      content: {
        original: `<span>Де\u0301jан ста\u0301нува ра\u0301но, пие ка\u0301фе, поjа\u0301дува и о\u0301ди на ра\u0301бота. На ра\u0301бота 
        чи\u0301та и пи\u0301шува. По\u0301тоа ви\u0301ка та\u0301кси и о\u0301ди на аеродро\u0301м. Та\u0301му се че\u0301кира,
        поми\u0301нува па\u0301сошка и ца\u0301ринска ко\u0301нтрола. Ку\u0301пува пода\u0301роци за ро\u0301днини и приjа\u0301тели.
        По\u0301тоа се\u0301ди и че\u0301ка зада се ка\u0301чи на авио\u0301н. Па\u0301тува за Бе\u0301рлин.</span>
        `,
        answer: [
          `Jас ста\u0301нувам ра\u0301но, пи\u0301jам ка\u0301фе, поjа\u0301дувам и о\u0301дам на ра\u0301бота. На ра\u0301бота 
          чи\u0301там и пи\u0301шувам. По\u0301тоа ви\u0301кам та\u0301кси и о\u0301дам на аеродро\u0301м. Та\u0301му се че\u0301кирам,
          поми\u0301нувам па\u0301сошка и ца\u0301ринска ко\u0301нтрола. Ку\u0301пувам пода\u0301роци за ро\u0301днини и приjа\u0301тели.
          По\u0301тоа се\u0301дам и че\u0301кам зада се ка\u0301чам на авио\u0301н. Па\u0301тувам за Бе\u0301рлин.`,

          `Ти ста\u0301нуваш ра\u0301но, пи\u0301еш ка\u0301фе, поjа\u0301дуваш и о\u0301диш на ра\u0301бота. На ра\u0301бота
        чи\u0301таш и пи\u0301шуваш. По\u0301тоа ви\u0301каш та\u0301кси и о\u0301диш на аеродро\u0301м. Та\u0301му се че\u0301кираш,
        поми\u0301нуваш па\u0301сошка и ца\u0301ринска ко\u0301нтрола. Ку\u0301пуваш пода\u0301роци за ро\u0301днини и приjа\u0301тели.
        По\u0301тоа се\u0301диш и че\u0301каш зада се ка\u0301чиш на авио\u0301н. Па\u0301туваш за Бе\u0301рлин.`,

          `Ние ста\u0301нуваме ра\u0301но, пи\u0301еме ка\u0301фе, поjа\u0301дуваме и о\u0301диме на ра\u0301бота. На ра\u0301бота
        чи\u0301таме и пи\u0301шуваме. По\u0301тоа ви\u0301каме та\u0301кси и о\u0301диме на аеродро\u0301м. Та\u0301му се че\u0301кираме,
        поми\u0301нуваме па\u0301сошка и ца\u0301ринска ко\u0301нтрола. Ку\u0301пуваме пода\u0301роци за ро\u0301днини и приjа\u0301тели.
        По\u0301тоа се\u0301диме и че\u0301каме зада се ка\u0301чиме на авио\u0301н. Па\u0301туваме за Бе\u0301рлин.`,

          `Вие ста\u0301нувате ра\u0301но, пи\u0301ете ка\u0301фе, поjа\u0301дувате и о\u0301дите на ра\u0301бота. На ра\u0301бота
        чи\u0301тате и пи\u0301шувате. По\u0301тоа ви\u0301кате та\u0301кси и о\u0301дите на аеродро\u0301м. Та\u0301му се че\u0301кирате,
        поми\u0301нувате па\u0301сошка и ца\u0301ринска ко\u0301нтрола. Ку\u0301пувате пода\u0301роци за ро\u0301днини и приjа\u0301тели.
        По\u0301тоа се\u0301дите и че\u0301кате зада се ка\u0301чите на авио\u0301н. Па\u0301тувате за Бе\u0301рлин.`,

          `Тие ста\u0301нуваат ра\u0301но, пи\u0301jат ка\u0301фе, поjа\u0301дуваат и о\u0301дат на ра\u0301бота. На ра\u0301бота
        чи\u0301таат и пи\u0301шуваат. По\u0301тоа ви\u0301каат та\u0301кси и о\u0301дат на аеродро\u0301м. Та\u0301му се че\u0301кираат,
        поми\u0301нуваат па\u0301сошка и ца\u0301ринска ко\u0301нтрола. Ку\u0301пуваат пода\u0301роци за ро\u0301днини и приjа\u0301тели.
        По\u0301тоа се\u0301дат и че\u0301каат зада се ка\u0301чат на авио\u0301н. Па\u0301туваат за Бе\u0301рлин.`,
        ],
      },
    },
  ],
};
