// import { ParagraphExerciseProps } from "@/types/exerciseParagraphTypes";
import { ExercisesProps } from "@/types";

export const exercise9: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 9",
  slug: "lesson-1",
  sections: [
    {
      type: "translate-paragraph-exercise",
      prompt: [`Переведите на македонский язык.`],
      content: {
        original: `1. Как вас зовут? - Меня зовут Елена. - Очень приятно, меня звовут Никола. - Никола, откуда вы? - Я из Македонии.
        А вы? - Я из Молдавии. - Вы молдованка? - Да, я молдованка, но живу в Скопье.
        2. - Добрый день! Ваши паспорта, пожалуйста. - Добрый день! Пожалуйста. - Куда едете? - В Скопье через Белград. - Приятного
        путешествия! - Спасибо! До свидания!
        3. - Извините, это выход для пассажиров в Белград? - Да. - Вы уверены? - Да. Я тоже еду в Белград. - Спасибо. - Не за что!`,
        answer: [
          `1. Како се викате? - Се викам Елена. - Мило ми е, се викам Никола. - Никола, от каде сте? - Од Македониjа сум. А вие? - Jас сум
          од Молдавиjа. - Молдованка сте? - Да, Молдованка сум, но живеам во Скопjе.
          2. - Добар ден! Вашите пасоши, ве молам. - Добар ден! Повелете. - Каде патувате? - За Скопjе преку Белград. - Пријатно
          патување! - Ви благодарам! Приjатно!
          3. - Извинете, ова е излезот за патниците за Белград? - Да. - Сигурни сте? - Да. Јас исто така патувам за Белград. - Ви благодарам. -
          Нема за што!`,
        ],
      },
    },
  ],
};
