import { ExercisesProps } from "@/types";

export const exercise1: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 1",
  slug: "lesson-1",
  sections: [
    {
      type: `static-exercise`,
      prompt: [
        `Прочитайте следующие слова и словосочетания, обращая внимание на правила чтения.`,
      ],
      content: {
        exercise: `ла*га, ли*це, љю*бов, г*а*ур, лу*ге, гон, ми*нистер, ср*це, че*ло, же*на, маж, Џон, шо*фер, sид, jа*дање, ку*ка, ку*Ќа,
        ќе*бе, ко*фте, о*ревче, Е*лена, Jе*лена, Ма*риjа, интервjу*, про*давач, прода*вачи, џез, кон, коњ, е*втин, телефо*н`,
      },
    },
  ],
};
