import { ExercisesProps } from "@/types";

export const exercise7: ExercisesProps = {
  type: "exercises",
  title: "Упражнение 7",
  slug: "lesson-1",
  sections: [
    {
      type: "paragraph-exercise",
      prompt: [
        `Трансформируйте текст, начав его с местоимений <span>jас, ти, ние, вие, тие</span>.`,
      ],
      content: {
        original: `Де*jан ста*нува ра*но, пие ка*фе, поjа*дува и о*ди на ра*бота. На ра*бота 
        чи*та и пи*шува. По*тоа ви*ка та*кси и о*ди на аеродро*м. Та*му се че*кира,
        поми*нува па*сошка и ца*ринска ко*нтрола. Ку*пува пода*роци за ро*днини и приjа*тели.
        По*тоа се*ди и че*ка зада се ка*чи на авио*н. Па*тува за Бе*рлин.
        `,
        answer: [
          `Jас ста*нувам ра*но, пи*jам ка*фе, поjа*дувам и о*дам на ра*бота. На ра*бота 
          чи*там и пи*шувам. По*тоа ви*кам та*кси и о*дам на аеродро*м. Та*му се че*кирам,
          поми*нувам па*сошка и ца*ринска ко*нтрола. Ку*пувам пода*роци за ро*днини и приjа*тели.
          По*тоа се*дам и че*кам зада се ка*чам на авио*н. Па*тувам за Бе*рлин.`,

          `Ти ста*нуваш ра*но, пи*еш ка*фе, поjа*дуваш и о*диш на ра*бота. На ра*бота
        чи*таш и пи*шуваш. По*тоа ви*каш та*кси и о*диш на аеродро*м. Та*му се че*кираш,
        поми*нуваш па*сошка и ца*ринска ко*нтрола. Ку*пуваш пода*роци за ро*днини и приjа*тели.
        По*тоа се*диш и че*каш зада се ка*чиш на авио*н. Па*туваш за Бе*рлин.`,

          `Ние ста*нуваме ра*но, пи*еме ка*фе, поjа*дуваме и о*диме на ра*бота. На ра*бота
        чи*таме и пи*шуваме. По*тоа ви*каме та*кси и о*диме на аеродро*м. Та*му се че*кираме,
        поми*нуваме па*сошка и ца*ринска ко*нтрола. Ку*пуваме пода*роци за ро*днини и приjа*тели.
        По*тоа се*диме и че*каме зада се ка*чиме на авио*н. Па*туваме за Бе*рлин.`,

          `Вие ста*нувате ра*но, пи*ете ка*фе, поjа*дувате и о*дите на ра*бота. На ра*бота
        чи*тате и пи*шувате. По*тоа ви*кате та*кси и о*дите на аеродро*м. Та*му се че*кирате,
        поми*нувате па*сошка и ца*ринска ко*нтрола. Ку*пувате пода*роци за ро*днини и приjа*тели.
        По*тоа се*дите и че*кате зада се ка*чите на авио*н. Па*тувате за Бе*рлин.`,

          `Тие ста*нуваат ра*но, пи*jат ка*фе, поjа*дуваат и о*дат на ра*бота. На ра*бота
        чи*таат и пи*шуваат. По*тоа ви*каат та*кси и о*дат на аеродро*м. Та*му се че*кираат,
        поми*нуваат па*сошка и ца*ринска ко*нтрола. Ку*пуваат пода*роци за ро*днини и приjа*тели.
        По*тоа се*дат и че*каат зада се ка*чат на авио*н. Па*туваат за Бе*рлин.`,
        ],
      },
    },
  ],
};
