import { TablesProps } from "@/types";

export const example10: TablesProps = {
  slug: "lesson-3",
  type: "example-10",
  content: {
    text: `Если подлежащее придаточного предложения выражено личным местоимением, оно обычно опускается (используется только при логическом
    выделении):
    `,
    words: [
      {
        mkd: `Са*кам да ми се jа*ви.`,
        ru: `Я хочу, чтобы вы мне позвонили.`,
      },
      {
        mkd: `Са*кам ви*е да ми се jа*вите.`,
        ru: `Я хочу, чтобы (именно) вы мне позвонили.`,
      },
    ],
  },
};
