import { TablesProps } from "@/types";

export const example8: TablesProps = {
  slug: "lesson-3",
  type: "example-8",
  content: {
    text: `Обратите внимание, что во втором предложении <span>о*вие докуме*нти</span> — подлежащее, поэтому глагол стоит в форме
    3-го лица мн.ч.
    
    В русском языке несколько инфинитивов могут зависеть от одного глагола, в македонском в этом случае будет несколько да-конструкций:
    `,
    words: [
      {
        mkd: `Са*кам да jа*дам, да пи*jам, а по*тоа да спи*jам.`,
        ru: `Я хочу есть, пить, а потом спать.`,
      },
    ],
  },
};
