import { ExampleSection } from "@/types";

export const example10: ExampleSection = {
  slug: "lesson-3",
  type: "example-10",
  content: {
    text: `Если подлежащее придаточного предложения выражено личным местоимением, оно обычно опускается (используется только при логическом
    выделении):
    `,
    words: [
      {
        mkd: `<span>Са\u0301кам да ми се jа\u0301ви.</span>`,
        ru: `Я хочу, чтобы вы мне позвонили.`,
      },
      {
        mkd: `<span>Са\u0301кам ви\u0301е да ми се jа\u0301вите.</span>`,
        ru: `Я хочу, чтобы (именно) вы мне позвонили.`,
      },
    ],
  },
};
