import { TablesProps } from "@/types";

export const example2: TablesProps = {
  slug: "lesson-12",
  type: "example-2",
  subtitle: "ПРИЧАСТИЕ",
  content: {
    text: `От глаголов совершенного вида, которые в аористе имеют основу на <span>-а</span>, причастия образуются с помощью суффиксов
    <span>-н-</span> или <span>-т-</span>. Суффикс <span>-т-</span> используется, если глагол оканчивается на <span>-не-</span>:
    <span>ста*не</span> «встать» — <span>ста*на</span> «встал» — <span>ста*нат</span> «вставший». В остальных случаях употребляется суффикс
    <span>-н-</span>: <span>ка*же</span> «сказать» — <span>ка*жа</span> «сказал» — <span>ка*жан</span> «сказанный».

    От некоторых глаголов на <span>-ере-</span> возможны два варианта причастий: <span>ра*збере</span> «понять» —
    <span>ра*збрен/ра*збран</span> «понятный» (<span>ра*збран</span> более популярная форма).

    От других глаголов совершенного и несовершенного вида причастие образуется от основы имперфекта (<span>-а-</span>, <span>-е-</span>
    сохраняются, <span>-и-</span> меняется на <span>-е-</span>): <span>чи*та</span> «читать» — <span>чи*тан</span> «читанный»,
    <span>про*чита</span> «прочитать» — <span>про*читан</span> «прочитанный», <span>у*мре</span> «умереть» — <span>у*мрен</span> «умерший»,
    <span>запо*знае</span> «ознакомить» — <span>запо*знаен</span> «ознакомленный», <span>бро*и</span> «считать» — <span>бро*ен</span> «считанный»,
    <span>ку*пи</span> «купить» — <span>ку*пен</span> «купленный».
    
    Македонские причастия на русский язык обычно переводятся страдательными причастиями прошедшего времени (см. <span>ка*жан</span>,
    <span>ра*збран</span>, <span>чи*тан</span>, <span>про*читан</span>, <span>бро*ен</span>, <span>ку*пен</span>), но иногда могут
    переводиться и действительными причастиями (см. <span>ста*нат</span>, <span>у*мрен</span>). Обратите внимание, что некоторые македонские
    глаголы могут быть переходными в отличие от русских: <span>И*ван ше*та</span> «Иван гуляет», <span>И*ван го ше*та ку*чето</span>
    «Иван выгуливает собаку». Причастия образованные от таких глаголов, переводятся в зависимости от контекста: <span>ше*тан чо*век</span>
    «повидавшй мир человек», <span>ше*тано ку*че</span> «выгуленная собака».
    
    При обращении на "Вы" к одному человеку причастие стоит в ед.ч.:`,
    words: [
      {
        mkd: "Ви*е сте по*канет/пока*нета.",
        ru: "Вы приглашены.",
      },
    ],
  },
};
