import { TablesProps } from "@/types";

export const example3: TablesProps = {
  slug: "lesson-12",
  type: "example-3",
  subtitle: "ПЕРФЕКТ",
  content: {
    text: `Перфект — это прошедшее время, которое используется, когда действие в прошлом или его результаты актуальны для момента речи. 
    Неважно, когда произошло действие, важно, что оно имело место быть (или не имело).`,
    words: [
      {
        mkd: "Да*ли не*когаш сте би*ле во Македо*ниjа?",
        ru: "Были ли вы когда-нибудь в Македонии?",
      },
      {
        mkd: "Ко*лку си се и*зменил!",
        ru: "Как ты изменился!",
      },
    ],
  },
};
