import { TablesProps } from "@/types";

export const example4: TablesProps = {
  slug: "lesson-12",
  type: "example-4",
  content: {
    text: `Порядок частиц: <span>не</span>, глагол «быть», д.п., в.п./<span>се</span>, л-форма Вспомогательнй глагол «быть» может стоять в 
    начале предложения.`,
    words: [
      {
        mkd: "Ни*когаш не сум му се зака*нувал на И*ван!",
        ru: "Я никогда не угрожал Ивану!",
      },
      {
        mkd: "Ни*когаш не му се зака*нувал на И*ван!",
        ru: "Он никогда не угрожал Ивану!",
      },
      {
        mkd: "Ни*когаш не си му го ра*скажал за тоа?",
        ru: "Ты никогда не рассказывал ему об этом?",
      },
      {
        mkd: "Сум му ка*жал сто*пати.",
        ru: "Я ему сто раз говорил.",
      },
    ],
  },
};
